namespace fb {

////////////////////////////////////////
// ClassId:   01398
// RuntimeId: 03760
// TypeInfo:  0x00000001427FCCC0
#ifndef _DataContainer_
#define _DataContainer_
#pragma pack(push, 8)
class DataContainer
{
public:
    static __inline DataContainer* DefaultInstance()
    {
        return (DataContainer*) 0x00000000687F0080;
    }
    static __inline unsigned int ClassId()
    {
        return 1398;
    }
    char _0x0000[16];
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01469
// RuntimeId: 03786
// TypeInfo:  0x00000001427FE2B0
#ifndef _Asset_
#define _Asset_
#pragma pack(push, 8)
class Asset : public DataContainer
{
public:
    static __inline Asset* DefaultInstance()
    {
        return (Asset*) 0x0000000068891D40;
    }
    static __inline unsigned int ClassId()
    {
        return 1469;
    }
    CString m_Name; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01884
// RuntimeId: 09942
// TypeInfo:  0x000000014288C320
#ifndef _WebBrowserLocalURLAsset_
#define _WebBrowserLocalURLAsset_
#pragma pack(push, 8)
class WebBrowserLocalURLAsset : public Asset
{
public:
    static __inline WebBrowserLocalURLAsset* DefaultInstance()
    {
        return (WebBrowserLocalURLAsset*) 0x000000006889AE90;
    }
    static __inline unsigned int ClassId()
    {
        return 1884;
    }
    CString m_LocalPath; //0x0018
    RawFileDataAsset* m_File; //0x0020
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03184
// RuntimeId: 06870
// TypeInfo:  0x0000000142849B90
#ifndef _LevelDescriptionComponent_
#define _LevelDescriptionComponent_
#pragma pack(push, 8)
class LevelDescriptionComponent : public DataContainer
{
public:
    static __inline LevelDescriptionComponent* DefaultInstance()
    {
        return (LevelDescriptionComponent*) 0x00000000688C8E00;
    }
    static __inline unsigned int ClassId()
    {
        return 3184;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03774
// RuntimeId: 03796
// TypeInfo:  0x00000001427FE190
#ifndef _SystemSettings_
#define _SystemSettings_
#pragma pack(push, 8)
class SystemSettings : public DataContainer
{
public:
    static __inline SystemSettings* DefaultInstance()
    {
        return (SystemSettings*) 0x00000000688D5D30;
    }
    static __inline unsigned int ClassId()
    {
        return 3774;
    }
    CString m_Name; //0x0010
    GamePlatform m_Platform; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02154
// RuntimeId: 03792
// TypeInfo:  0x00000001427FE250
#ifndef _GameDataContainer_
#define _GameDataContainer_
#pragma pack(push, 8)
class GameDataContainer : public DataContainer
{
public:
    static __inline GameDataContainer* DefaultInstance()
    {
        return (GameDataContainer*) 0x00000000688A0B60;
    }
    static __inline unsigned int ClassId()
    {
        return 2154;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02156
// RuntimeId: 03794
// TypeInfo:  0x00000001427FE1F0
#ifndef _DataBusPeer_
#define _DataBusPeer_
#pragma pack(push, 8)
class DataBusPeer : public GameDataContainer
{
public:
    static __inline DataBusPeer* DefaultInstance()
    {
        return (DataBusPeer*) 0x00000000688A0CD0;
    }
    static __inline unsigned int ClassId()
    {
        return 2156;
    }
    Uint32 m_Flags; //0x0010
    char _0x0014[4];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02157
// RuntimeId: 05066
// TypeInfo:  0x000000014281E750
#ifndef _GameObjectData_
#define _GameObjectData_
#pragma pack(push, 8)
class GameObjectData : public DataBusPeer
{
public:
    static __inline GameObjectData* DefaultInstance()
    {
        return (GameObjectData*) 0x00000000688A0D00;
    }
    static __inline unsigned int ClassId()
    {
        return 2157;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02953
// RuntimeId: 05082
// TypeInfo:  0x000000014281E510
#ifndef _ComponentData_
#define _ComponentData_
#pragma pack(push, 16)
class ComponentData : public GameObjectData
{
public:
    static __inline ComponentData* DefaultInstance()
    {
        return (ComponentData*) 0x00000000688BCD80;
    }
    static __inline unsigned int ClassId()
    {
        return 2953;
    }
    Array<GameObjectData*> m_Components; //0x0018
    LinearTransform m_Transform; //0x0020
    Boolean m_Excluded; //0x0060
    char _0x0061[15];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02190
// RuntimeId: 05072
// TypeInfo:  0x000000014281E6F0
#ifndef _EntityData_
#define _EntityData_
#pragma pack(push, 8)
class EntityData : public GameObjectData
{
public:
    static __inline EntityData* DefaultInstance()
    {
        return (EntityData*) 0x00000000688A2170;
    }
    static __inline unsigned int ClassId()
    {
        return 2190;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01904
// RuntimeId: 09924
// TypeInfo:  0x000000014288BF20
#ifndef _WaterEffectSetup_
#define _WaterEffectSetup_
#pragma pack(push, 8)
class WaterEffectSetup : public Asset
{
public:
    static __inline WaterEffectSetup* DefaultInstance()
    {
        return (WaterEffectSetup*) 0x000000006889B4D0;
    }
    static __inline unsigned int ClassId()
    {
        return 1904;
    }
    Array<WaterAmbientFoamEffectSpawner> m_AmbientEffects; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00302
// RuntimeId: 05378
// TypeInfo:  0x0000000142821F50
#ifndef _EntityBusPeer_
#define _EntityBusPeer_
class EntityBusPeer
{
public:
    static __inline unsigned int ClassId()
    {
        return 302;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00592
// RuntimeId: 04902
// TypeInfo:  0x00000001428162D0
#ifndef _Entity_
#define _Entity_
class Entity : public EntityBusPeer
{
public:
    static __inline unsigned int ClassId()
    {
        return 592;
    }
    char _0x0008[24];
};//Size=0x0020
#endif

////////////////////////////////////////
// ClassId:   00303
// RuntimeId: 05442
// TypeInfo:  0x00000001428236B0
#ifndef _Component_
#define _Component_
class Component : public EntityBusPeer
{
public:
    static __inline unsigned int ClassId()
    {
        return 303;
    }
    char _0x0008[24];
};//Size=0x0020
#endif

////////////////////////////////////////
// ClassId:   00640
// RuntimeId: 05284
// TypeInfo:  0x0000000142821AF0
#ifndef _SpatialEntity_
#define _SpatialEntity_
class SpatialEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 640;
    }
    char _0x0020[8];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00529
// RuntimeId: 08188
// TypeInfo:  0x0000000142865410
#ifndef _PhysicsComponent_
#define _PhysicsComponent_
class PhysicsComponent : public Component
{
public:
    static __inline unsigned int ClassId()
    {
        return 529;
    }
    char _0x0020[8];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00661
// RuntimeId: 05443
// TypeInfo:  0x0000000142823840
#ifndef _ComponentEntity_
#define _ComponentEntity_
class ComponentEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 661;
    }
    char _0x0028[24];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00647
// RuntimeId: 09912
// TypeInfo:  0x000000014288B8C0
#ifndef _WaterInteractTurbulenceDisturbEntity_
#define _WaterInteractTurbulenceDisturbEntity_
class WaterInteractTurbulenceDisturbEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 647;
    }
    char _0x0028[72];
};//Size=0x0070
#endif

////////////////////////////////////////
// ClassId:   02395
// RuntimeId: 09910
// TypeInfo:  0x000000014288B3F0
#ifndef _VoipEntityData_
#define _VoipEntityData_
#pragma pack(push, 8)
class VoipEntityData : public EntityData
{
public:
    static __inline VoipEntityData* DefaultInstance()
    {
        return (VoipEntityData*) 0x00000000688A6BF0;
    }
    static __inline unsigned int ClassId()
    {
        return 2395;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01339
// RuntimeId: 09908
// TypeInfo:  0x000000014288B450
#ifndef _VoipEntity_
#define _VoipEntity_
class VoipEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1339;
    }
    char _0x0020[32];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   03194
// RuntimeId: 09907
// TypeInfo:  0x000000014288AF20
#ifndef _TireTrailsLevelDescriptionComponent_
#define _TireTrailsLevelDescriptionComponent_
#pragma pack(push, 8)
class TireTrailsLevelDescriptionComponent : public LevelDescriptionComponent
{
public:
    static __inline TireTrailsLevelDescriptionComponent* DefaultInstance()
    {
        return (TireTrailsLevelDescriptionComponent*) 0x00000000688C91F0;
    }
    static __inline unsigned int ClassId()
    {
        return 3194;
    }
    Boolean m_Enabled; //0x0010
    char _0x0011[7];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01786
// RuntimeId: 05088
// TypeInfo:  0x000000014281E3F0
#ifndef _DataContainerPolicyAsset_
#define _DataContainerPolicyAsset_
#pragma pack(push, 8)
class DataContainerPolicyAsset : public Asset
{
public:
    static __inline DataContainerPolicyAsset* DefaultInstance()
    {
        return (DataContainerPolicyAsset*) 0x0000000068898780;
    }
    static __inline unsigned int ClassId()
    {
        return 1786;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02989
// RuntimeId: 05084
// TypeInfo:  0x000000014281E4B0
#ifndef _GameComponentData_
#define _GameComponentData_
#pragma pack(push, 16)
class GameComponentData : public ComponentData
{
public:
    static __inline GameComponentData* DefaultInstance()
    {
        return (GameComponentData*) 0x00000000688BE3A0;
    }
    static __inline unsigned int ClassId()
    {
        return 2989;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03682
// RuntimeId: 05314
// TypeInfo:  0x0000000142821150
#ifndef _MaterialRelationPropertyData_
#define _MaterialRelationPropertyData_
#pragma pack(push, 8)
class MaterialRelationPropertyData : public DataContainer
{
public:
    static __inline MaterialRelationPropertyData* DefaultInstance()
    {
        return (MaterialRelationPropertyData*) 0x00000000688D45A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3682;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02343
// RuntimeId: 09895
// TypeInfo:  0x000000014288B040
#ifndef _TireTrailManagerEntityData_
#define _TireTrailManagerEntityData_
#pragma pack(push, 8)
class TireTrailManagerEntityData : public EntityData
{
public:
    static __inline TireTrailManagerEntityData* DefaultInstance()
    {
        return (TireTrailManagerEntityData*) 0x00000000688A5630;
    }
    static __inline unsigned int ClassId()
    {
        return 2343;
    }
    Realm m_Realm; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01808
// RuntimeId: 09893
// TypeInfo:  0x000000014288B160
#ifndef _RibbonVolumeTemplateData_
#define _RibbonVolumeTemplateData_
#pragma pack(push, 8)
class RibbonVolumeTemplateData : public DataContainerPolicyAsset
{
public:
    static __inline RibbonVolumeTemplateData* DefaultInstance()
    {
        return (RibbonVolumeTemplateData*) 0x0000000068899180;
    }
    static __inline unsigned int ClassId()
    {
        return 1808;
    }
    SurfaceShaderBaseAsset* m_Shader; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02408
// RuntimeId: 05074
// TypeInfo:  0x000000014281E690
#ifndef _SpatialEntityData_
#define _SpatialEntityData_
#pragma pack(push, 16)
class SpatialEntityData : public EntityData
{
public:
    static __inline SpatialEntityData* DefaultInstance()
    {
        return (SpatialEntityData*) 0x00000000688A70E0;
    }
    static __inline unsigned int ClassId()
    {
        return 2408;
    }
    char _0x0018[8];
    LinearTransform m_Transform; //0x0020
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01259
// RuntimeId: 09889
// TypeInfo:  0x000000014288B1C0
#ifndef _ClientTireTrailManagerEntity_
#define _ClientTireTrailManagerEntity_
class ClientTireTrailManagerEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1259;
    }
    char _0x0020[3568];
};//Size=0x0E10
#endif

////////////////////////////////////////
// ClassId:   00304
// RuntimeId: 05861
// TypeInfo:  0x00000001428318C0
#ifndef _GameComponent_
#define _GameComponent_
class GameComponent : public Component
{
public:
    static __inline unsigned int ClassId()
    {
        return 304;
    }
    char _0x0020[16];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   01310
// RuntimeId: 08929
// TypeInfo:  0x0000000142875260
#ifndef _RenderVolumeEntity_
#define _RenderVolumeEntity_
class RenderVolumeEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1310;
    }
    char _0x0020[128];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   03428
// RuntimeId: 07786
// TypeInfo:  0x000000014285DB80
#ifndef _ToolData_
#define _ToolData_
#pragma pack(push, 8)
class ToolData : public DataContainer
{
public:
    static __inline ToolData* DefaultInstance()
    {
        return (ToolData*) 0x00000000688CEB60;
    }
    static __inline unsigned int ClassId()
    {
        return 3428;
    }
    Boolean m_IsAlwaysActive; //0x0010
    char _0x0011[7];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03126
// RuntimeId: 09884
// TypeInfo:  0x000000014288A8B0
#ifndef _WeaponZeroingComponentData_
#define _WeaponZeroingComponentData_
#pragma pack(push, 16)
class WeaponZeroingComponentData : public GameComponentData
{
public:
    static __inline WeaponZeroingComponentData* DefaultInstance()
    {
        return (WeaponZeroingComponentData*) 0x00000000688C64E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3126;
    }
    Int32 m_CycleInputAction; //0x0070
    Boolean m_Enabled; //0x0074
    char _0x0075[11];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01436
// RuntimeId: 07802
// TypeInfo:  0x000000014285D8E0
#ifndef _WeaponModifierBase_
#define _WeaponModifierBase_
#pragma pack(push, 8)
class WeaponModifierBase : public DataContainer
{
public:
    static __inline WeaponModifierBase* DefaultInstance()
    {
        return (WeaponModifierBase*) 0x0000000068891410;
    }
    static __inline unsigned int ClassId()
    {
        return 1436;
    }
    Int32 m_ApplyOrder; //0x0010
    char _0x0014[4];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03537
// RuntimeId: 07838
// TypeInfo:  0x000000014285D460
#ifndef _WeaponSwayData_
#define _WeaponSwayData_
#pragma pack(push, 8)
class WeaponSwayData : public DataContainer
{
public:
    static __inline WeaponSwayData* DefaultInstance()
    {
        return (WeaponSwayData*) 0x00000000688D1090;
    }
    static __inline unsigned int ClassId()
    {
        return 3537;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01905
// RuntimeId: 09874
// TypeInfo:  0x000000014288A9D0
#ifndef _GunSwayModifierData_
#define _GunSwayModifierData_
#pragma pack(push, 8)
class GunSwayModifierData : public Asset
{
public:
    static __inline GunSwayModifierData* DefaultInstance()
    {
        return (GunSwayModifierData*) 0x000000006889B510;
    }
    static __inline unsigned int ClassId()
    {
        return 1905;
    }
    GunSwayStanceZoomModifierData m_StandZoomModifier; //0x0018
    GunSwayStanceZoomModifierData m_StandNoZoomModifier; //0x005C
    GunSwayStanceZoomModifierData m_CrouchZoomModifier; //0x00A0
    GunSwayStanceZoomModifierData m_CrouchNoZoomModifier; //0x00E4
    GunSwayStanceZoomModifierData m_ProneZoomModifier; //0x0128
    GunSwayStanceZoomModifierData m_ProneNoZoomModifier; //0x016C
    Boolean m_OnlyInSupportedShooting; //0x01B0
    Boolean m_OnlyOnWeaponLightEnabled; //0x01B1
    char _0x01B2[6];
};//Size=0x01B8
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03333
// RuntimeId: 09856
// TypeInfo:  0x000000014288AA30
#ifndef _CameraRecoilData_
#define _CameraRecoilData_
#pragma pack(push, 8)
class CameraRecoilData : public DataContainer
{
public:
    static __inline CameraRecoilData* DefaultInstance()
    {
        return (CameraRecoilData*) 0x00000000688CC970;
    }
    static __inline unsigned int ClassId()
    {
        return 3333;
    }
    Float32 m_SpringConstant; //0x0010
    Float32 m_SpringDamping; //0x0014
    Float32 m_SpringMinThresholdAngle; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02397
// RuntimeId: 09848
// TypeInfo:  0x00000001428874D0
#ifndef _WeaponLagEntityData_
#define _WeaponLagEntityData_
#pragma pack(push, 8)
class WeaponLagEntityData : public EntityData
{
public:
    static __inline WeaponLagEntityData* DefaultInstance()
    {
        return (WeaponLagEntityData*) 0x00000000688A6CE0;
    }
    static __inline unsigned int ClassId()
    {
        return 2397;
    }
    WeaponLagBinding m_Binding; //0x0018
    char _0x007C[4];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03602
// RuntimeId: 09844
// TypeInfo:  0x0000000142887530
#ifndef _WeaponStateData1p_
#define _WeaponStateData1p_
#pragma pack(push, 8)
class WeaponStateData1p : public DataContainer
{
public:
    static __inline WeaponStateData1p* DefaultInstance()
    {
        return (WeaponStateData1p*) 0x00000000688D2A10;
    }
    static __inline unsigned int ClassId()
    {
        return 3602;
    }
    Array<WeaponMesh1p> m_WeaponMesh1p; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03234
// RuntimeId: 09840
// TypeInfo:  0x0000000142887590
#ifndef _SoldierWeaponBlueprintPipelineSettings_
#define _SoldierWeaponBlueprintPipelineSettings_
#pragma pack(push, 8)
class SoldierWeaponBlueprintPipelineSettings : public DataContainer
{
public:
    static __inline SoldierWeaponBlueprintPipelineSettings* DefaultInstance()
    {
        return (SoldierWeaponBlueprintPipelineSettings*) 0x00000000688CA360;
    }
    static __inline unsigned int ClassId()
    {
        return 3234;
    }
    Boolean m_DisableOnDemandLoading; //0x0010
    char _0x0011[7];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03725
// RuntimeId: 09732
// TypeInfo:  0x0000000142888670
#ifndef _ExplosionPackTrigger_
#define _ExplosionPackTrigger_
#pragma pack(push, 8)
class ExplosionPackTrigger : public DataContainer
{
public:
    static __inline ExplosionPackTrigger* DefaultInstance()
    {
        return (ExplosionPackTrigger*) 0x00000000688D50E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3725;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02418
// RuntimeId: 05078
// TypeInfo:  0x000000014281E5D0
#ifndef _ComponentEntityData_
#define _ComponentEntityData_
#pragma pack(push, 16)
class ComponentEntityData : public SpatialEntityData
{
public:
    static __inline ComponentEntityData* DefaultInstance()
    {
        return (ComponentEntityData*) 0x00000000688A7740;
    }
    static __inline unsigned int ClassId()
    {
        return 2418;
    }
    Array<GameObjectData*> m_Components; //0x0060
    Uint8 m_ClientRuntimeComponentCount; //0x0068
    Uint8 m_ServerRuntimeComponentCount; //0x0069
    Uint8 m_ClientRuntimeTransformationCount; //0x006A
    Uint8 m_ServerRuntimeTransformationCount; //0x006B
    char _0x006C[4];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01860
// RuntimeId: 05244
// TypeInfo:  0x000000014281CAD0
#ifndef _SharedBundleBaseAsset_
#define _SharedBundleBaseAsset_
#pragma pack(push, 8)
class SharedBundleBaseAsset : public Asset
{
public:
    static __inline SharedBundleBaseAsset* DefaultInstance()
    {
        return (SharedBundleBaseAsset*) 0x000000006889A670;
    }
    static __inline unsigned int ClassId()
    {
        return 1860;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03253
// RuntimeId: 09512
// TypeInfo:  0x0000000142889C30
#ifndef _SocketObjectDataBase_
#define _SocketObjectDataBase_
#pragma pack(push, 8)
class SocketObjectDataBase : public DataContainer
{
public:
    static __inline SocketObjectDataBase* DefaultInstance()
    {
        return (SocketObjectDataBase*) 0x00000000688CAB40;
    }
    static __inline unsigned int ClassId()
    {
        return 3253;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03254
// RuntimeId: 09828
// TypeInfo:  0x00000001428877D0
#ifndef _WeaponSocketObjectData_
#define _WeaponSocketObjectData_
#pragma pack(push, 8)
class WeaponSocketObjectData : public SocketObjectDataBase
{
public:
    static __inline WeaponSocketObjectData* DefaultInstance()
    {
        return (WeaponSocketObjectData*) 0x00000000688CAB70;
    }
    static __inline unsigned int ClassId()
    {
        return 3254;
    }
    Asset* m_Used1p; //0x0010
    Asset* m_Used1pZoom; //0x0018
    Asset* m_Used3p; //0x0020
    Asset* m_Used3pZoom; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03255
// RuntimeId: 09832
// TypeInfo:  0x0000000142887710
#ifndef _WeaponSkinnedSocketObjectData_
#define _WeaponSkinnedSocketObjectData_
#pragma pack(push, 8)
class WeaponSkinnedSocketObjectData : public WeaponSocketObjectData
{
public:
    static __inline WeaponSkinnedSocketObjectData* DefaultInstance()
    {
        return (WeaponSkinnedSocketObjectData*) 0x00000000688CABC0;
    }
    static __inline unsigned int ClassId()
    {
        return 3255;
    }
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01447
// RuntimeId: 09822
// TypeInfo:  0x0000000142887830
#ifndef _CustomWeaponTypeModifier_
#define _CustomWeaponTypeModifier_
#pragma pack(push, 8)
class CustomWeaponTypeModifier : public WeaponModifierBase
{
public:
    static __inline CustomWeaponTypeModifier* DefaultInstance()
    {
        return (CustomWeaponTypeModifier*) 0x00000000688916D0;
    }
    static __inline unsigned int ClassId()
    {
        return 1447;
    }
    WeaponData* m_CustomWeaponType; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01448
// RuntimeId: 09820
// TypeInfo:  0x0000000142887890
#ifndef _WeaponZoomLevelModifier_
#define _WeaponZoomLevelModifier_
#pragma pack(push, 8)
class WeaponZoomLevelModifier : public WeaponModifierBase
{
public:
    static __inline WeaponZoomLevelModifier* DefaultInstance()
    {
        return (WeaponZoomLevelModifier*) 0x0000000068891710;
    }
    static __inline unsigned int ClassId()
    {
        return 1448;
    }
    Int32 m_ZoomLevelIndex; //0x0018
    char _0x001C[4];
    ZoomLevelData* m_ZoomLevel; //0x0020
    WeaponZoomLevelData* m_WeaponZoomLevel; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01449
// RuntimeId: 09818
// TypeInfo:  0x00000001428878F0
#ifndef _WeaponZoomModifier_
#define _WeaponZoomModifier_
#pragma pack(push, 8)
class WeaponZoomModifier : public WeaponModifierBase
{
public:
    static __inline WeaponZoomModifier* DefaultInstance()
    {
        return (WeaponZoomModifier*) 0x0000000068891760;
    }
    static __inline unsigned int ClassId()
    {
        return 1449;
    }
    Float32 m_ZoomRenderFov; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01441
// RuntimeId: 09816
// TypeInfo:  0x0000000142887950
#ifndef _WeaponClassModifier_
#define _WeaponClassModifier_
#pragma pack(push, 8)
class WeaponClassModifier : public WeaponModifierBase
{
public:
    static __inline WeaponClassModifier* DefaultInstance()
    {
        return (WeaponClassModifier*) 0x0000000068891540;
    }
    static __inline unsigned int ClassId()
    {
        return 1441;
    }
    WeaponClassEnum m_WeaponClass; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01442
// RuntimeId: 09814
// TypeInfo:  0x00000001428879B0
#ifndef _WeaponAnimatedFireTypeModifier_
#define _WeaponAnimatedFireTypeModifier_
#pragma pack(push, 8)
class WeaponAnimatedFireTypeModifier : public WeaponModifierBase
{
public:
    static __inline WeaponAnimatedFireTypeModifier* DefaultInstance()
    {
        return (WeaponAnimatedFireTypeModifier*) 0x0000000068891580;
    }
    static __inline unsigned int ClassId()
    {
        return 1442;
    }
    AnimatedFireEnum m_AnimatedFireType; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01438
// RuntimeId: 09812
// TypeInfo:  0x0000000142887A10
#ifndef _WeaponAnimTypeModifier_
#define _WeaponAnimTypeModifier_
#pragma pack(push, 8)
class WeaponAnimTypeModifier : public WeaponModifierBase
{
public:
    static __inline WeaponAnimTypeModifier* DefaultInstance()
    {
        return (WeaponAnimTypeModifier*) 0x0000000068891480;
    }
    static __inline unsigned int ClassId()
    {
        return 1438;
    }
    WeaponAnimType m_WeaponAnimType; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01450
// RuntimeId: 09808
// TypeInfo:  0x0000000142887A70
#ifndef _WeaponAnimationConfigurationModifier_
#define _WeaponAnimationConfigurationModifier_
#pragma pack(push, 8)
class WeaponAnimationConfigurationModifier : public WeaponModifierBase
{
public:
    static __inline WeaponAnimationConfigurationModifier* DefaultInstance()
    {
        return (WeaponAnimationConfigurationModifier*) 0x00000000688917A0;
    }
    static __inline unsigned int ClassId()
    {
        return 1450;
    }
    AnimatedFireEnum m_AnimatedFireType; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02419
// RuntimeId: 05080
// TypeInfo:  0x000000014281E570
#ifndef _GameComponentEntityData_
#define _GameComponentEntityData_
#pragma pack(push, 16)
class GameComponentEntityData : public ComponentEntityData
{
public:
    static __inline GameComponentEntityData* DefaultInstance()
    {
        return (GameComponentEntityData*) 0x00000000688A77D0;
    }
    static __inline unsigned int ClassId()
    {
        return 2419;
    }
    Boolean m_Enabled; //0x0070
    char _0x0071[15];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02430
// RuntimeId: 08134
// TypeInfo:  0x0000000142863A50
#ifndef _GamePhysicsEntityData_
#define _GamePhysicsEntityData_
#pragma pack(push, 16)
class GamePhysicsEntityData : public GameComponentEntityData
{
public:
    static __inline GamePhysicsEntityData* DefaultInstance()
    {
        return (GamePhysicsEntityData*) 0x00000000688A8420;
    }
    static __inline unsigned int ClassId()
    {
        return 2430;
    }
    PhysicsEntityData* m_PhysicsData; //0x0080
    char _0x0088[8];
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02431
// RuntimeId: 07716
// TypeInfo:  0x000000014285DFA0
#ifndef _ProjectileEntityData_
#define _ProjectileEntityData_
#pragma pack(push, 16)
class ProjectileEntityData : public GamePhysicsEntityData
{
public:
    static __inline ProjectileEntityData* DefaultInstance()
    {
        return (ProjectileEntityData*) 0x00000000688A84D0;
    }
    static __inline unsigned int ClassId()
    {
        return 2431;
    }
    Float32 m_InitialSpeed; //0x0090
    Float32 m_TimeToLive; //0x0094
    Uint32 m_MaxCount; //0x0098
    Float32 m_InitMeshHideTime; //0x009C
    Float32 m_VisualConvergeDistance; //0x00A0
    Float32 m_VisualConvergenceDelay; //0x00A4
    Float32 m_VisualConvergenceDuration; //0x00A8
    Float32 m_ProxyVisualConvergenceDelay; //0x00AC
    Float32 m_ProxyVisualConvergenceDuration; //0x00B0
    char _0x00B4[4];
    ExplosionEntityData* m_Explosion; //0x00B8
    WeaponSuppressionData* m_SuppressionData; //0x00C0
    CString m_AmmunitionType; //0x00C8
    MaterialDecl m_MaterialPair; //0x00D0
    AntHitReactionWeaponType m_HitReactionWeaponType; //0x00D4
    Boolean m_DetonateOnTimeout; //0x00D8
    Boolean m_ServerProjectileDisabled; //0x00D9
    Boolean m_HideOnDetonation; //0x00DA
    Boolean m_VehicleLightingEnable; //0x00DB
    char _0x00DC[4];
};//Size=0x00E0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03429
// RuntimeId: 07788
// TypeInfo:  0x000000014285DB20
#ifndef _WeaponData_
#define _WeaponData_
#pragma pack(push, 8)
class WeaponData : public ToolData
{
public:
    static __inline WeaponData* DefaultInstance()
    {
        return (WeaponData*) 0x00000000688CEB90;
    }
    static __inline unsigned int ClassId()
    {
        return 3429;
    }
    Boolean m_ShowLaserPaintedVehicles; //0x0018
    char _0x0019[7];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03448
// RuntimeId: 09796
// TypeInfo:  0x0000000142887C50
#ifndef _SpyderHunterWeaponData_
#define _SpyderHunterWeaponData_
#pragma pack(push, 8)
class SpyderHunterWeaponData : public WeaponData
{
public:
    static __inline SpyderHunterWeaponData* DefaultInstance()
    {
        return (SpyderHunterWeaponData*) 0x00000000688CF350;
    }
    static __inline unsigned int ClassId()
    {
        return 3448;
    }
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03438
// RuntimeId: 09794
// TypeInfo:  0x0000000142887CB0
#ifndef _BallisticShieldWeaponData_
#define _BallisticShieldWeaponData_
#pragma pack(push, 16)
class BallisticShieldWeaponData : public WeaponData
{
public:
    static __inline BallisticShieldWeaponData* DefaultInstance()
    {
        return (BallisticShieldWeaponData*) 0x00000000688CEEC0;
    }
    static __inline unsigned int ClassId()
    {
        return 3438;
    }
    Vec3 m_ADSZeroPitchOffset; //0x0020
    Vec3 m_ADSMinPitchOffset; //0x0030
    Vec3 m_ADSMaxPitchOffset; //0x0040
    Vec3 m_CrouchZeroPitchOffset; //0x0050
    Vec3 m_CrouchMinPitchOffset; //0x0060
    Vec3 m_CrouchMaxPitchOffset; //0x0070
    Vec3 m_CrouchMoveZeroPitchOffset; //0x0080
    Vec3 m_CrouchMoveMinPitchOffset; //0x0090
    Vec3 m_CrouchMoveMaxPitchOffset; //0x00A0
    LinearTransform m_SprintOffset; //0x00B0
    Float32 m_MaxHealth; //0x00F0
    char _0x00F4[4];
    ObjectBlueprint* m_PhysicsBlueprint; //0x00F8
    Float32 m_DestructionMeshHealth; //0x0100
    char _0x0104[4];
    ObjectBlueprint* m_DestructionMeshBlueprint1p; //0x0108
    ObjectBlueprint* m_DestructionMeshBlueprint3p; //0x0110
    char _0x0118[8];
};//Size=0x0120
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03446
// RuntimeId: 09792
// TypeInfo:  0x0000000142887D10
#ifndef _SupplySphereWeaponData_
#define _SupplySphereWeaponData_
#pragma pack(push, 8)
class SupplySphereWeaponData : public WeaponData
{
public:
    static __inline SupplySphereWeaponData* DefaultInstance()
    {
        return (SupplySphereWeaponData*) 0x00000000688CF2A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3446;
    }
    SupplyData m_SupplyData; //0x0020
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02032
// RuntimeId: 09784
// TypeInfo:  0x0000000142887E30
#ifndef _SupplyUnitSphereData_
#define _SupplyUnitSphereData_
#pragma pack(push, 8)
class SupplyUnitSphereData : public DataContainer
{
public:
    static __inline SupplyUnitSphereData* DefaultInstance()
    {
        return (SupplyUnitSphereData*) 0x000000006889E260;
    }
    static __inline unsigned int ClassId()
    {
        return 2032;
    }
    Float32 m_Radius; //0x0010
    Float32 m_MaxRadius; //0x0014
    Float32 m_RadiusChangeTime; //0x0018
    Float32 m_SupplyIncSpeed; //0x001C
    Float32 m_InstantRefill; //0x0020
    Float32 m_SupplyPointsRefillSpeed; //0x0024
    Float32 m_SupplyPointsCapacity; //0x0028
    Boolean m_ForceUseInstantRefill; //0x002C
    Boolean m_InfiniteCapacity; //0x002D
    char _0x002E[2];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02034
// RuntimeId: 09786
// TypeInfo:  0x0000000142887DD0
#ifndef _HealingSupplyUnitSphereData_
#define _HealingSupplyUnitSphereData_
#pragma pack(push, 8)
class HealingSupplyUnitSphereData : public SupplyUnitSphereData
{
public:
    static __inline HealingSupplyUnitSphereData* DefaultInstance()
    {
        return (HealingSupplyUnitSphereData*) 0x000000006889E300;
    }
    static __inline unsigned int ClassId()
    {
        return 2034;
    }
    Float32 m_DistributeHealingOverTime; //0x0030
    char _0x0034[4];
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02033
// RuntimeId: 09788
// TypeInfo:  0x0000000142887D70
#ifndef _AmmoSupplyUnitSphereData_
#define _AmmoSupplyUnitSphereData_
#pragma pack(push, 8)
class AmmoSupplyUnitSphereData : public SupplyUnitSphereData
{
public:
    static __inline AmmoSupplyUnitSphereData* DefaultInstance()
    {
        return (AmmoSupplyUnitSphereData*) 0x000000006889E2B0;
    }
    static __inline unsigned int ClassId()
    {
        return 2033;
    }
    Array<WeaponClassEnum> m_IgnoredWeaponClasses; //0x0030
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01444
// RuntimeId: 09782
// TypeInfo:  0x0000000142887E90
#ifndef _WeaponAimingSimulationModifier_
#define _WeaponAimingSimulationModifier_
#pragma pack(push, 8)
class WeaponAimingSimulationModifier : public WeaponModifierBase
{
public:
    static __inline WeaponAimingSimulationModifier* DefaultInstance()
    {
        return (WeaponAimingSimulationModifier*) 0x0000000068891600;
    }
    static __inline unsigned int ClassId()
    {
        return 1444;
    }
    SoldierAimingSimulationData* m_AimingController; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03160
// RuntimeId: 09780
// TypeInfo:  0x0000000142887EF0
#ifndef _SoldierAimingSimulationData_
#define _SoldierAimingSimulationData_
#pragma pack(push, 8)
class SoldierAimingSimulationData : public GameDataContainer
{
public:
    static __inline SoldierAimingSimulationData* DefaultInstance()
    {
        return (SoldierAimingSimulationData*) 0x00000000688C83C0;
    }
    static __inline unsigned int ClassId()
    {
        return 3160;
    }
    Array<ZoomLevelData*> m_ZoomLevels; //0x0010
    SoldierAimAssistData* m_AimAssist; //0x0018
    AimingPoseData m_StandPose; //0x0020
    AimingPoseData m_CrouchPose; //0x0038
    AimingPoseData m_PronePose; //0x0050
    Float32 m_ZoomTransitionTime; //0x0068
    char _0x006C[4];
    Array<ZoomLevelSpecificTransitionTime> m_ZoomTransitionTimeArray; //0x0070
    Float32 m_FovDelayTime; //0x0078
    Float32 m_FovTransitionTime; //0x007C
    Float32 m_AimingRange; //0x0080
    Float32 m_LockAimToTargetSpeed; //0x0084
    Array<AimerModifierData*> m_Modifiers; //0x0088
    Boolean m_ReturnToZoomAfterReload; //0x0090
    char _0x0091[7];
};//Size=0x0098
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03261
// RuntimeId: 09778
// TypeInfo:  0x0000000142887F50
#ifndef _ZoomLevelData_
#define _ZoomLevelData_
#pragma pack(push, 8)
class ZoomLevelData : public DataContainer
{
public:
    static __inline ZoomLevelData* DefaultInstance()
    {
        return (ZoomLevelData*) 0x00000000688CADC0;
    }
    static __inline unsigned int ClassId()
    {
        return 3261;
    }
    Float32 m_FieldOfView; //0x0010
    Float32 m_FieldOfViewSP; //0x0014
    FOVTransitionData* m_FieldOfViewTransition; //0x0018
    Float32 m_LookSpeedMultiplier; //0x0020
    Float32 m_SprintLookSpeedMultiplier; //0x0024
    Float32 m_MoveSpeedMultiplier; //0x0028
    Float32 m_SwayPitchMagnitude; //0x002C
    Float32 m_SwayYawMagnitude; //0x0030
    Float32 m_SupportedSwayPitchMagnitude; //0x0034
    Float32 m_SupportedSwayYawMagnitude; //0x0038
    Float32 m_SuppressedSwayPitchMagnitude; //0x003C
    Float32 m_SuppressedSwayYawMagnitude; //0x0040
    Float32 m_SuppressedSwayMinFactor; //0x0044
    Float32 m_TimePitchMultiplier; //0x0048
    Float32 m_TimeYawMultiplier; //0x004C
    Float32 m_DispersionMultiplier; //0x0050
    Float32 m_DispersionRotation; //0x0054
    Float32 m_RecoilMultiplier; //0x0058
    Float32 m_RecoilFovMultiplier; //0x005C
    Float32 m_CameraImpulseMultiplier; //0x0060
    Float32 m_StartFadeToBlackAtTime; //0x0064
    Float32 m_FadeToBlackDuration; //0x0068
    Float32 m_StartFadeFromBlackAtTime; //0x006C
    Float32 m_FadeFromBlackDuration; //0x0070
    Float32 m_ScreenExposureAreaScale; //0x0074
    ZoomLevelActivateEventType m_OnActivateEventType; //0x0078
    Float32 m_AttractYawStrength; //0x007C
    Float32 m_AttractPitchStrength; //0x0080
    Boolean m_AllowFieldOfViewScaling; //0x0084
    Boolean m_FadeToBlackInZoomTransition; //0x0085
    Boolean m_UseFovSpecialisation; //0x0086
    Boolean m_UseWeaponMeshZoom1p; //0x0087
};//Size=0x0088
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02155
// RuntimeId: 09772
// TypeInfo:  0x0000000142887FB0
#ifndef _SoldierAimAssistData_
#define _SoldierAimAssistData_
#pragma pack(push, 16)
class SoldierAimAssistData : public GameDataContainer
{
public:
    static __inline SoldierAimAssistData* DefaultInstance()
    {
        return (SoldierAimAssistData*) 0x00000000688A0B90;
    }
    static __inline unsigned int ClassId()
    {
        return 2155;
    }
    Array<Float32> m_InputPolynomial; //0x0010
    Array<Float32> m_ZoomedInputPolynomial; //0x0018
    Vec3 m_StickyBoxScale; //0x0020
    Vec3 m_StickyDistanceScale; //0x0030
    Vec3 m_SnapBoxScale; //0x0040
    Vec3 m_SnapDistanceScale; //0x0050
    Vec3 m_EyePosOffset; //0x0060
    Float32 m_AccelerationInputThreshold; //0x0070
    Float32 m_AccelerationMultiplier; //0x0074
    Float32 m_AccelerationDamping; //0x0078
    Float32 m_AccelerationTimeThreshold; //0x007C
    Float32 m_SquaredAcceleration; //0x0080
    Vec2 m_MaxAcceleration; //0x0084
    Float32 m_YawSpeedStrength; //0x008C
    Float32 m_PitchSpeedStrength; //0x0090
    Vec2 m_AttractDistanceFallOffs; //0x0094
    Float32 m_AttractSoftZone; //0x009C
    Float32 m_AttractUserInputMultiplier; //0x00A0
    Float32 m_AttractUserInputMultiplier_NoZoom; //0x00A4
    Float32 m_AttractOwnSpeedInfluence; //0x00A8
    Float32 m_AttractTargetSpeedInfluence; //0x00AC
    Float32 m_AttractOwnRequiredMovementForMaximumAttract; //0x00B0
    Float32 m_AttractStartInputThreshold; //0x00B4
    Float32 m_AttractMoveInputCap; //0x00B8
    Float32 m_AttractYawStrength; //0x00BC
    Float32 m_AttractPitchStrength; //0x00C0
    Float32 m_MaxToTargetAngle; //0x00C4
    Float32 m_MaxToTargetXZAngle; //0x00C8
    Float32 m_ViewObstructedKeepTime; //0x00CC
    Float32 m_SnapZoomLateralSpeedLimit; //0x00D0
    Float32 m_SnapZoomTime; //0x00D4
    Float32 m_SnapZoomPostTimeNoInput; //0x00D8
    Float32 m_SnapZoomPostTime; //0x00DC
    Uint32 m_SnapZoomReticlePointPriority; //0x00E0
    Float32 m_SnapZoomAutoEngageTime; //0x00E4
    Float32 m_SnapZoomBreakTimeAtMaxInput; //0x00E8
    Float32 m_SnapZoomBreakMaxInput; //0x00EC
    Float32 m_SnapZoomBreakMinAngle; //0x00F0
    Float32 m_SnapZoomSpamGuardTime; //0x00F4
    SkeletonCollisionData* m_SoldierBackupSkeletonCollisionData; //0x00F8
    Float32 m_CheckBoneCenterOnlyDistance; //0x0100
    Float32 m_DisableForcedTargetRecalcDistance; //0x0104
    Float32 m_OverrideAimingRange; //0x0108
    Float32 m_OverrideAimingRangeCrouch; //0x010C
    Float32 m_OverrideAimingRangeProne; //0x0110
    Boolean m_UseYawAcceleration; //0x0114
    Boolean m_UsePitchAcceleration; //0x0115
    Boolean m_SnapZoomUserShorterWeaponTime; //0x0116
    Boolean m_SnapZoomPostTimeDynamicPoint; //0x0117
    Boolean m_ForceSoldierBackupSkeletonCollisionUse; //0x0118
    char _0x0119[7];
};//Size=0x0120
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03441
// RuntimeId: 09770
// TypeInfo:  0x0000000142888010
#ifndef _ThrowAtTargetWeaponData_
#define _ThrowAtTargetWeaponData_
#pragma pack(push, 8)
class ThrowAtTargetWeaponData : public WeaponData
{
public:
    static __inline ThrowAtTargetWeaponData* DefaultInstance()
    {
        return (ThrowAtTargetWeaponData*) 0x00000000688CF120;
    }
    static __inline unsigned int ClassId()
    {
        return 3441;
    }
    Float32 m_DefaultPowerModifier; //0x0020
    Float32 m_ThrowToSoldierDistance; //0x0024
    Float32 m_MaxTravelTime; //0x0028
    Float32 m_MinTravelTime; //0x002C
    Float32 m_MaxQueryAngle; //0x0030
    Float32 m_MaxAimAdjustmentAngle; //0x0034
    Float32 m_WeightCurrentDistance; //0x0038
    Float32 m_WeightTargetDistance; //0x003C
    Float32 m_WeightCurrentAngle; //0x0040
    Float32 m_WeightTargetAngle; //0x0044
    Boolean m_ClampMaximumVelocity; //0x0048
    char _0x0049[7];
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03443
// RuntimeId: 09768
// TypeInfo:  0x0000000142888070
#ifndef _MeleeWeaponData_
#define _MeleeWeaponData_
#pragma pack(push, 8)
class MeleeWeaponData : public WeaponData
{
public:
    static __inline MeleeWeaponData* DefaultInstance()
    {
        return (MeleeWeaponData*) 0x00000000688CF1E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3443;
    }
    Boolean m_UseCannedAnimation; //0x0020
    Boolean m_UseSphereDamage; //0x0021
    char _0x0022[6];
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03447
// RuntimeId: 09766
// TypeInfo:  0x00000001428880D0
#ifndef _FlashlightWeaponData_
#define _FlashlightWeaponData_
#pragma pack(push, 8)
class FlashlightWeaponData : public WeaponData
{
public:
    static __inline FlashlightWeaponData* DefaultInstance()
    {
        return (FlashlightWeaponData*) 0x00000000688CF300;
    }
    static __inline unsigned int ClassId()
    {
        return 3447;
    }
    Float32 m_UpdateFrequency; //0x0020
    Float32 m_Range; //0x0024
    Float32 m_Angle; //0x0028
    char _0x002C[4];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03439
// RuntimeId: 09762
// TypeInfo:  0x0000000142888130
#ifndef _DefibrillatorWeaponData_
#define _DefibrillatorWeaponData_
#pragma pack(push, 8)
class DefibrillatorWeaponData : public WeaponData
{
public:
    static __inline DefibrillatorWeaponData* DefaultInstance()
    {
        return (DefibrillatorWeaponData*) 0x00000000688CF000;
    }
    static __inline unsigned int ClassId()
    {
        return 3439;
    }
    Float32 m_AttackTime; //0x0020
    Float32 m_FullHealthTime; //0x0024
    Float32 m_InitialStartHealth; //0x0028
    Float32 m_MaxAngleToVictimXZ; //0x002C
    Float32 m_DefibActionCooldownTime; //0x0030
    Float32 m_MaxClientBodyDistance; //0x0034
    DefibrillatorUpgradeWeaponData m_UpgradeWeaponData; //0x0038
    Boolean m_ClientSideRevive; //0x0050
    Boolean m_ClientSideKillInVehicles; //0x0051
    char _0x0052[6];
};//Size=0x0058
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03453
// RuntimeId: 09756
// TypeInfo:  0x00000001428881F0
#ifndef _PowerToolWeaponData_
#define _PowerToolWeaponData_
#pragma pack(push, 8)
class PowerToolWeaponData : public WeaponData
{
public:
    static __inline PowerToolWeaponData* DefaultInstance()
    {
        return (PowerToolWeaponData*) 0x00000000688CF4D0;
    }
    static __inline unsigned int ClassId()
    {
        return 3453;
    }
    SoundAsset* m_RepairSound; //0x0020
    SoundAsset* m_RepairCompletedSound; //0x0028
    SoundAsset* m_DamageSound; //0x0030
    MaterialDecl m_RepairMaterialPair; //0x0038
    Boolean m_PlayFireEffectOnRepairOnly; //0x003C
    char _0x003D[3];
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03454
// RuntimeId: 09758
// TypeInfo:  0x0000000142888190
#ifndef _RepairToolWeaponData_
#define _RepairToolWeaponData_
#pragma pack(push, 8)
class RepairToolWeaponData : public PowerToolWeaponData
{
public:
    static __inline RepairToolWeaponData* DefaultInstance()
    {
        return (RepairToolWeaponData*) 0x00000000688CF530;
    }
    static __inline unsigned int ClassId()
    {
        return 3454;
    }
    Float32 m_RechargeSpeed; //0x0040
    char _0x0044[4];
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03442
// RuntimeId: 09754
// TypeInfo:  0x0000000142888250
#ifndef _MedicBagHealingSphereWeaponData_
#define _MedicBagHealingSphereWeaponData_
#pragma pack(push, 8)
class MedicBagHealingSphereWeaponData : public WeaponData
{
public:
    static __inline MedicBagHealingSphereWeaponData* DefaultInstance()
    {
        return (MedicBagHealingSphereWeaponData*) 0x00000000688CF190;
    }
    static __inline unsigned int ClassId()
    {
        return 3442;
    }
    HealingSphereData m_Healer; //0x0020
    Float32 m_HealthPointsRefillSpeed; //0x0028
    Float32 m_HealthPointsPerBag; //0x002C
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03444
// RuntimeId: 09752
// TypeInfo:  0x00000001428882B0
#ifndef _MedkitWeaponData_
#define _MedkitWeaponData_
#pragma pack(push, 8)
class MedkitWeaponData : public WeaponData
{
public:
    static __inline MedkitWeaponData* DefaultInstance()
    {
        return (MedkitWeaponData*) 0x00000000688CF220;
    }
    static __inline unsigned int ClassId()
    {
        return 3444;
    }
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03431
// RuntimeId: 09750
// TypeInfo:  0x0000000142888310
#ifndef _DetonatedWeaponData_
#define _DetonatedWeaponData_
#pragma pack(push, 8)
class DetonatedWeaponData : public WeaponData
{
public:
    static __inline DetonatedWeaponData* DefaultInstance()
    {
        return (DetonatedWeaponData*) 0x00000000688CEC20;
    }
    static __inline unsigned int ClassId()
    {
        return 3431;
    }
    LockingControllerData* m_LockingController; //0x0020
    Float32 m_Range; //0x0028
    char _0x002C[4];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02433
// RuntimeId: 07720
// TypeInfo:  0x000000014285DEE0
#ifndef _MeshProjectileEntityData_
#define _MeshProjectileEntityData_
#pragma pack(push, 16)
class MeshProjectileEntityData : public ProjectileEntityData
{
public:
    static __inline MeshProjectileEntityData* DefaultInstance()
    {
        return (MeshProjectileEntityData*) 0x00000000688A86F0;
    }
    static __inline unsigned int ClassId()
    {
        return 2433;
    }
    Vec3 m_InitialAngularVelocity; //0x00E0
    MeshAsset* m_Mesh; //0x00F0
    EffectBlueprint* m_TrailEffect; //0x00F8
    Float32 m_InstantAttachableTestDistance; //0x0100
    Float32 m_InstantAttachableVisualConvergenceDelay; //0x0104
    Float32 m_InstantAttachableVisualConvergenceDuration; //0x0108
    Float32 m_MaxAttachableInclination; //0x010C
    Float32 m_UnspawnAfterDetonationDelay; //0x0110
    Boolean m_IsAttachable; //0x0114
    Boolean m_InstantAttachableTestUnderReticule; //0x0115
    Boolean m_ExtraDamping; //0x0116
    char _0x0117[9];
};//Size=0x0120
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02974
// RuntimeId: 08130
// TypeInfo:  0x0000000142863B10
#ifndef _HealthComponentData_
#define _HealthComponentData_
#pragma pack(push, 16)
class HealthComponentData : public ComponentData
{
public:
    static __inline HealthComponentData* DefaultInstance()
    {
        return (HealthComponentData*) 0x00000000688BDAA0;
    }
    static __inline unsigned int ClassId()
    {
        return 2974;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02954
// RuntimeId: 08128
// TypeInfo:  0x0000000142863B70
#ifndef _PhysicsComponentData_
#define _PhysicsComponentData_
#pragma pack(push, 16)
class PhysicsComponentData : public ComponentData
{
public:
    static __inline PhysicsComponentData* DefaultInstance()
    {
        return (PhysicsComponentData*) 0x00000000688BCE10;
    }
    static __inline unsigned int ClassId()
    {
        return 2954;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02435
// RuntimeId: 07722
// TypeInfo:  0x000000014285DE80
#ifndef _GhostedProjectileEntityData_
#define _GhostedProjectileEntityData_
#pragma pack(push, 16)
class GhostedProjectileEntityData : public MeshProjectileEntityData
{
public:
    static __inline GhostedProjectileEntityData* DefaultInstance()
    {
        return (GhostedProjectileEntityData*) 0x00000000688A89C0;
    }
    static __inline unsigned int ClassId()
    {
        return 2435;
    }
    Float32 m_ProxyConvergenceDelay; //0x0120
    Float32 m_ProxyConvergenceDuration; //0x0124
    Boolean m_ProxyConvergenceInstantOnAttach; //0x0128
    Boolean m_ForceProxyConvergence; //0x0129
    char _0x012A[6];
};//Size=0x0130
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03727
// RuntimeId: 09740
// TypeInfo:  0x00000001428884F0
#ifndef _ExplosionPackRemoteDetonatorTrigger_
#define _ExplosionPackRemoteDetonatorTrigger_
#pragma pack(push, 8)
class ExplosionPackRemoteDetonatorTrigger : public ExplosionPackTrigger
{
public:
    static __inline ExplosionPackRemoteDetonatorTrigger* DefaultInstance()
    {
        return (ExplosionPackRemoteDetonatorTrigger*) 0x00000000688D5140;
    }
    static __inline unsigned int ClassId()
    {
        return 3727;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03726
// RuntimeId: 09738
// TypeInfo:  0x0000000142888550
#ifndef _ExplosionPackInfantryTrigger_
#define _ExplosionPackInfantryTrigger_
#pragma pack(push, 8)
class ExplosionPackInfantryTrigger : public ExplosionPackTrigger
{
public:
    static __inline ExplosionPackInfantryTrigger* DefaultInstance()
    {
        return (ExplosionPackInfantryTrigger*) 0x00000000688D5110;
    }
    static __inline unsigned int ClassId()
    {
        return 3726;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03730
// RuntimeId: 09736
// TypeInfo:  0x00000001428885B0
#ifndef _ExplosionPackVehicleRayTrigger_
#define _ExplosionPackVehicleRayTrigger_
#pragma pack(push, 8)
class ExplosionPackVehicleRayTrigger : public ExplosionPackTrigger
{
public:
    static __inline ExplosionPackVehicleRayTrigger* DefaultInstance()
    {
        return (ExplosionPackVehicleRayTrigger*) 0x00000000688D51E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3730;
    }
    Float32 m_ActivationDelay; //0x0010
    Float32 m_Distance; //0x0014
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03729
// RuntimeId: 09734
// TypeInfo:  0x0000000142888610
#ifndef _ExplosionPackVehicleProximityTrigger_
#define _ExplosionPackVehicleProximityTrigger_
#pragma pack(push, 8)
class ExplosionPackVehicleProximityTrigger : public ExplosionPackTrigger
{
public:
    static __inline ExplosionPackVehicleProximityTrigger* DefaultInstance()
    {
        return (ExplosionPackVehicleProximityTrigger*) 0x00000000688D51A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3729;
    }
    Float32 m_ActivationDelay; //0x0010
    Float32 m_Radius; //0x0014
    Boolean m_UseDetailedCollisionCheck; //0x0018
    char _0x0019[7];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03728
// RuntimeId: 09838
// TypeInfo:  0x00000001428875F0
#ifndef _ExplosionPackTripwireTrigger_
#define _ExplosionPackTripwireTrigger_
#pragma pack(push, 8)
class ExplosionPackTripwireTrigger : public ExplosionPackTrigger
{
public:
    static __inline ExplosionPackTripwireTrigger* DefaultInstance()
    {
        return (ExplosionPackTripwireTrigger*) 0x00000000688D5170;
    }
    static __inline unsigned int ClassId()
    {
        return 3728;
    }
    TripwireEntityData* m_Tripwire; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02975
// RuntimeId: 07159
// TypeInfo:  0x0000000142850300
#ifndef _GameHealthComponentData_
#define _GameHealthComponentData_
#pragma pack(push, 16)
class GameHealthComponentData : public HealthComponentData
{
public:
    static __inline GameHealthComponentData* DefaultInstance()
    {
        return (GameHealthComponentData*) 0x00000000688BDB30;
    }
    static __inline unsigned int ClassId()
    {
        return 2975;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02955
// RuntimeId: 07153
// TypeInfo:  0x0000000142850420
#ifndef _GamePhysicsComponentData_
#define _GamePhysicsComponentData_
#pragma pack(push, 16)
class GamePhysicsComponentData : public PhysicsComponentData
{
public:
    static __inline GamePhysicsComponentData* DefaultInstance()
    {
        return (GamePhysicsComponentData*) 0x00000000688BCEA0;
    }
    static __inline unsigned int ClassId()
    {
        return 2955;
    }
    Realm m_Realm; //0x0070
    char _0x0074[4];
    Array<EffectParameter*> m_EffectParameters; //0x0078
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02426
// RuntimeId: 09701
// TypeInfo:  0x00000001428888B0
#ifndef _WeaponEntityData_
#define _WeaponEntityData_
#pragma pack(push, 16)
class WeaponEntityData : public GameComponentEntityData
{
public:
    static __inline WeaponEntityData* DefaultInstance()
    {
        return (WeaponEntityData*) 0x00000000688A7F10;
    }
    static __inline unsigned int ClassId()
    {
        return 2426;
    }
    WeaponClassEnum m_WeaponClass; //0x0080
    char _0x0084[4];
    Array<WeaponStateData> m_WeaponStates; //0x0088
    WeaponFiringData* m_WeaponFiring; //0x0090
    WeaponData* m_CustomWeaponType; //0x0098
    GameAIWeaponData* m_AIData; //0x00A0
    char _0x00A8[8];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03386
// RuntimeId: 09715
// TypeInfo:  0x00000001428887F0
#ifndef _WeaponZoomLevelData_
#define _WeaponZoomLevelData_
#pragma pack(push, 8)
class WeaponZoomLevelData : public DataContainer
{
public:
    static __inline WeaponZoomLevelData* DefaultInstance()
    {
        return (WeaponZoomLevelData*) 0x00000000688CDA70;
    }
    static __inline unsigned int ClassId()
    {
        return 3386;
    }
    Float32 m_RenderFov; //0x0010
    char _0x0014[4];
    FOVTransitionData* m_RenderFovTransition; //0x0018
    Array<Float32> m_ZoomInOutMeshTransitionFactors; //0x0020
    Float32 m_ZoomDisabledTransitionTimer; //0x0028
    SightType m_SightType; //0x002C
    WeaponAnimationSettingsData m_AnimationSettings; //0x0030
    char _0x004C[4];
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03702
// RuntimeId: 09709
// TypeInfo:  0x0000000142888850
#ifndef _WeaponOverrideData_
#define _WeaponOverrideData_
#pragma pack(push, 8)
class WeaponOverrideData : public DataContainer
{
public:
    static __inline WeaponOverrideData* DefaultInstance()
    {
        return (WeaponOverrideData*) 0x00000000688D4A60;
    }
    static __inline unsigned int ClassId()
    {
        return 3702;
    }
    DataContainer* m_Data; //0x0010
    Array<WeaponOverrideValue> m_Values; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02427
// RuntimeId: 09719
// TypeInfo:  0x0000000142888790
#ifndef _SoldierWeaponData_
#define _SoldierWeaponData_
#pragma pack(push, 16)
class SoldierWeaponData : public WeaponEntityData
{
public:
    static __inline SoldierWeaponData* DefaultInstance()
    {
        return (SoldierWeaponData*) 0x00000000688A7FE0;
    }
    static __inline unsigned int ClassId()
    {
        return 2427;
    }
    PickupSettingsData m_PickupSettings; //0x00B0
    Vec3 m_InteractionOffset; //0x00D0
    CustomizationAccessoryPivots m_CustomizationAccessoryPivots; //0x00E0
    CString m_DamageGiverName; //0x0130
    Array<WeaponZoomLevelData*> m_ZoomLevels; //0x0138
    Array<WeaponModifierData> m_WeaponModifierData; //0x0140
    SoldierAimingSimulationData* m_AimingController; //0x0148
    FirstPersonCameraData* m_FirstPersonCamera; //0x0150
    HudData m_Hud; //0x0158
    WeaponAnimBaseSetEnum m_AnimBaseSet; //0x01C8
    QuickThrowTypeEnum m_QuickThrowType; //0x01CC
    SoldierWeaponBlueprint* m_SoldierWeaponBlueprint; //0x01D0
    CString m_PersistenceId; //0x01D8
    Int32 m_SecondaryActionInputAction; //0x01E0
    char _0x01E4[4];
    EntityVoiceOverInfo* m_VoiceOverInfo; //0x01E8
    Float32 m_WeaponFloatParam; //0x01F0
    Float32 m_MaxRangeMeterDistance; //0x01F4
    Array<SocketData*> m_SocketsInWeapon; //0x01F8
    Boolean m_HideWhenOutOfAmmo; //0x0200
    Boolean m_AllowSwitchingToWeaponOutOfAmmo; //0x0201
    Boolean m_AllowSwitchingToWeaponReloading; //0x0202
    Boolean m_SwitchToPrimaryWhenOutOfAmmo; //0x0203
    Boolean m_WaitForFireBeforeSwitchToPrimaryWhenOutOfAmmo; //0x0204
    Boolean m_SwitchToSecondaryWhenPrimaryOutOfAmmo; //0x0205
    Boolean m_FireAndSwitchBackToPrevSupported; //0x0206
    Boolean m_AllowSwitchingToWeaponInVehicles; //0x0207
    Boolean m_AllowSwitchingToWeaponInWater; //0x0208
    Boolean m_LowerOnOwnTeam; //0x0209
    Boolean m_RedeployWhenSwitchingWeaponStates; //0x020A
    Boolean m_UseQuickThrowOnAutomaticSwitchback; //0x020B
    Boolean m_EnableBreathControl; //0x020C
    Boolean m_CanBeInSupportedShooting; //0x020D
    Boolean m_UseDetailedRangeMeterQuery; //0x020E
    Boolean m_IsSilenced; //0x020F
    Boolean m_SkipFirstZoomLevel; //0x0210
    char _0x0211[15];
};//Size=0x0220
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03018
// RuntimeId: 09699
// TypeInfo:  0x0000000142888910
#ifndef _SoldierWeaponsComponentData_
#define _SoldierWeaponsComponentData_
#pragma pack(push, 16)
class SoldierWeaponsComponentData : public GameComponentData
{
public:
    static __inline SoldierWeaponsComponentData* DefaultInstance()
    {
        return (SoldierWeaponsComponentData*) 0x00000000688BFD40;
    }
    static __inline unsigned int ClassId()
    {
        return 3018;
    }
    LinearTransform m_AimDir; //0x0070
    Int32 m_PrimaryWeaponId; //0x00B0
    Int32 m_SecondaryWeaponId; //0x00B4
    SoldierAimingSimulationData* m_DefaultAimingController; //0x00B8
    AnimatedWeaponBinding m_AnimatedWeaponBinding; //0x00C0
    Animated1pOnlyWeaponBinding m_Animated1pOnlyWeaponBinding; //0x0660
    Animated3pOnlyWeaponBinding m_Animated3pOnlyWeaponBinding; //0x06B0
    char _0x06EC[4];
    SkeletonAsset* m_WeaponSkeleton; //0x06F0
    Float32 m_AmmoClipIncreaseMultiplier; //0x06F8
    Int32 m_GrenadeIncrease; //0x06FC
    Int32 m_UnderslungGrenadeIncrease; //0x0700
    Float32 m_ExplosiveIncreaseMultiplier; //0x0704
    PickupEntityAsset* m_DropWeaponPickup; //0x0708
    Boolean m_UseExternalAimDir; //0x0710
    Boolean m_UnlimitedAmmo; //0x0711
    Boolean m_UnlimitedMags; //0x0712
    Boolean m_ForceZoom; //0x0713
    Boolean m_IsOwnedByAI; //0x0714
    char _0x0715[11];
};//Size=0x0720
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02059
// RuntimeId: 09681
// TypeInfo:  0x0000000142888970
#ifndef _FirstPersonCameraData_
#define _FirstPersonCameraData_
#pragma pack(push, 16)
class FirstPersonCameraData : public DataContainer
{
public:
    static __inline FirstPersonCameraData* DefaultInstance()
    {
        return (FirstPersonCameraData*) 0x000000006889EBE0;
    }
    static __inline unsigned int ClassId()
    {
        return 2059;
    }
    WeaponLagSpringEffectData* m_WeaponSpringEffect; //0x0010
    WeaponLagSpringEffectData* m_CameraSpringEffect; //0x0018
    Vec3 m_Offset; //0x0020
    Vec3 m_WeaponBaseOffset; //0x0030
    Vec3 m_WeaponLagRotationOffset; //0x0040
    Vec3 m_Rotation; //0x0050
    Float32 m_MoveStrafeModifier; //0x0060
    Float32 m_MoveForwardModifier; //0x0064
    Float32 m_RotateYawModifier; //0x0068
    Float32 m_RotatePitchModifier; //0x006C
    Float32 m_RotateRollModifier; //0x0070
    Float32 m_ZoomMoveStrafeModifier; //0x0074
    Float32 m_ZoomMoveForwardModifier; //0x0078
    Float32 m_ZoomRotateYawModifier; //0x007C
    Float32 m_ZoomRotatePitchModifier; //0x0080
    Float32 m_ZoomRotateRollModifier; //0x0084
    Float32 m_ReleaseModifier; //0x0088
    Float32 m_ReleaseModifierPitch; //0x008C
    Float32 m_ReleaseModifierYaw; //0x0090
    Float32 m_ReleaseModifierRoll; //0x0094
    Float32 m_OffsetReleaseModifier; //0x0098
    Float32 m_ZoomReleaseModifierPitch; //0x009C
    Float32 m_ZoomReleaseModifierYaw; //0x00A0
    Float32 m_ZoomReleaseModifierRoll; //0x00A4
    Float32 m_ZoomOffsetReleaseModifier; //0x00A8
    Float32 m_RotationAdditionToOffset; //0x00AC
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03669
// RuntimeId: 09679
// TypeInfo:  0x00000001428889D0
#ifndef _WeaponLagSpringEffectData_
#define _WeaponLagSpringEffectData_
#pragma pack(push, 16)
class WeaponLagSpringEffectData : public DataContainer
{
public:
    static __inline WeaponLagSpringEffectData* DefaultInstance()
    {
        return (WeaponLagSpringEffectData*) 0x00000000688D40D0;
    }
    static __inline unsigned int ClassId()
    {
        return 3669;
    }
    WeaponLagEffectSpringVector m_OffsetSprings; //0x0010
    char _0x0028[8];
    WeaponLagEffectForceData m_JumpForces; //0x0030
    WeaponLagEffectForceData m_LandForces; //0x0050
    WeaponLagEffectForceData m_PoseUpForces; //0x0070
    WeaponLagEffectForceData m_PoseDownForces; //0x0090
    WeaponLagEffectSpringVector m_RotationSprings; //0x00B0
    Float32 m_ZoomForceModifier; //0x00C8
    char _0x00CC[4];
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03529
// RuntimeId: 09671
// TypeInfo:  0x0000000142888A30
#ifndef _WeaponSpeedData_
#define _WeaponSpeedData_
#pragma pack(push, 8)
class WeaponSpeedData : public DataContainer
{
public:
    static __inline WeaponSpeedData* DefaultInstance()
    {
        return (WeaponSpeedData*) 0x00000000688D0DE0;
    }
    static __inline unsigned int ClassId()
    {
        return 3529;
    }
    Float32 m_ZoomOutSpeed; //0x0010
    Float32 m_ZoomInSpeed; //0x0014
    Float32 m_UnDeploySpeed; //0x0018
    Float32 m_DeploySpeed; //0x001C
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03938
// RuntimeId: 09669
// TypeInfo:  0x0000000142888A90
#ifndef _WeaponOffsetData_
#define _WeaponOffsetData_
#pragma pack(push, 8)
class WeaponOffsetData : public DataContainer
{
public:
    static __inline WeaponOffsetData* DefaultInstance()
    {
        return (WeaponOffsetData*) 0x00000000688DA4B0;
    }
    static __inline unsigned int ClassId()
    {
        return 3938;
    }
    Float32 m_WeaponOffsetX; //0x0010
    Float32 m_WeaponOffsetY; //0x0014
    Float32 m_WeaponOffsetZ; //0x0018
    Float32 m_WeaponZoomedOffsetX; //0x001C
    Float32 m_WeaponZoomedOffsetY; //0x0020
    Float32 m_WeaponZoomedOffsetZ; //0x0024
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01782
// RuntimeId: 09663
// TypeInfo:  0x0000000142888AF0
#ifndef _AimerModifierData_
#define _AimerModifierData_
#pragma pack(push, 8)
class AimerModifierData : public Asset
{
public:
    static __inline AimerModifierData* DefaultInstance()
    {
        return (AimerModifierData*) 0x0000000068898660;
    }
    static __inline unsigned int ClassId()
    {
        return 1782;
    }
    Float32 m_LookSpeedMultiplier; //0x0018
    Boolean m_OnlyInSupportedShooting; //0x001C
    char _0x001D[3];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01809
// RuntimeId: 09661
// TypeInfo:  0x0000000142888B50
#ifndef _SoldierWeaponCustomizationAsset_
#define _SoldierWeaponCustomizationAsset_
#pragma pack(push, 8)
class SoldierWeaponCustomizationAsset : public DataContainerPolicyAsset
{
public:
    static __inline SoldierWeaponCustomizationAsset* DefaultInstance()
    {
        return (SoldierWeaponCustomizationAsset*) 0x00000000688991C0;
    }
    static __inline unsigned int ClassId()
    {
        return 1809;
    }
    CustomizationTable* m_Customization; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01788
// RuntimeId: 07546
// TypeInfo:  0x0000000142858C10
#ifndef _UnlockAssetBase_
#define _UnlockAssetBase_
#pragma pack(push, 8)
class UnlockAssetBase : public DataContainerPolicyAsset
{
public:
    static __inline UnlockAssetBase* DefaultInstance()
    {
        return (UnlockAssetBase*) 0x0000000068898830;
    }
    static __inline unsigned int ClassId()
    {
        return 1788;
    }
    UnlockUserDataBase* m_UnlockUserData; //0x0018
    CString m_DebugUnlockId; //0x0020
    Uint32 m_Identifier; //0x0028
    Uint32 m_UnlockScore; //0x002C
    UnlockAssetBase* m_NextLevelUnlockAsset; //0x0030
    CString m_PersistentStorageCode; //0x0038
    UnlockAvailability m_AvailableForPlayer; //0x0040
    Boolean m_AutoAvailable; //0x0044
    Boolean m_IgnoreAllUnlocked; //0x0045
    Boolean m_BypassLicenseCheckAllUnlocked; //0x0046
    Boolean m_HiddenInProgression; //0x0047
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01804
// RuntimeId: 07542
// TypeInfo:  0x0000000142858C70
#ifndef _UnlockUserDataBase_
#define _UnlockUserDataBase_
#pragma pack(push, 8)
class UnlockUserDataBase : public DataContainerPolicyAsset
{
public:
    static __inline UnlockUserDataBase* DefaultInstance()
    {
        return (UnlockUserDataBase*) 0x0000000068899060;
    }
    static __inline unsigned int ClassId()
    {
        return 1804;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02511
// RuntimeId: 07366
// TypeInfo:  0x000000014285A1D0
#ifndef _TriggerEntityData_
#define _TriggerEntityData_
#pragma pack(push, 16)
class TriggerEntityData : public SpatialEntityData
{
public:
    static __inline TriggerEntityData* DefaultInstance()
    {
        return (TriggerEntityData*) 0x00000000688AD2C0;
    }
    static __inline unsigned int ClassId()
    {
        return 2511;
    }
    Float32 m_Delay; //0x0060
    Boolean m_RunOnce; //0x0064
    Boolean m_Enabled; //0x0065
    char _0x0066[10];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02513
// RuntimeId: 07376
// TypeInfo:  0x000000014285A050
#ifndef _TriggerEventEntityData_
#define _TriggerEventEntityData_
#pragma pack(push, 16)
class TriggerEventEntityData : public TriggerEntityData
{
public:
    static __inline TriggerEventEntityData* DefaultInstance()
    {
        return (TriggerEventEntityData*) 0x00000000688AD400;
    }
    static __inline unsigned int ClassId()
    {
        return 2513;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02325
// RuntimeId: 06464
// TypeInfo:  0x0000000142845460
#ifndef _CustomizeBaseEntityData_
#define _CustomizeBaseEntityData_
#pragma pack(push, 8)
class CustomizeBaseEntityData : public EntityData
{
public:
    static __inline CustomizeBaseEntityData* DefaultInstance()
    {
        return (CustomizeBaseEntityData*) 0x00000000688A5090;
    }
    static __inline unsigned int ClassId()
    {
        return 2325;
    }
    Realm m_Realm; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01952
// RuntimeId: 09643
// TypeInfo:  0x0000000142888D30
#ifndef _SoldierSpawnAppearanceTemplateData_
#define _SoldierSpawnAppearanceTemplateData_
#pragma pack(push, 8)
class SoldierSpawnAppearanceTemplateData : public Asset
{
public:
    static __inline SoldierSpawnAppearanceTemplateData* DefaultInstance()
    {
        return (SoldierSpawnAppearanceTemplateData*) 0x000000006889C920;
    }
    static __inline unsigned int ClassId()
    {
        return 1952;
    }
    Uint32 m_Body; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01869
// RuntimeId: 09641
// TypeInfo:  0x0000000142888D90
#ifndef _SoldierSpawnKitTemplateData_
#define _SoldierSpawnKitTemplateData_
#pragma pack(push, 8)
class SoldierSpawnKitTemplateData : public Asset
{
public:
    static __inline SoldierSpawnKitTemplateData* DefaultInstance()
    {
        return (SoldierSpawnKitTemplateData*) 0x000000006889A900;
    }
    static __inline unsigned int ClassId()
    {
        return 1869;
    }
    Uint32 m_Kit; //0x0018
    Uint32 m_MainGun; //0x001C
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01549
// RuntimeId: 09639
// TypeInfo:  0x0000000142888DF0
#ifndef _SoldierWeaponSwitchingData_
#define _SoldierWeaponSwitchingData_
#pragma pack(push, 8)
class SoldierWeaponSwitchingData : public Asset
{
public:
    static __inline SoldierWeaponSwitchingData* DefaultInstance()
    {
        return (SoldierWeaponSwitchingData*) 0x00000000688939A0;
    }
    static __inline unsigned int ClassId()
    {
        return 1549;
    }
    Array<WeaponSwitchingMapData> m_SwitchMap; //0x0018
    Array<DirectWeaponSwitchingMapData> m_DirectSwitchMap; //0x0020
    Array<WeaponSwitchingEnum> m_AutoDropSlots; //0x0028
    Int32 m_ToggleAction; //0x0030
    Float32 m_ToggleMaxHoldTime; //0x0034
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02983
// RuntimeId: 07161
// TypeInfo:  0x00000001428502A0
#ifndef _ControllableHealthComponentData_
#define _ControllableHealthComponentData_
#pragma pack(push, 16)
class ControllableHealthComponentData : public GameHealthComponentData
{
public:
    static __inline ControllableHealthComponentData* DefaultInstance()
    {
        return (ControllableHealthComponentData*) 0x00000000688BDFB0;
    }
    static __inline unsigned int ClassId()
    {
        return 2983;
    }
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02964
// RuntimeId: 07155
// TypeInfo:  0x00000001428503C0
#ifndef _ControllablePhysicsComponentData_
#define _ControllablePhysicsComponentData_
#pragma pack(push, 16)
class ControllablePhysicsComponentData : public GamePhysicsComponentData
{
public:
    static __inline ControllablePhysicsComponentData* DefaultInstance()
    {
        return (ControllablePhysicsComponentData*) 0x00000000688BD450;
    }
    static __inline unsigned int ClassId()
    {
        return 2964;
    }
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01918
// RuntimeId: 07219
// TypeInfo:  0x000000014284FB20
#ifndef _CustomizeCharacterData_
#define _CustomizeCharacterData_
#pragma pack(push, 8)
class CustomizeCharacterData : public Asset
{
public:
    static __inline CustomizeCharacterData* DefaultInstance()
    {
        return (CustomizeCharacterData*) 0x000000006889BB20;
    }
    static __inline unsigned int ClassId()
    {
        return 1918;
    }
    Array<CustomizeVisual> m_VisualGroups; //0x0018
    Array<UnlockAssetBase*> m_Unlocks; //0x0020
    Float32 m_OverrideMaxHealth; //0x0028
    Float32 m_OverrideCriticalHealthThreshold; //0x002C
    Boolean m_RestoreToOriginalVisualState; //0x0030
    Boolean m_ClearVisualState; //0x0031
    char _0x0032[6];
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03807
// RuntimeId: 09619
// TypeInfo:  0x0000000142888F70
#ifndef _SoldierSettings_
#define _SoldierSettings_
#pragma pack(push, 8)
class SoldierSettings : public SystemSettings
{
public:
    static __inline SoldierSettings* DefaultInstance()
    {
        return (SoldierSettings*) 0x00000000688D7730;
    }
    static __inline unsigned int ClassId()
    {
        return 3807;
    }
    SoldierWeaponSwitchingData* m_SoldierWeaponSwitching; //0x0020
    Uint32 m_MaxNumberDroppedPickups; //0x0028
    Uint32 m_MaxVisiblePickupWeapons; //0x002C
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02453
// RuntimeId: 06719
// TypeInfo:  0x000000014284AD30
#ifndef _ControllableEntityData_
#define _ControllableEntityData_
#pragma pack(push, 16)
class ControllableEntityData : public GamePhysicsEntityData
{
public:
    static __inline ControllableEntityData* DefaultInstance()
    {
        return (ControllableEntityData*) 0x00000000688AA270;
    }
    static __inline unsigned int ClassId()
    {
        return 2453;
    }
    TeamId m_DefaultTeam; //0x0090
    Float32 m_LowHealthThreshold; //0x0094
    MaterialDecl m_MaterialPair; //0x0098
    Boolean m_UsePrediction; //0x009C
    Boolean m_ResetTeamOnLastPlayerExits; //0x009D
    Boolean m_Immortal; //0x009E
    Boolean m_FakeImmortal; //0x009F
    Boolean m_ForceForegroundRendering; //0x00A0
    char _0x00A1[15];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02045
// RuntimeId: 09608
// TypeInfo:  0x0000000142889030
#ifndef _SoldierHealthModuleData_
#define _SoldierHealthModuleData_
#pragma pack(push, 8)
class SoldierHealthModuleData : public DataContainer
{
public:
    static __inline SoldierHealthModuleData* DefaultInstance()
    {
        return (SoldierHealthModuleData*) 0x000000006889E650;
    }
    static __inline unsigned int ClassId()
    {
        return 2045;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03935
// RuntimeId: 09606
// TypeInfo:  0x0000000142889090
#ifndef _BreathControlData_
#define _BreathControlData_
#pragma pack(push, 8)
class BreathControlData : public DataContainer
{
public:
    static __inline BreathControlData* DefaultInstance()
    {
        return (BreathControlData*) 0x00000000688DA3A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3935;
    }
    Float32 m_BreathControlTime; //0x0010
    Float32 m_BreathControlReleaseTime; //0x0014
    Float32 m_BreathControlPenaltyMultiplier; //0x0018
    Float32 m_BreathControlPenaltyTimeout; //0x001C
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03545
// RuntimeId: 09604
// TypeInfo:  0x00000001428890F0
#ifndef _CollisionData_
#define _CollisionData_
#pragma pack(push, 8)
class CollisionData : public DataContainer
{
public:
    static __inline CollisionData* DefaultInstance()
    {
        return (CollisionData*) 0x00000000688D16F0;
    }
    static __inline unsigned int ClassId()
    {
        return 3545;
    }
    Array<ValueAtX> m_DamageAtVerticalVelocity; //0x0010
    Array<ValueAtX> m_DamageAtHorizVelocity; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03505
// RuntimeId: 09600
// TypeInfo:  0x0000000142889150
#ifndef _SoldierWeaponOverrideData_
#define _SoldierWeaponOverrideData_
#pragma pack(push, 8)
class SoldierWeaponOverrideData : public DataContainer
{
public:
    static __inline SoldierWeaponOverrideData* DefaultInstance()
    {
        return (SoldierWeaponOverrideData*) 0x00000000688D0540;
    }
    static __inline unsigned int ClassId()
    {
        return 3505;
    }
    Array<WeaponOverrideData*> m_Overrides; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03943
// RuntimeId: 09598
// TypeInfo:  0x00000001428891B0
#ifndef _SoldierSprintSettingsData_
#define _SoldierSprintSettingsData_
#pragma pack(push, 8)
class SoldierSprintSettingsData : public DataContainer
{
public:
    static __inline SoldierSprintSettingsData* DefaultInstance()
    {
        return (SoldierSprintSettingsData*) 0x00000000688DA5F0;
    }
    static __inline unsigned int ClassId()
    {
        return 3943;
    }
    Float32 m_Fov; //0x0010
    Float32 m_FovInDelay; //0x0014
    Float32 m_FovInTime; //0x0018
    Float32 m_FovOutDelay; //0x001C
    Float32 m_FovOutTime; //0x0020
    Float32 m_RecoverTime; //0x0024
    Float32 m_SprintToProneRecoverTime; //0x0028
    char _0x002C[4];
    Array<Int32> m_InterruptingActions; //0x0030
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03262
// RuntimeId: 09592
// TypeInfo:  0x0000000142889210
#ifndef _SoldierHeadCollisionData_
#define _SoldierHeadCollisionData_
#pragma pack(push, 8)
class SoldierHeadCollisionData : public DataContainer
{
public:
    static __inline SoldierHeadCollisionData* DefaultInstance()
    {
        return (SoldierHeadCollisionData*) 0x00000000688CAE60;
    }
    static __inline unsigned int ClassId()
    {
        return 3262;
    }
    Float32 m_HeadRadius; //0x0010
    char _0x0014[4];
    Array<SoldierHeadCollisionPoseData> m_PoseStates; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03281
// RuntimeId: 09588
// TypeInfo:  0x0000000142889270
#ifndef _SoldierAutoAimData_
#define _SoldierAutoAimData_
#pragma pack(push, 8)
class SoldierAutoAimData : public DataContainer
{
public:
    static __inline SoldierAutoAimData* DefaultInstance()
    {
        return (SoldierAutoAimData*) 0x00000000688CB710;
    }
    static __inline unsigned int ClassId()
    {
        return 3281;
    }
    Array<AutoAimData> m_Poses; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03828
// RuntimeId: 07037
// TypeInfo:  0x0000000142851020
#ifndef _CharacterSoundData_
#define _CharacterSoundData_
#pragma pack(push, 8)
class CharacterSoundData : public DataContainer
{
public:
    static __inline CharacterSoundData* DefaultInstance()
    {
        return (CharacterSoundData*) 0x00000000688D7F70;
    }
    static __inline unsigned int ClassId()
    {
        return 3828;
    }
    SoundAsset* m_Movement; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03279
// RuntimeId: 09580
// TypeInfo:  0x0000000142889330
#ifndef _SoldierAimingConstraintsData_
#define _SoldierAimingConstraintsData_
#pragma pack(push, 8)
class SoldierAimingConstraintsData : public DataContainer
{
public:
    static __inline SoldierAimingConstraintsData* DefaultInstance()
    {
        return (SoldierAimingConstraintsData*) 0x00000000688CB690;
    }
    static __inline unsigned int ClassId()
    {
        return 3279;
    }
    AimingConstraintsData m_SwimmingConstraints; //0x0010
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02958
// RuntimeId: 09578
// TypeInfo:  0x0000000142889390
#ifndef _PickupPhysicsComponentData_
#define _PickupPhysicsComponentData_
#pragma pack(push, 16)
class PickupPhysicsComponentData : public GamePhysicsComponentData
{
public:
    static __inline PickupPhysicsComponentData* DefaultInstance()
    {
        return (PickupPhysicsComponentData*) 0x00000000688BD080;
    }
    static __inline unsigned int ClassId()
    {
        return 2958;
    }
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02448
// RuntimeId: 09563
// TypeInfo:  0x0000000142889570
#ifndef _PickupEntityData_
#define _PickupEntityData_
#pragma pack(push, 16)
class PickupEntityData : public GamePhysicsEntityData
{
public:
    static __inline PickupEntityData* DefaultInstance()
    {
        return (PickupEntityData*) 0x00000000688A9D20;
    }
    static __inline unsigned int ClassId()
    {
        return 2448;
    }
    ObjectBlueprint* m_PhysicsBlueprint; //0x0090
    MeshAsset* m_Mesh; //0x0098
    Float32 m_TimeToShowWeaponMesh; //0x00A0
    Uint32 m_PreferredWeaponSlot; //0x00A4
    Float32 m_TimeToLive; //0x00A8
    char _0x00AC[4];
    CString m_IconName; //0x00B0
    Int32 m_MinRandomSpareAmmoPercent; //0x00B8
    Int32 m_MaxRandomSpareAmmoPercent; //0x00BC
    Int32 m_MinRandomClipAmmoPercent; //0x00C0
    Int32 m_MaxRandomClipAmmoPercent; //0x00C4
    PickupPlayerEnum m_RandomizeAmmoOnDropForPlayer; //0x00C8
    Float32 m_InteractionRadius; //0x00CC
    Float32 m_DisplayWithinRadius; //0x00D0
    Float32 m_TacticalRadius; //0x00D4
    Boolean m_UseWeaponMesh; //0x00D8
    Boolean m_UnspawnOnPickup; //0x00D9
    Boolean m_UnspawnOnAmmoPickup; //0x00DA
    Boolean m_ContentIsStatic; //0x00DB
    Boolean m_PositionIsStatic; //0x00DC
    Boolean m_AllowPickup; //0x00DD
    Boolean m_IgnoreNullWeaponSlots; //0x00DE
    Boolean m_ForceWeaponSlotSelection; //0x00DF
    Boolean m_DisplayInMiniMap; //0x00E0
    Boolean m_HasAutomaticAmmoPickup; //0x00E1
    Boolean m_ReplaceAllContent; //0x00E2
    Boolean m_RemoveWeaponOnDrop; //0x00E3
    Boolean m_UseDisplayWithinRadius; //0x00E4
    Boolean m_KeepAmmoState; //0x00E5
    char _0x00E6[10];
};//Size=0x00F0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01820
// RuntimeId: 09571
// TypeInfo:  0x0000000142889450
#ifndef _PickupEntityAsset_
#define _PickupEntityAsset_
#pragma pack(push, 8)
class PickupEntityAsset : public DataContainerPolicyAsset
{
public:
    static __inline PickupEntityAsset* DefaultInstance()
    {
        return (PickupEntityAsset*) 0x00000000688996B0;
    }
    static __inline unsigned int ClassId()
    {
        return 1820;
    }
    PickupEntityData* m_Data; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02450
// RuntimeId: 09569
// TypeInfo:  0x00000001428894B0
#ifndef _KitPickupEntityData_
#define _KitPickupEntityData_
#pragma pack(push, 16)
class KitPickupEntityData : public PickupEntityData
{
public:
    static __inline KitPickupEntityData* DefaultInstance()
    {
        return (KitPickupEntityData*) 0x00000000688A9F50;
    }
    static __inline unsigned int ClassId()
    {
        return 2450;
    }
    Boolean m_KeepAdditionalWeapons; //0x00F0
    char _0x00F1[15];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02451
// RuntimeId: 09567
// TypeInfo:  0x0000000142889510
#ifndef _WeaponUnlockPickupEntityData_
#define _WeaponUnlockPickupEntityData_
#pragma pack(push, 16)
class WeaponUnlockPickupEntityData : public PickupEntityData
{
public:
    static __inline WeaponUnlockPickupEntityData* DefaultInstance()
    {
        return (WeaponUnlockPickupEntityData*) 0x00000000688AA070;
    }
    static __inline unsigned int ClassId()
    {
        return 2451;
    }
    Array<WeaponUnlockPickupData> m_Weapons; //0x00F0
    Boolean m_UseForPersistence; //0x00F8
    char _0x00F9[7];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02449
// RuntimeId: 09575
// TypeInfo:  0x00000001428893F0
#ifndef _DynamicWeaponPickupEntityData_
#define _DynamicWeaponPickupEntityData_
#pragma pack(push, 16)
class DynamicWeaponPickupEntityData : public PickupEntityData
{
public:
    static __inline DynamicWeaponPickupEntityData* DefaultInstance()
    {
        return (DynamicWeaponPickupEntityData*) 0x00000000688A9E30;
    }
    static __inline unsigned int ClassId()
    {
        return 2449;
    }
    Array<DynamicWeaponPickupSlotData> m_WeaponSlots; //0x00F0
    char _0x00F8[8];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02196
// RuntimeId: 09559
// TypeInfo:  0x00000001428895D0
#ifndef _WeaponStateEntityData_
#define _WeaponStateEntityData_
#pragma pack(push, 8)
class WeaponStateEntityData : public EntityData
{
public:
    static __inline WeaponStateEntityData* DefaultInstance()
    {
        return (WeaponStateEntityData*) 0x00000000688A2300;
    }
    static __inline unsigned int ClassId()
    {
        return 2196;
    }
    Realm m_Realm; //0x0018
    Int32 m_WeaponSlot; //0x001C
    Int32 m_Ammo; //0x0020
    Int32 m_AmmoInMags; //0x0024
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02368
// RuntimeId: 09557
// TypeInfo:  0x0000000142889630
#ifndef _StateEventGateEntityData_
#define _StateEventGateEntityData_
#pragma pack(push, 8)
class StateEventGateEntityData : public EntityData
{
public:
    static __inline StateEventGateEntityData* DefaultInstance()
    {
        return (StateEventGateEntityData*) 0x00000000688A5FB0;
    }
    static __inline unsigned int ClassId()
    {
        return 2368;
    }
    EventGateState m_CheckedState; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02246
// RuntimeId: 09553
// TypeInfo:  0x0000000142889690
#ifndef _CoverPrepareFireEntityData_
#define _CoverPrepareFireEntityData_
#pragma pack(push, 8)
class CoverPrepareFireEntityData : public EntityData
{
public:
    static __inline CoverPrepareFireEntityData* DefaultInstance()
    {
        return (CoverPrepareFireEntityData*) 0x00000000688A34B0;
    }
    static __inline unsigned int ClassId()
    {
        return 2246;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02242
// RuntimeId: 09551
// TypeInfo:  0x00000001428896F0
#ifndef _PlayerLookAtEntityData_
#define _PlayerLookAtEntityData_
#pragma pack(push, 16)
class PlayerLookAtEntityData : public EntityData
{
public:
    static __inline PlayerLookAtEntityData* DefaultInstance()
    {
        return (PlayerLookAtEntityData*) 0x00000000688A3330;
    }
    static __inline unsigned int ClassId()
    {
        return 2242;
    }
    char _0x0018[8];
    LinearTransform m_TargetTransform; //0x0020
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03117
// RuntimeId: 09549
// TypeInfo:  0x0000000142889750
#ifndef _HitReactionComponentData_
#define _HitReactionComponentData_
#pragma pack(push, 16)
class HitReactionComponentData : public GameComponentData
{
public:
    static __inline HitReactionComponentData* DefaultInstance()
    {
        return (HitReactionComponentData*) 0x00000000688C5DF0;
    }
    static __inline unsigned int ClassId()
    {
        return 3117;
    }
    HitReactionComponentBinding m_HitReactionBinding; //0x0070
    Boolean m_Enabled; //0x0124
    char _0x0125[11];
};//Size=0x0130
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02544
// RuntimeId: 09543
// TypeInfo:  0x00000001428897B0
#ifndef _BlockAimAssistEntityData_
#define _BlockAimAssistEntityData_
#pragma pack(push, 16)
class BlockAimAssistEntityData : public SpatialEntityData
{
public:
    static __inline BlockAimAssistEntityData* DefaultInstance()
    {
        return (BlockAimAssistEntityData*) 0x00000000688AEBA0;
    }
    static __inline unsigned int ClassId()
    {
        return 2544;
    }
    BlockAimAssistData m_BlockData; //0x0060
    char _0x0068[8];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01816
// RuntimeId: 07210
// TypeInfo:  0x000000014284F7C0
#ifndef _CharacterCustomizationAsset_
#define _CharacterCustomizationAsset_
#pragma pack(push, 8)
class CharacterCustomizationAsset : public DataContainerPolicyAsset
{
public:
    static __inline CharacterCustomizationAsset* DefaultInstance()
    {
        return (CharacterCustomizationAsset*) 0x00000000688993A0;
    }
    static __inline unsigned int ClassId()
    {
        return 1816;
    }
    UIHudIcon m_UIHudIcon; //0x0018
    char _0x001C[4];
    CString m_UIKitIconName; //0x0020
    CString m_LabelSid; //0x0028
    CustomizationTable* m_VisualTable; //0x0030
    CustomizationTable* m_SpecializationTable; //0x0038
    Array<VoiceOverLabel*> m_VoiceOverLabels; //0x0040
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03257
// RuntimeId: 09537
// TypeInfo:  0x0000000142889870
#ifndef _SoldierWeaponSocketObjectData_
#define _SoldierWeaponSocketObjectData_
#pragma pack(push, 16)
class SoldierWeaponSocketObjectData : public SocketObjectDataBase
{
public:
    static __inline SoldierWeaponSocketObjectData* DefaultInstance()
    {
        return (SoldierWeaponSocketObjectData*) 0x00000000688CACB0;
    }
    static __inline unsigned int ClassId()
    {
        return 3257;
    }
    Guid m_SoldierWeaponGuid; //0x0010
    LinearTransform m_Transform; //0x0020
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02335
// RuntimeId: 09534
// TypeInfo:  0x00000001428898D0
#ifndef _CoverPeekEntityData_
#define _CoverPeekEntityData_
#pragma pack(push, 8)
class CoverPeekEntityData : public EntityData
{
public:
    static __inline CoverPeekEntityData* DefaultInstance()
    {
        return (CoverPeekEntityData*) 0x00000000688A53C0;
    }
    static __inline unsigned int ClassId()
    {
        return 2335;
    }
    CoverPeekBinding m_Binding; //0x0018
    Float32 m_DetectDistanceForward; //0x0090
    Float32 m_DetectDistanceHorizontal; //0x0094
    Boolean m_OverEnabled; //0x0098
    Boolean m_HorizEnabled; //0x0099
    char _0x009A[6];
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03033
// RuntimeId: 09530
// TypeInfo:  0x0000000142889930
#ifndef _BlockAimAssistComponentData_
#define _BlockAimAssistComponentData_
#pragma pack(push, 16)
class BlockAimAssistComponentData : public GameComponentData
{
public:
    static __inline BlockAimAssistComponentData* DefaultInstance()
    {
        return (BlockAimAssistComponentData*) 0x00000000688C13A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3033;
    }
    BlockAimAssistData m_BlockData; //0x0070
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03008
// RuntimeId: 09528
// TypeInfo:  0x0000000142889990
#ifndef _EntryAimAssistTargetOptionsComponentData_
#define _EntryAimAssistTargetOptionsComponentData_
#pragma pack(push, 16)
class EntryAimAssistTargetOptionsComponentData : public GameComponentData
{
public:
    static __inline EntryAimAssistTargetOptionsComponentData* DefaultInstance()
    {
        return (EntryAimAssistTargetOptionsComponentData*) 0x00000000688BF250;
    }
    static __inline unsigned int ClassId()
    {
        return 3008;
    }
    Float32 m_NotSnapZoomTargetAngle; //0x0070
    Boolean m_AllowSoldierAsTarget; //0x0074
    char _0x0075[11];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03020
// RuntimeId: 09526
// TypeInfo:  0x00000001428899F0
#ifndef _AimAssistNodeSnapPointComponentData_
#define _AimAssistNodeSnapPointComponentData_
#pragma pack(push, 16)
class AimAssistNodeSnapPointComponentData : public GameComponentData
{
public:
    static __inline AimAssistNodeSnapPointComponentData* DefaultInstance()
    {
        return (AimAssistNodeSnapPointComponentData*) 0x00000000688C0570;
    }
    static __inline unsigned int ClassId()
    {
        return 3020;
    }
    Uint32 m_Priority; //0x0070
    Float32 m_UnderReticleSphereRadius; //0x0074
    Float32 m_UnderReticleCapsuleLength; //0x0078
    Uint32 m_Priority_UnderReticle; //0x007C
    Boolean m_Enabled; //0x0080
    char _0x0081[15];
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03011
// RuntimeId: 09524
// TypeInfo:  0x0000000142889A50
#ifndef _AimAssistNodeComponentData_
#define _AimAssistNodeComponentData_
#pragma pack(push, 16)
class AimAssistNodeComponentData : public GameComponentData
{
public:
    static __inline AimAssistNodeComponentData* DefaultInstance()
    {
        return (AimAssistNodeComponentData*) 0x00000000688BF440;
    }
    static __inline unsigned int ClassId()
    {
        return 3011;
    }
    Vec3 m_StickyCenterOffset; //0x0070
    TeamId m_Team; //0x0080
    Boolean m_Enabled; //0x0084
    Boolean m_GetTeamFromOwner; //0x0085
    Boolean m_ColorPlayerReticle; //0x0086
    char _0x0087[9];
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03067
// RuntimeId: 09522
// TypeInfo:  0x0000000142889AB0
#ifndef _SoldierBreathControlComponentData_
#define _SoldierBreathControlComponentData_
#pragma pack(push, 16)
class SoldierBreathControlComponentData : public GameComponentData
{
public:
    static __inline SoldierBreathControlComponentData* DefaultInstance()
    {
        return (SoldierBreathControlComponentData*) 0x00000000688C2CF0;
    }
    static __inline unsigned int ClassId()
    {
        return 3067;
    }
    Float32 m_Time; //0x0070
    Float32 m_TransitionTime; //0x0074
    Float32 m_TransitionCurveShape; //0x0078
    Float32 m_ReleaseTime; //0x007C
    Float32 m_PenaltyMultiplier; //0x0080
    Float32 m_PenaltyTimeout; //0x0084
    char _0x0088[8];
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03064
// RuntimeId: 07133
// TypeInfo:  0x0000000142850720
#ifndef _CharacterCustomizationComponentData_
#define _CharacterCustomizationComponentData_
#pragma pack(push, 16)
class CharacterCustomizationComponentData : public GameComponentData
{
public:
    static __inline CharacterCustomizationComponentData* DefaultInstance()
    {
        return (CharacterCustomizationComponentData*) 0x00000000688C2AC0;
    }
    static __inline unsigned int ClassId()
    {
        return 3064;
    }
    MeshLodGroup* m_SharedLodGroup; //0x0070
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01949
// RuntimeId: 09518
// TypeInfo:  0x0000000142889B70
#ifndef _CharacterSocketListAsset_
#define _CharacterSocketListAsset_
#pragma pack(push, 8)
class CharacterSocketListAsset : public Asset
{
public:
    static __inline CharacterSocketListAsset* DefaultInstance()
    {
        return (CharacterSocketListAsset*) 0x000000006889C850;
    }
    static __inline unsigned int ClassId()
    {
        return 1949;
    }
    Array<SocketData*> m_GameplaySockets; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02044
// RuntimeId: 09516
// TypeInfo:  0x0000000142889BD0
#ifndef _SocketData_
#define _SocketData_
#pragma pack(push, 16)
class SocketData : public DataContainer
{
public:
    static __inline SocketData* DefaultInstance()
    {
        return (SocketData*) 0x000000006889E550;
    }
    static __inline unsigned int ClassId()
    {
        return 2044;
    }
    Guid m_UnlockAssetGuid; //0x0010
    Guid m_BelongsToUnlockAssetGuid; //0x0020
    CString m_BoneName; //0x0030
    Int32 m_BoneId; //0x0038
    char _0x003C[4];
    LinearTransform m_BoneRigidTransform; //0x0040
    LinearTransform m_Transform; //0x0080
    Array<SocketObjectDataBase*> m_AvailableObjects; //0x00C0
    GearSlot m_GearSlot; //0x00C8
    SocketType m_SocketType; //0x00CC
    Boolean m_Excluded; //0x00D0
    Boolean m_UsesDefaultObject; //0x00D1
    Boolean m_DefaultEnableSocketEntities; //0x00D2
    Boolean m_ForceSocketEntitiesEnabled; //0x00D3
    Boolean m_HideByZoomTransition; //0x00D4
    Boolean m_HideByLightToggle; //0x00D5
    char _0x00D6[10];
};//Size=0x00E0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03256
// RuntimeId: 09830
// TypeInfo:  0x0000000142887770
#ifndef _WeaponRegularSocketObjectData_
#define _WeaponRegularSocketObjectData_
#pragma pack(push, 16)
class WeaponRegularSocketObjectData : public WeaponSocketObjectData
{
public:
    static __inline WeaponRegularSocketObjectData* DefaultInstance()
    {
        return (WeaponRegularSocketObjectData*) 0x00000000688CAC10;
    }
    static __inline unsigned int ClassId()
    {
        return 3256;
    }
    Array<LinearTransform> m_Mesh3pTransforms; //0x0030
    char _0x0038[8];
    LinearTransform m_Transform; //0x0040
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03124
// RuntimeId: 09510
// TypeInfo:  0x0000000142889C90
#ifndef _MovementComponentData_
#define _MovementComponentData_
#pragma pack(push, 16)
class MovementComponentData : public GameComponentData
{
public:
    static __inline MovementComponentData* DefaultInstance()
    {
        return (MovementComponentData*) 0x00000000688C6330;
    }
    static __inline unsigned int ClassId()
    {
        return 3124;
    }
    MovementComponentBinding m_MovementBinding; //0x0070
    Boolean m_ClientSidePhysicsControlled; //0x00D4
    char _0x00D5[11];
};//Size=0x00E0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03029
// RuntimeId: 07020
// TypeInfo:  0x00000001428512C0
#ifndef _CharacterCameraComponentData_
#define _CharacterCameraComponentData_
#pragma pack(push, 16)
class CharacterCameraComponentData : public GameComponentData
{
public:
    static __inline CharacterCameraComponentData* DefaultInstance()
    {
        return (CharacterCameraComponentData*) 0x00000000688C0DB0;
    }
    static __inline unsigned int ClassId()
    {
        return 3029;
    }
    Array<TargetCameraData*> m_Cameras; //0x0070
    CharacterCameraForwardAxis m_CameraForwardAxis; //0x0078
    char _0x007C[4];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03000
// RuntimeId: 09500
// TypeInfo:  0x0000000142889D50
#ifndef _SoldierBodyComponentData_
#define _SoldierBodyComponentData_
#pragma pack(push, 16)
class SoldierBodyComponentData : public GameComponentData
{
public:
    static __inline SoldierBodyComponentData* DefaultInstance()
    {
        return (SoldierBodyComponentData*) 0x00000000688BEC50;
    }
    static __inline unsigned int ClassId()
    {
        return 3000;
    }
    Float32 m_OverrideGravityValue; //0x0070
    Float32 m_OverrideVelocityY; //0x0074
    Float32 m_SprintMultiplier; //0x0078
    Boolean m_OverrideGravity; //0x007C
    Boolean m_OverrideVelocity; //0x007D
    Boolean m_DisableParachute; //0x007E
    char _0x007F[1];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03044
// RuntimeId: 09498
// TypeInfo:  0x0000000142889DB0
#ifndef _BoneCollisionComponentData_
#define _BoneCollisionComponentData_
#pragma pack(push, 16)
class BoneCollisionComponentData : public GameComponentData
{
public:
    static __inline BoneCollisionComponentData* DefaultInstance()
    {
        return (BoneCollisionComponentData*) 0x00000000688C1C50;
    }
    static __inline unsigned int ClassId()
    {
        return 3044;
    }
    SkeletonCollisionData* m_SkeletonCollisionData; //0x0070
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03098
// RuntimeId: 07074
// TypeInfo:  0x0000000142850B40
#ifndef _EntryComponentData_
#define _EntryComponentData_
#pragma pack(push, 16)
class EntryComponentData : public GameComponentData
{
public:
    static __inline EntryComponentData* DefaultInstance()
    {
        return (EntryComponentData*) 0x00000000688C4AC0;
    }
    static __inline unsigned int ClassId()
    {
        return 3098;
    }
    Vec3 m_SoldierOffset; //0x0070
    EntryClass m_EntryClass; //0x0080
    char _0x0084[4];
    GameAIEntryData* m_AIData; //0x0088
    EntryInputActionMapsData* m_InputConceptDefinition; //0x0090
    InputActionMappingsData* m_InputMapping; //0x0098
    Array<InputCurveData*> m_InputCurves; //0x00A0
    EntryComponentHudData m_HudData; //0x00A8
    Int32 m_EntryOrderNumber; //0x00B4
    Float32 m_EnterImpulse; //0x00B8
    Float32 m_EntryRadius; //0x00BC
    Float32 m_SoldierTransitionInvisbleTime; //0x00C0
    Int32 m_NumberOfStances; //0x00C4
    EntrySpottingSettings m_EntrySpottingSettings; //0x00C8
    char _0x00CC[4];
    EntryComponentSoundData* m_EntryComponentSound; //0x00D0
    Int32 m_TriggerEventOnKey; //0x00D8
    Boolean m_ForbiddenForHuman; //0x00DC
    Boolean m_IsAllowedToExitInAir; //0x00DD
    Boolean m_IsShielded; //0x00DE
    Boolean m_LockSoldierAimingToEntry; //0x00DF
    Boolean m_ShowSoldierInEntry; //0x00E0
    Boolean m_Show1pSoldierInEntry; //0x00E1
    Boolean m_StancesEnabled; //0x00E2
    Boolean m_ShowSoldierWeaponInEntry; //0x00E3
    Boolean m_Show1pSoldierInEntryForPlayerOnly; //0x00E4
    Boolean m_Show3pSoldierWeaponInEntry; //0x00E5
    Boolean m_ShowSoldierGearInEntry; //0x00E6
    PoseConstraintsData m_PoseConstraints; //0x00E7
    Boolean m_AllowRagdollFromEntry; //0x00EA
    char _0x00EB[5];
};//Size=0x00F0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01823
// RuntimeId: 03810
// TypeInfo:  0x00000001427FE070
#ifndef _DataBusData_
#define _DataBusData_
#pragma pack(push, 8)
class DataBusData : public Asset
{
public:
    static __inline DataBusData* DefaultInstance()
    {
        return (DataBusData*) 0x0000000068899850;
    }
    static __inline unsigned int ClassId()
    {
        return 1823;
    }
    Array<PropertyConnection> m_PropertyConnections; //0x0018
    Array<LinkConnection> m_LinkConnections; //0x0020
    DynamicDataContainer* m_Interface; //0x0028
    Uint16 m_Flags; //0x0030
    char _0x0032[6];
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01824
// RuntimeId: 05028
// TypeInfo:  0x000000014281EC30
#ifndef _EntityBusData_
#define _EntityBusData_
#pragma pack(push, 8)
class EntityBusData : public DataBusData
{
public:
    static __inline EntityBusData* DefaultInstance()
    {
        return (EntityBusData*) 0x00000000688998A0;
    }
    static __inline unsigned int ClassId()
    {
        return 1824;
    }
    Array<EventConnection> m_EventConnections; //0x0038
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01825
// RuntimeId: 05030
// TypeInfo:  0x000000014281EBD0
#ifndef _Blueprint_
#define _Blueprint_
#pragma pack(push, 8)
class Blueprint : public EntityBusData
{
public:
    static __inline Blueprint* DefaultInstance()
    {
        return (Blueprint*) 0x0000000068899900;
    }
    static __inline unsigned int ClassId()
    {
        return 1825;
    }
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01833
// RuntimeId: 05032
// TypeInfo:  0x000000014281EB70
#ifndef _ObjectBlueprint_
#define _ObjectBlueprint_
#pragma pack(push, 8)
class ObjectBlueprint : public Blueprint
{
public:
    static __inline ObjectBlueprint* DefaultInstance()
    {
        return (ObjectBlueprint*) 0x0000000068899D40;
    }
    static __inline unsigned int ClassId()
    {
        return 1833;
    }
    GameObjectData* m_Object; //0x0040
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00305
// RuntimeId: 05814
// TypeInfo:  0x000000014282FA50
#ifndef _ClientGameComponent_
#define _ClientGameComponent_
class ClientGameComponent : public GameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 305;
    }
    char _0x0030[8];
};//Size=0x0038
#endif

////////////////////////////////////////
// ClassId:   00530
// RuntimeId: 05801
// TypeInfo:  0x000000014282F700
#ifndef _ClientGamePhysicsComponent_
#define _ClientGamePhysicsComponent_
class ClientGamePhysicsComponent : public PhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 530;
    }
    char _0x0028[32];
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00565
// RuntimeId: 08180
// TypeInfo:  0x0000000142865460
#ifndef _HealthComponent_
#define _HealthComponent_
class HealthComponent : public Component
{
public:
    static __inline unsigned int ClassId()
    {
        return 565;
    }
    char _0x0020[8];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00322
// RuntimeId: 05708
// TypeInfo:  0x000000014282C420
#ifndef _ClientCharacterCustomizationComponent_
#define _ClientCharacterCustomizationComponent_
class ClientCharacterCustomizationComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 322;
    }
    char _0x0038[584];
};//Size=0x0280
#endif

////////////////////////////////////////
// ClassId:   00371
// RuntimeId: 05707
// TypeInfo:  0x000000014282C470
#ifndef _ClientCharacterCameraComponent_
#define _ClientCharacterCameraComponent_
class ClientCharacterCameraComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 371;
    }
    char _0x0038[88];
};//Size=0x0090
#endif

////////////////////////////////////////
// ClassId:   00175
// RuntimeId: 06049
// TypeInfo:  0x0000000142835CE0
#ifndef _TargetCameraCallback_
#define _TargetCameraCallback_
class TargetCameraCallback
{
public:
    static __inline unsigned int ClassId()
    {
        return 175;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00318
// RuntimeId: 09466
// TypeInfo:  0x00000001428821B0
#ifndef _ClientSoldierBreathControlComponent_
#define _ClientSoldierBreathControlComponent_
class ClientSoldierBreathControlComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 318;
    }
    char _0x0038[144];
};//Size=0x00C8
#endif

////////////////////////////////////////
// ClassId:   00404
// RuntimeId: 09465
// TypeInfo:  0x0000000142882200
#ifndef _ClientSoldierBodyComponent_
#define _ClientSoldierBodyComponent_
class ClientSoldierBodyComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 404;
    }
    char _0x0038[232];
};//Size=0x0120
#endif

////////////////////////////////////////
// ClassId:   00413
// RuntimeId: 09464
// TypeInfo:  0x0000000142882250
#ifndef _ClientRagdollComponent_
#define _ClientRagdollComponent_
class ClientRagdollComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 413;
    }
    char _0x0038[536];
};//Size=0x0250
#endif

////////////////////////////////////////
// ClassId:   00532
// RuntimeId: 09463
// TypeInfo:  0x00000001428822A0
#ifndef _ClientPickupPhysicsComponent_
#define _ClientPickupPhysicsComponent_
class ClientPickupPhysicsComponent : public ClientGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 532;
    }
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00407
// RuntimeId: 09462
// TypeInfo:  0x00000001428822F0
#ifndef _ClientPhantomComponent_
#define _ClientPhantomComponent_
class ClientPhantomComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 407;
    }
    char _0x0038[1288];
};//Size=0x0540
#endif

////////////////////////////////////////
// ClassId:   00314
// RuntimeId: 09461
// TypeInfo:  0x0000000142882340
#ifndef _ClientMovementComponent_
#define _ClientMovementComponent_
class ClientMovementComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 314;
    }
    char _0x0038[168];
};//Size=0x00E0
#endif

////////////////////////////////////////
// ClassId:   00382
// RuntimeId: 09460
// TypeInfo:  0x0000000142882390
#ifndef _ClientHitReactionComponent_
#define _ClientHitReactionComponent_
class ClientHitReactionComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 382;
    }
    char _0x0038[120];
};//Size=0x00B0
#endif

////////////////////////////////////////
// ClassId:   00375
// RuntimeId: 09459
// TypeInfo:  0x00000001428823E0
#ifndef _ClientFaceposerComponent_
#define _ClientFaceposerComponent_
class ClientFaceposerComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 375;
    }
    char _0x0038[312];
};//Size=0x0170
#endif

////////////////////////////////////////
// ClassId:   00398
// RuntimeId: 09458
// TypeInfo:  0x0000000142882430
#ifndef _ClientBoneCollisionComponent_
#define _ClientBoneCollisionComponent_
class ClientBoneCollisionComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 398;
    }
    char _0x0038[784];
};//Size=0x0348
#endif

////////////////////////////////////////
// ClassId:   00363
// RuntimeId: 09457
// TypeInfo:  0x0000000142882480
#ifndef _ClientBlockAimAssistComponent_
#define _ClientBlockAimAssistComponent_
class ClientBlockAimAssistComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 363;
    }
    char _0x0038[8];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00433
// RuntimeId: 09456
// TypeInfo:  0x0000000142881F80
#ifndef _ClientEntryAimAssistTargetOptionsComponent_
#define _ClientEntryAimAssistTargetOptionsComponent_
class ClientEntryAimAssistTargetOptionsComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 433;
    }
};//Size=0x0038
#endif

////////////////////////////////////////
// ClassId:   00399
// RuntimeId: 09455
// TypeInfo:  0x0000000142881FD0
#ifndef _ClientAimAssistNodeSnapPointComponent_
#define _ClientAimAssistNodeSnapPointComponent_
class ClientAimAssistNodeSnapPointComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 399;
    }
    char _0x0038[8];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00432
// RuntimeId: 09454
// TypeInfo:  0x00000001428824D0
#ifndef _ClientAimAssistNodeComponent_
#define _ClientAimAssistNodeComponent_
class ClientAimAssistNodeComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 432;
    }
    char _0x0038[1088];
};//Size=0x0478
#endif

////////////////////////////////////////
// ClassId:   01258
// RuntimeId: 09453
// TypeInfo:  0x0000000142882570
#ifndef _ClientWeaponLagEntity_
#define _ClientWeaponLagEntity_
class ClientWeaponLagEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1258;
    }
    char _0x0020[72];
};//Size=0x0068
#endif

////////////////////////////////////////
// ClassId:   01324
// RuntimeId: 09452
// TypeInfo:  0x0000000142882610
#ifndef _ClientCoverPeekEntity_
#define _ClientCoverPeekEntity_
class ClientCoverPeekEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1324;
    }
    char _0x0020[512];
};//Size=0x0220
#endif

////////////////////////////////////////
// ClassId:   00203
// RuntimeId: 05928
// TypeInfo:  0x0000000142833190
#ifndef _Tool_
#define _Tool_
class Tool
{
public:
    static __inline unsigned int ClassId()
    {
        return 203;
    }
    char _0x0000[24];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00662
// RuntimeId: 05862
// TypeInfo:  0x0000000142831910
#ifndef _GameComponentEntity_
#define _GameComponentEntity_
class GameComponentEntity : public ComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 662;
    }
    char _0x0040[32];
};//Size=0x0060
#endif

////////////////////////////////////////
// ClassId:   00418
// RuntimeId: 09449
// TypeInfo:  0x00000001428813B0
#ifndef _ClientSoldierGripComponent_
#define _ClientSoldierGripComponent_
class ClientSoldierGripComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 418;
    }
    char _0x0038[168];
};//Size=0x00E0
#endif

////////////////////////////////////////
// ClassId:   00365
// RuntimeId: 09448
// TypeInfo:  0x0000000142881400
#ifndef _ClientAnimationTurretRotationComponent_
#define _ClientAnimationTurretRotationComponent_
class ClientAnimationTurretRotationComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 365;
    }
    char _0x0038[88];
};//Size=0x0090
#endif

////////////////////////////////////////
// ClassId:   00663
// RuntimeId: 05816
// TypeInfo:  0x000000014282FBE0
#ifndef _ClientGameComponentEntity_
#define _ClientGameComponentEntity_
class ClientGameComponentEntity : public GameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 663;
    }
};//Size=0x0060
#endif

////////////////////////////////////////
// ClassId:   00665
// RuntimeId: 05818
// TypeInfo:  0x000000014282FAA0
#ifndef _ClientPhysicsEntity_
#define _ClientPhysicsEntity_
class ClientPhysicsEntity : public ClientGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 665;
    }
    char _0x0060[8];
};//Size=0x0068
#endif

////////////////////////////////////////
// ClassId:   00677
// RuntimeId: 05638
// TypeInfo:  0x0000000142828B30
#ifndef _ClientProjectileEntity_
#define _ClientProjectileEntity_
class ClientProjectileEntity : public ClientPhysicsEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 677;
    }
    char _0x0068[136];
};//Size=0x00F0
#endif

////////////////////////////////////////
// ClassId:   00682
// RuntimeId: 05636
// TypeInfo:  0x0000000142828DB0
#ifndef _ClientGhostProjectileEntity_
#define _ClientGhostProjectileEntity_
class ClientGhostProjectileEntity : public ClientProjectileEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 682;
    }
    char _0x00F0[496];
};//Size=0x02E0
#endif

////////////////////////////////////////
// ClassId:   00685
// RuntimeId: 09443
// TypeInfo:  0x0000000142881900
#ifndef _ClientGrenadeEntity_
#define _ClientGrenadeEntity_
class ClientGrenadeEntity : public ClientGhostProjectileEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 685;
    }
    char _0x02E0[224];
};//Size=0x03C0
#endif

////////////////////////////////////////
// ClassId:   00686
// RuntimeId: 09442
// TypeInfo:  0x00000001428819A0
#ifndef _ClientFlareEntity_
#define _ClientFlareEntity_
class ClientFlareEntity : public ClientGrenadeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 686;
    }
};//Size=0x03C0
#endif

////////////////////////////////////////
// ClassId:   00687
// RuntimeId: 09441
// TypeInfo:  0x0000000142881A40
#ifndef _ClientExplosionPackEntity_
#define _ClientExplosionPackEntity_
class ClientExplosionPackEntity : public ClientGhostProjectileEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 687;
    }
    char _0x02E0[208];
};//Size=0x03B0
#endif

////////////////////////////////////////
// ClassId:   00539
// RuntimeId: 09440
// TypeInfo:  0x0000000142881450
#ifndef _ClientMissilePhysicsComponent_
#define _ClientMissilePhysicsComponent_
class ClientMissilePhysicsComponent : public ClientGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 539;
    }
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00534
// RuntimeId: 09439
// TypeInfo:  0x00000001428814A0
#ifndef _ClientExplosionPackPhysicsComponent_
#define _ClientExplosionPackPhysicsComponent_
class ClientExplosionPackPhysicsComponent : public ClientGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 534;
    }
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00347
// RuntimeId: 05719
// TypeInfo:  0x000000014282C7E0
#ifndef _ClientEntryComponent_
#define _ClientEntryComponent_
class ClientEntryComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 347;
    }
    char _0x0038[680];
};//Size=0x02E0
#endif

////////////////////////////////////////
// ClassId:   00348
// RuntimeId: 09437
// TypeInfo:  0x00000001428814F0
#ifndef _ClientRemoteEntryComponent_
#define _ClientRemoteEntryComponent_
class ClientRemoteEntryComponent : public ClientEntryComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 348;
    }
    char _0x02E0[16];
};//Size=0x02F0
#endif

////////////////////////////////////////
// ClassId:   00377
// RuntimeId: 09436
// TypeInfo:  0x0000000142881540
#ifndef _ClientWeaponZeroingComponent_
#define _ClientWeaponZeroingComponent_
class ClientWeaponZeroingComponent : public ClientGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 377;
    }
    char _0x0038[40];
};//Size=0x0060
#endif

////////////////////////////////////////
// ClassId:   00435
// RuntimeId: 06297
// TypeInfo:  0x000000014283CF40
#ifndef _ServerGameComponent_
#define _ServerGameComponent_
class ServerGameComponent : public GameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 435;
    }
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00507
// RuntimeId: 06346
// TypeInfo:  0x000000014283EF40
#ifndef _ServerEntryComponent_
#define _ServerEntryComponent_
class ServerEntryComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 507;
    }
    char _0x0030[320];
};//Size=0x0170
#endif

////////////////////////////////////////
// ClassId:   00512
// RuntimeId: 09433
// TypeInfo:  0x0000000142880C20
#ifndef _ServerWeaponZeroingComponent_
#define _ServerWeaponZeroingComponent_
class ServerWeaponZeroingComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 512;
    }
    char _0x0030[40];
};//Size=0x0058
#endif

////////////////////////////////////////
// ClassId:   00461
// RuntimeId: 09432
// TypeInfo:  0x0000000142880C70
#ifndef _ServerSoldierWeaponsComponent_
#define _ServerSoldierWeaponsComponent_
class ServerSoldierWeaponsComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 461;
    }
    char _0x0030[2656];
};//Size=0x0A90
#endif

////////////////////////////////////////
// ClassId:   00548
// RuntimeId: 06283
// TypeInfo:  0x000000014283C840
#ifndef _ServerGamePhysicsComponent_
#define _ServerGamePhysicsComponent_
class ServerGamePhysicsComponent : public PhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 548;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00566
// RuntimeId: 06282
// TypeInfo:  0x000000014283C890
#ifndef _ServerGameHealthComponent_
#define _ServerGameHealthComponent_
class ServerGameHealthComponent : public HealthComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 566;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00481
// RuntimeId: 06332
// TypeInfo:  0x000000014283EE50
#ifndef _ServerCharacterCustomizationComponent_
#define _ServerCharacterCustomizationComponent_
class ServerCharacterCustomizationComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 481;
    }
    char _0x0030[648];
};//Size=0x02B8
#endif

////////////////////////////////////////
// ClassId:   00516
// RuntimeId: 09428
// TypeInfo:  0x0000000142880DB0
#ifndef _ServerSoldierCameraComponent_
#define _ServerSoldierCameraComponent_
class ServerSoldierCameraComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 516;
    }
    char _0x0030[112];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   00436
// RuntimeId: 09427
// TypeInfo:  0x0000000142880E00
#ifndef _ServerSoldierBodyComponent_
#define _ServerSoldierBodyComponent_
class ServerSoldierBodyComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 436;
    }
    char _0x0030[272];
};//Size=0x0140
#endif

////////////////////////////////////////
// ClassId:   00487
// RuntimeId: 09426
// TypeInfo:  0x0000000142880E50
#ifndef _ServerRagdollComponent_
#define _ServerRagdollComponent_
class ServerRagdollComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 487;
    }
    char _0x0030[480];
};//Size=0x0210
#endif

////////////////////////////////////////
// ClassId:   00557
// RuntimeId: 09425
// TypeInfo:  0x0000000142880EA0
#ifndef _ServerPickupPhysicsComponent_
#define _ServerPickupPhysicsComponent_
class ServerPickupPhysicsComponent : public ServerGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 557;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00473
// RuntimeId: 09424
// TypeInfo:  0x0000000142880EF0
#ifndef _ServerMovementComponent_
#define _ServerMovementComponent_
class ServerMovementComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 473;
    }
    char _0x0030[24];
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00498
// RuntimeId: 09423
// TypeInfo:  0x0000000142880F40
#ifndef _ServerHitReactionComponent_
#define _ServerHitReactionComponent_
class ServerHitReactionComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 498;
    }
    char _0x0030[112];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   00497
// RuntimeId: 09422
// TypeInfo:  0x0000000142880F90
#ifndef _ServerBoneCollisionComponent_
#define _ServerBoneCollisionComponent_
class ServerBoneCollisionComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 497;
    }
    char _0x0030[784];
};//Size=0x0340
#endif

////////////////////////////////////////
// ClassId:   00624
// RuntimeId: 09421
// TypeInfo:  0x00000001428804B0
#ifndef _ServerStateEventGateEntity_
#define _ServerStateEventGateEntity_
class ServerStateEventGateEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 624;
    }
    char _0x0020[16];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   01147
// RuntimeId: 09420
// TypeInfo:  0x0000000142880550
#ifndef _ServerCustomizeSoldierEntity_
#define _ServerCustomizeSoldierEntity_
class ServerCustomizeSoldierEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1147;
    }
    char _0x0020[1936];
};//Size=0x07B0
#endif

////////////////////////////////////////
// ClassId:   00705
// RuntimeId: 06300
// TypeInfo:  0x000000014283D350
#ifndef _ServerGameComponentEntity_
#define _ServerGameComponentEntity_
class ServerGameComponentEntity : public GameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 705;
    }
};//Size=0x0060
#endif

////////////////////////////////////////
// ClassId:   00714
// RuntimeId: 06303
// TypeInfo:  0x000000014283CF90
#ifndef _ServerPhysicsEntity_
#define _ServerPhysicsEntity_
class ServerPhysicsEntity : public ServerGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 714;
    }
    char _0x0060[8];
};//Size=0x0068
#endif

////////////////////////////////////////
// ClassId:   00707
// RuntimeId: 09417
// TypeInfo:  0x0000000142880690
#ifndef _ServerPickupEntity_
#define _ServerPickupEntity_
class ServerPickupEntity : public ServerGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 707;
    }
    char _0x0060[384];
};//Size=0x01E0
#endif

////////////////////////////////////////
// ClassId:   00204
// RuntimeId: 05929
// TypeInfo:  0x0000000142833140
#ifndef _Weapon_
#define _Weapon_
class Weapon : public Tool
{
public:
    static __inline unsigned int ClassId()
    {
        return 204;
    }
    char _0x0018[328];
};//Size=0x0160
#endif

////////////////////////////////////////
// ClassId:   00713
// RuntimeId: 09415
// TypeInfo:  0x0000000142880730
#ifndef _ServerSoldierWeapon_
#define _ServerSoldierWeapon_
class ServerSoldierWeapon : public ServerGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 713;
    }
    char _0x0060[448];
};//Size=0x0220
#endif

////////////////////////////////////////
// ClassId:   00460
// RuntimeId: 09414
// TypeInfo:  0x0000000142880140
#ifndef _ServerSoldierGripComponent_
#define _ServerSoldierGripComponent_
class ServerSoldierGripComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 460;
    }
    char _0x0030[104];
};//Size=0x0098
#endif

////////////////////////////////////////
// ClassId:   00494
// RuntimeId: 09413
// TypeInfo:  0x0000000142880190
#ifndef _ServerAnimationTurretRotationComponent_
#define _ServerAnimationTurretRotationComponent_
class ServerAnimationTurretRotationComponent : public ServerGameComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 494;
    }
    char _0x0030[80];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00725
// RuntimeId: 06248
// TypeInfo:  0x000000014283A950
#ifndef _ServerProjectileEntity_
#define _ServerProjectileEntity_
class ServerProjectileEntity : public ServerPhysicsEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 725;
    }
    char _0x0068[232];
};//Size=0x0150
#endif

////////////////////////////////////////
// ClassId:   00729
// RuntimeId: 06246
// TypeInfo:  0x000000014283AB30
#ifndef _ServerGhostProjectileEntity_
#define _ServerGhostProjectileEntity_
class ServerGhostProjectileEntity : public ServerProjectileEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 729;
    }
    char _0x0150[400];
};//Size=0x02E0
#endif

////////////////////////////////////////
// ClassId:   00558
// RuntimeId: 09410
// TypeInfo:  0x00000001428801E0
#ifndef _ServerMissilePhysicsComponent_
#define _ServerMissilePhysicsComponent_
class ServerMissilePhysicsComponent : public ServerGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 558;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00573
// RuntimeId: 09409
// TypeInfo:  0x0000000142880230
#ifndef _ServerMissileHealthComponent_
#define _ServerMissileHealthComponent_
class ServerMissileHealthComponent : public ServerGameHealthComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 573;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00554
// RuntimeId: 09408
// TypeInfo:  0x0000000142880280
#ifndef _ServerExplosionPackPhysicsComponent_
#define _ServerExplosionPackPhysicsComponent_
class ServerExplosionPackPhysicsComponent : public ServerGamePhysicsComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 554;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00567
// RuntimeId: 09407
// TypeInfo:  0x00000001428802D0
#ifndef _ServerExplosionPackHealthComponent_
#define _ServerExplosionPackHealthComponent_
class ServerExplosionPackHealthComponent : public ServerGameHealthComponent
{
public:
    static __inline unsigned int ClassId()
    {
        return 567;
    }
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00848
// RuntimeId: 09406
// TypeInfo:  0x000000014287FAD0
#ifndef _ClientWeaponStateEntity_
#define _ClientWeaponStateEntity_
class ClientWeaponStateEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 848;
    }
    char _0x0020[56];
};//Size=0x0058
#endif

////////////////////////////////////////
// ClassId:   01366
// RuntimeId: 09405
// TypeInfo:  0x000000014287FB70
#ifndef _ClientPlayerLookAtEntity_
#define _ClientPlayerLookAtEntity_
class ClientPlayerLookAtEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1366;
    }
    char _0x0020[16];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00701
// RuntimeId: 09404
// TypeInfo:  0x000000014287FC10
#ifndef _ClientTripwireEntity_
#define _ClientTripwireEntity_
class ClientTripwireEntity : public ClientGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 701;
    }
    char _0x0060[288];
};//Size=0x0180
#endif

////////////////////////////////////////
// ClassId:   00692
// RuntimeId: 05629
// TypeInfo:  0x0000000142828D10
#ifndef _ClientControllableEntity_
#define _ClientControllableEntity_
class ClientControllableEntity : public ClientPhysicsEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 692;
    }
    char _0x0068[288];
};//Size=0x0188
#endif

////////////////////////////////////////
// ClassId:   00664
// RuntimeId: 09402
// TypeInfo:  0x000000014287FCB0
#ifndef _ClientPickupEntity_
#define _ClientPickupEntity_
class ClientPickupEntity : public ClientGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 664;
    }
    char _0x0060[1008];
};//Size=0x0450
#endif

////////////////////////////////////////
// ClassId:   00653
// RuntimeId: 09401
// TypeInfo:  0x000000014287FD50
#ifndef _ClientBlockAimAssistEntity_
#define _ClientBlockAimAssistEntity_
class ClientBlockAimAssistEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 653;
    }
    char _0x0028[120];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   01203
// RuntimeId: 06259
// TypeInfo:  0x000000014283B020
#ifndef _ServerTriggerEntity_
#define _ServerTriggerEntity_
class ServerTriggerEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1203;
    }
    char _0x0020[72];
};//Size=0x0068
#endif

////////////////////////////////////////
// ClassId:   01216
// RuntimeId: 09388
// TypeInfo:  0x000000014287F7A0
#ifndef _ServerCharacterStateTriggerEntity_
#define _ServerCharacterStateTriggerEntity_
class ServerCharacterStateTriggerEntity : public ServerTriggerEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1216;
    }
    char _0x0068[32];
};//Size=0x0088
#endif

////////////////////////////////////////
// ClassId:   01335
// RuntimeId: 09387
// TypeInfo:  0x000000014287F840
#ifndef _ServerWeaponStateEntity_
#define _ServerWeaponStateEntity_
class ServerWeaponStateEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1335;
    }
    char _0x0020[48];
};//Size=0x0050
#endif

////////////////////////////////////////
// ClassId:   03418
// RuntimeId: 07706
// TypeInfo:  0x000000014285E0C0
#ifndef _WaypointData_
#define _WaypointData_
#pragma pack(push, 8)
class WaypointData : public DataContainer
{
public:
    static __inline WaypointData* DefaultInstance()
    {
        return (WaypointData*) 0x00000000688CE640;
    }
    static __inline unsigned int ClassId()
    {
        return 3418;
    }
    Int32 m_SchematicsNameHash; //0x0010
    Uint32 m_WaypointId; //0x0014
    Boolean m_UseClientsPosition; //0x0018
    char _0x0019[7];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02352
// RuntimeId: 09384
// TypeInfo:  0x000000014287EFE0
#ifndef _RailRideHeliSegmentData_
#define _RailRideHeliSegmentData_
#pragma pack(push, 16)
class RailRideHeliSegmentData : public EntityData
{
public:
    static __inline RailRideHeliSegmentData* DefaultInstance()
    {
        return (RailRideHeliSegmentData*) 0x00000000688A5910;
    }
    static __inline unsigned int ClassId()
    {
        return 2352;
    }
    Int32 m_StartIndex; //0x0018
    char _0x001C[4];
    Vec4 m_EditorColor; //0x0020
    Int32 m_EndIndex; //0x0030
    Int32 m_NodeIndex1; //0x0034
    Int32 m_NodeIndex2; //0x0038
    Int32 m_NodeIndex3; //0x003C
    Float32 m_ExternalTime; //0x0040
    Float32 m_StartDelay; //0x0044
    Float32 m_WaypointsSpeedScale; //0x0048
    Boolean m_Looping; //0x004C
    Boolean m_TeleportOnActivate; //0x004D
    Boolean m_ForceSpeedOnActivate; //0x004E
    Boolean m_ForceDirectionOnActivate; //0x004F
    Boolean m_TeleportOnLoop; //0x0050
    Boolean m_OldRailCompatibility; //0x0051
    char _0x0052[14];
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02422
// RuntimeId: 09382
// TypeInfo:  0x000000014287F040
#ifndef _RailRideNodeHeliData_
#define _RailRideNodeHeliData_
#pragma pack(push, 16)
class RailRideNodeHeliData : public GameComponentEntityData
{
public:
    static __inline RailRideNodeHeliData* DefaultInstance()
    {
        return (RailRideNodeHeliData*) 0x00000000688A7BF0;
    }
    static __inline unsigned int ClassId()
    {
        return 2422;
    }
    Float32 m_WindNoise; //0x0080
    Float32 m_Speed; //0x0084
    Float32 m_PointToDistance; //0x0088
    Float32 m_Curvature; //0x008C
    Float32 m_Constraint; //0x0090
    Float32 m_ForcePitch; //0x0094
    Float32 m_BankingScale; //0x0098
    Boolean m_LimitWindToHorizontal; //0x009C
    Boolean m_UseVelocityDirection; //0x009D
    Boolean m_PointForward; //0x009E
    Boolean m_WingMode; //0x009F
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02463
// RuntimeId: 09380
// TypeInfo:  0x000000014287F0A0
#ifndef _RailRideNodePointToData_
#define _RailRideNodePointToData_
#pragma pack(push, 16)
class RailRideNodePointToData : public GameComponentEntityData
{
public:
    static __inline RailRideNodePointToData* DefaultInstance()
    {
        return (RailRideNodePointToData*) 0x00000000688AAED0;
    }
    static __inline unsigned int ClassId()
    {
        return 2463;
    }
    RailRideHeliPointToSide m_Side; //0x0080
    char _0x0084[12];
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02465
// RuntimeId: 09376
// TypeInfo:  0x000000014287EF20
#ifndef _RailRideHeliData_
#define _RailRideHeliData_
#pragma pack(push, 16)
class RailRideHeliData : public GameComponentEntityData
{
public:
    static __inline RailRideHeliData* DefaultInstance()
    {
        return (RailRideHeliData*) 0x00000000688AB0A0;
    }
    static __inline unsigned int ClassId()
    {
        return 2465;
    }
    LinearTransform m_RootTransform; //0x0080
    LinearTransform m_ReferenceTransform; //0x00C0
    LinearTransform m_BlendTransform; //0x0100
    Vec3 m_PointToOverride; //0x0140
    Float32 m_AngularApproachSlow; //0x0150
    Float32 m_AngularApproachFast; //0x0154
    Float32 m_TiltMax; //0x0158
    Float32 m_TiltAccelMult; //0x015C
    Float32 m_TiltSpeedMult; //0x0160
    Float32 m_VeerDurationMin; //0x0164
    Float32 m_VeerDurationMax; //0x0168
    Float32 m_VeerPositionOffsetMin; //0x016C
    Float32 m_VeerPositionOffsetMax; //0x0170
    Float32 m_VeerHeadingOffsetMin; //0x0174
    Float32 m_VeerHeadingOffsetMax; //0x0178
    Int32 m_SimulationStepsPerFrame; //0x017C
    Float32 m_SoundAccelToThrottleMult; //0x0180
    Float32 m_SoundSpeedToThrottleMult; //0x0184
    Float32 m_Blend; //0x0188
    Float32 m_SpeedMultiplier; //0x018C
    Boolean m_EnablePointToOverride; //0x0190
    Boolean m_UseSegmentExternalTime; //0x0191
    Boolean m_Braking; //0x0192
    Boolean m_TransformWaypoints; //0x0193
    Boolean m_ApplySpeedFix; //0x0194
    char _0x0195[11];
};//Size=0x01A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01336
// RuntimeId: 09374
// TypeInfo:  0x000000014287F100
#ifndef _RailRideHeliSegment_
#define _RailRideHeliSegment_
class RailRideHeliSegment : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1336;
    }
    char _0x0020[16];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00710
// RuntimeId: 09373
// TypeInfo:  0x000000014287F1A0
#ifndef _ServerRailRideHeliEntity_
#define _ServerRailRideHeliEntity_
class ServerRailRideHeliEntity : public ServerGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 710;
    }
    char _0x0060[1280];
};//Size=0x0560
#endif

////////////////////////////////////////
// ClassId:   00702
// RuntimeId: 09372
// TypeInfo:  0x000000014287F240
#ifndef _ClientRailRideHeliEntity_
#define _ClientRailRideHeliEntity_
class ClientRailRideHeliEntity : public ClientGameComponentEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 702;
    }
    char _0x0060[1216];
};//Size=0x0520
#endif

////////////////////////////////////////
// ClassId:   03776
// RuntimeId: 09371
// TypeInfo:  0x000000014287EBC0
#ifndef _OriginSettings_
#define _OriginSettings_
#pragma pack(push, 8)
class OriginSettings : public SystemSettings
{
public:
    static __inline OriginSettings* DefaultInstance()
    {
        return (OriginSettings*) 0x00000000688D5E00;
    }
    static __inline unsigned int ClassId()
    {
        return 3776;
    }
    CString m_ContentId; //0x0020
    CString m_Title; //0x0028
    CString m_MultiplayerId; //0x0030
    CString m_Language; //0x0038
    OriginTokenType m_TokenType; //0x0040
    char _0x0044[4];
    CString m_AuthCodeClientId; //0x0048
    Boolean m_Enabled; //0x0050
    Boolean m_Log; //0x0051
    Boolean m_AllowProductionEnvironment; //0x0052
    char _0x0053[5];
};//Size=0x0058
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00001
// RuntimeId: 09329
// TypeInfo:  0x000000014287D690
#ifndef _PresenceRequestParameters_
#define _PresenceRequestParameters_
class PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 1;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00012
// RuntimeId: 09364
// TypeInfo:  0x000000014287E140
#ifndef _PresenceGetNativeDataByInviteTokenRequestParameters_
#define _PresenceGetNativeDataByInviteTokenRequestParameters_
class PresenceGetNativeDataByInviteTokenRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 12;
    }
    char _0x0008[112];
};//Size=0x0078
#endif

////////////////////////////////////////
// ClassId:   00062
// RuntimeId: 09363
// TypeInfo:  0x000000014287E190
#ifndef _PresenceGetUserIdRequestParameters_
#define _PresenceGetUserIdRequestParameters_
class PresenceGetUserIdRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 62;
    }
    char _0x0008[56];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00016
// RuntimeId: 09362
// TypeInfo:  0x000000014287E1E0
#ifndef _PresenceSetPlaygroupMemberAttributesRequestParameters_
#define _PresenceSetPlaygroupMemberAttributesRequestParameters_
class PresenceSetPlaygroupMemberAttributesRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 16;
    }
    char _0x0008[56];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00048
// RuntimeId: 09361
// TypeInfo:  0x000000014287E230
#ifndef _PresenceLookupPlaygroupsByIdRequestParameters_
#define _PresenceLookupPlaygroupsByIdRequestParameters_
class PresenceLookupPlaygroupsByIdRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 48;
    }
    char _0x0008[40];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00061
// RuntimeId: 09360
// TypeInfo:  0x000000014287E280
#ifndef _PresenceViewInviteRequestParameters_
#define _PresenceViewInviteRequestParameters_
class PresenceViewInviteRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 61;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00013
// RuntimeId: 09359
// TypeInfo:  0x000000014287E2D0
#ifndef _PresenceKickFromPlaygroupRequestParameters_
#define _PresenceKickFromPlaygroupRequestParameters_
class PresenceKickFromPlaygroupRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 13;
    }
    char _0x0008[80];
};//Size=0x0058
#endif

////////////////////////////////////////
// ClassId:   00043
// RuntimeId: 09358
// TypeInfo:  0x000000014287E320
#ifndef _PresenceSendInviteRequestParameters_
#define _PresenceSendInviteRequestParameters_
class PresenceSendInviteRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 43;
    }
    char _0x0008[448];
};//Size=0x01C8
#endif

////////////////////////////////////////
// ClassId:   00060
// RuntimeId: 09357
// TypeInfo:  0x000000014287E370
#ifndef _PresenceJoinGameByOnlineNativeDataRequestParameters_
#define _PresenceJoinGameByOnlineNativeDataRequestParameters_
class PresenceJoinGameByOnlineNativeDataRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 60;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00023
// RuntimeId: 09356
// TypeInfo:  0x000000014287E3C0
#ifndef _PresenceGetLeaderboardRequestParameters_
#define _PresenceGetLeaderboardRequestParameters_
class PresenceGetLeaderboardRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 23;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00037
// RuntimeId: 09355
// TypeInfo:  0x000000014287E410
#ifndef _PresenceDownloadStatisticsRequestParameters_
#define _PresenceDownloadStatisticsRequestParameters_
class PresenceDownloadStatisticsRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 37;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00005
// RuntimeId: 09354
// TypeInfo:  0x000000014287E460
#ifndef _PresenceSetPlaygroupJoinabilityRequestParameters_
#define _PresenceSetPlaygroupJoinabilityRequestParameters_
class PresenceSetPlaygroupJoinabilityRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 5;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00030
// RuntimeId: 09353
// TypeInfo:  0x000000014287E4B0
#ifndef _PresenceSetPlaygroupAttributeRequestParameters_
#define _PresenceSetPlaygroupAttributeRequestParameters_
class PresenceSetPlaygroupAttributeRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 30;
    }
    char _0x0008[72];
};//Size=0x0050
#endif

////////////////////////////////////////
// ClassId:   00066
// RuntimeId: 09352
// TypeInfo:  0x000000014287E500
#ifndef _PresenceDisbandPlaygroupRequestParameters_
#define _PresenceDisbandPlaygroupRequestParameters_
class PresenceDisbandPlaygroupRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 66;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00058
// RuntimeId: 09351
// TypeInfo:  0x000000014287E550
#ifndef _PresenceLeavePlaygroupRequestParameters_
#define _PresenceLeavePlaygroupRequestParameters_
class PresenceLeavePlaygroupRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 58;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00049
// RuntimeId: 09350
// TypeInfo:  0x000000014287E5A0
#ifndef _PresenceJoinPlaygroupByInviteTokenRequestParameters_
#define _PresenceJoinPlaygroupByInviteTokenRequestParameters_
class PresenceJoinPlaygroupByInviteTokenRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 49;
    }
    char _0x0008[104];
};//Size=0x0070
#endif

////////////////////////////////////////
// ClassId:   00059
// RuntimeId: 09349
// TypeInfo:  0x000000014287E5F0
#ifndef _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
#define _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
class PresenceJoinPlaygroupByOnlineNativeDataRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 59;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00004
// RuntimeId: 09348
// TypeInfo:  0x000000014287E640
#ifndef _PresenceJoinPlaygroupByUsernameRequestParameters_
#define _PresenceJoinPlaygroupByUsernameRequestParameters_
class PresenceJoinPlaygroupByUsernameRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 4;
    }
    char _0x0008[40];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00052
// RuntimeId: 09347
// TypeInfo:  0x000000014287E690
#ifndef _PresenceJoinPlaygroupRequestParameters_
#define _PresenceJoinPlaygroupRequestParameters_
class PresenceJoinPlaygroupRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 52;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00032
// RuntimeId: 09346
// TypeInfo:  0x000000014287E6E0
#ifndef _PresenceCreatePlaygroupRequestParameters_
#define _PresenceCreatePlaygroupRequestParameters_
class PresenceCreatePlaygroupRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 32;
    }
    char _0x0008[64];
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00051
// RuntimeId: 09345
// TypeInfo:  0x000000014287E730
#ifndef _PresenceHttpPostRequestParameters_
#define _PresenceHttpPostRequestParameters_
class PresenceHttpPostRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 51;
    }
    char _0x0008[40];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00027
// RuntimeId: 09344
// TypeInfo:  0x000000014287E780
#ifndef _PresenceHttpGetRequestParameters_
#define _PresenceHttpGetRequestParameters_
class PresenceHttpGetRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 27;
    }
    char _0x0008[40];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00014
// RuntimeId: 09343
// TypeInfo:  0x000000014287E7D0
#ifndef _PresenceGetBlockListRequestParameters_
#define _PresenceGetBlockListRequestParameters_
class PresenceGetBlockListRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 14;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00002
// RuntimeId: 09342
// TypeInfo:  0x000000014287E820
#ifndef _PresenceRemoveFriendRequestParameters_
#define _PresenceRemoveFriendRequestParameters_
class PresenceRemoveFriendRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 2;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00050
// RuntimeId: 09341
// TypeInfo:  0x000000014287E870
#ifndef _PresenceInviteFriendRequestParameters_
#define _PresenceInviteFriendRequestParameters_
class PresenceInviteFriendRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 50;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00008
// RuntimeId: 09340
// TypeInfo:  0x000000014287E8C0
#ifndef _PresenceDownloadBlobRequestParameters_
#define _PresenceDownloadBlobRequestParameters_
class PresenceDownloadBlobRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 8;
    }
    char _0x0008[24];
};//Size=0x0020
#endif

////////////////////////////////////////
// ClassId:   00028
// RuntimeId: 09339
// TypeInfo:  0x000000014287E910
#ifndef _PresenceUpdateAchievementsRequestParameters_
#define _PresenceUpdateAchievementsRequestParameters_
class PresenceUpdateAchievementsRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 28;
    }
    char _0x0008[48];
};//Size=0x0038
#endif

////////////////////////////////////////
// ClassId:   00009
// RuntimeId: 09338
// TypeInfo:  0x000000014287E960
#ifndef _PresenceUnlockAchievementsRequestParameters_
#define _PresenceUnlockAchievementsRequestParameters_
class PresenceUnlockAchievementsRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 9;
    }
    char _0x0008[32];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00069
// RuntimeId: 09328
// TypeInfo:  0x000000014287D6E0
#ifndef _PresenceEvent_
#define _PresenceEvent_
class PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 69;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00071
// RuntimeId: 09336
// TypeInfo:  0x000000014287E9B0
#ifndef _OnlineStatusEvent_
#define _OnlineStatusEvent_
class OnlineStatusEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 71;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00070
// RuntimeId: 09335
// TypeInfo:  0x000000014287DF60
#ifndef _FirstPartyNetworkStatusEvent_
#define _FirstPartyNetworkStatusEvent_
class FirstPartyNetworkStatusEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 70;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00075
// RuntimeId: 09334
// TypeInfo:  0x000000014287EA00
#ifndef _ActiveControllerUpdatedEvent_
#define _ActiveControllerUpdatedEvent_
class ActiveControllerUpdatedEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 75;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00076
// RuntimeId: 09333
// TypeInfo:  0x000000014287DFB0
#ifndef _PlaygroupUpdatedEvent_
#define _PlaygroupUpdatedEvent_
class PlaygroupUpdatedEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 76;
    }
    char _0x0008[56];
};//Size=0x0040
#endif

////////////////////////////////////////
// ClassId:   00072
// RuntimeId: 09332
// TypeInfo:  0x000000014287E000
#ifndef _FriendUpdatedEvent_
#define _FriendUpdatedEvent_
class FriendUpdatedEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 72;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00078
// RuntimeId: 09127
// TypeInfo:  0x000000014287A400
#ifndef _PresenceBackend_
#define _PresenceBackend_
class PresenceBackend
{
public:
    static __inline unsigned int ClassId()
    {
        return 78;
    }
    char _0x0000[32];
};//Size=0x0020
#endif

////////////////////////////////////////
// ClassId:   00080
// RuntimeId: 09330
// TypeInfo:  0x000000014287E0A0
#ifndef _BlazePresenceBackend_
#define _BlazePresenceBackend_
class BlazePresenceBackend : public PresenceBackend
{
public:
    static __inline unsigned int ClassId()
    {
        return 80;
    }
    char _0x0020[168];
};//Size=0x00C8
#endif

////////////////////////////////////////
// ClassId:   00068
// RuntimeId: 09365
// TypeInfo:  0x000000014287E0F0
#ifndef _PresenceDownloadUpdateRequestParameters_
#define _PresenceDownloadUpdateRequestParameters_
class PresenceDownloadUpdateRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 68;
    }
    char _0x0008[16];
};//Size=0x0018
#endif

////////////////////////////////////////
// ClassId:   00077
// RuntimeId: 09337
// TypeInfo:  0x000000014287DF10
#ifndef _BlockListEvent_
#define _BlockListEvent_
class BlockListEvent : public PresenceEvent
{
public:
    static __inline unsigned int ClassId()
    {
        return 77;
    }
    char _0x0008[12952];
};//Size=0x32A0
#endif

////////////////////////////////////////
// ClassId:   03787
// RuntimeId: 09327
// TypeInfo:  0x000000014287CA80
#ifndef _OnlineSettings_
#define _OnlineSettings_
#pragma pack(push, 8)
class OnlineSettings : public SystemSettings
{
public:
    static __inline OnlineSettings* DefaultInstance()
    {
        return (OnlineSettings*) 0x00000000688D6750;
    }
    static __inline unsigned int ClassId()
    {
        return 3787;
    }
    BackendType m_Backend; //0x0020
    BackendType m_PeerBackend; //0x0024
    OnlineEnvironment m_Environment; //0x0028
    char _0x002C[4];
    OnlineProviderAsset* m_Provider; //0x0030
    Array<OnlinePlatformConfiguration> m_Platforms; //0x0038
    CString m_ServiceNameOverride; //0x0040
    Int32 m_BlazeLogLevel; //0x0048
    Int32 m_DirtySockLogLevel; //0x004C
    RichPresenceData* m_RichPresence; //0x0050
    LicenseConfiguration* m_LicenseConfig; //0x0058
    CString m_MatchmakingOptions; //0x0060
    CString m_MatchmakingMode; //0x0068
    CString m_Region; //0x0070
    CString m_Country; //0x0078
    CString m_PingSite; //0x0080
    CString m_MatchmakingToken; //0x0088
    Uint32 m_NegativeUserCacheRefreshPeriod; //0x0090
    char _0x0094[4];
    CString m_ServerLoginEmail; //0x0098
    CString m_ServerLoginPassword; //0x00A0
    CString m_ServerLoginPersonaName; //0x00A8
    Int32 m_BlazeServerConnectionTimeout; //0x00B0
    Int32 m_BlazeServerTimeout; //0x00B4
    Int32 m_BlazeClientConnectionTimeout; //0x00B8
    Int32 m_BlazeClientTimeout; //0x00BC
    Int32 m_DirtySockServerPacketQueueCapacity; //0x00C0
    Boolean m_ClientIsPresenceEnabled; //0x00C4
    Boolean m_ServerIsPresenceEnabled; //0x00C5
    Boolean m_UseExternalLoginFlow; //0x00C6
    Boolean m_IsSecure; //0x00C7
    Boolean m_EnableQoS; //0x00C8
    Boolean m_MatchmakeImmediately; //0x00C9
    Boolean m_ServerIsReconfigurable; //0x00CA
    Boolean m_SupportHostMigration; //0x00CB
    Boolean m_ServerAllowAnyReputation; //0x00CC
    char _0x00CD[3];
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01938
// RuntimeId: 09323
// TypeInfo:  0x000000014287CAE0
#ifndef _OnlineServicesAsset_
#define _OnlineServicesAsset_
#pragma pack(push, 8)
class OnlineServicesAsset : public Asset
{
public:
    static __inline OnlineServicesAsset* DefaultInstance()
    {
        return (OnlineServicesAsset*) 0x000000006889C460;
    }
    static __inline unsigned int ClassId()
    {
        return 1938;
    }
    Array<PresenceServiceData*> m_OnlineServices; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01608
// RuntimeId: 09307
// TypeInfo:  0x000000014287CDE0
#ifndef _PresenceServiceData_
#define _PresenceServiceData_
#pragma pack(push, 8)
class PresenceServiceData : public Asset
{
public:
    static __inline PresenceServiceData* DefaultInstance()
    {
        return (PresenceServiceData*) 0x0000000068894C50;
    }
    static __inline unsigned int ClassId()
    {
        return 1608;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01629
// RuntimeId: 09319
// TypeInfo:  0x000000014287CBA0
#ifndef _PresenceUserIdServiceData_
#define _PresenceUserIdServiceData_
#pragma pack(push, 8)
class PresenceUserIdServiceData : public PresenceServiceData
{
public:
    static __inline PresenceUserIdServiceData* DefaultInstance()
    {
        return (PresenceUserIdServiceData*) 0x00000000688950F0;
    }
    static __inline unsigned int ClassId()
    {
        return 1629;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01625
// RuntimeId: 09317
// TypeInfo:  0x000000014287CC00
#ifndef _PresenceStatisticsServiceData_
#define _PresenceStatisticsServiceData_
#pragma pack(push, 8)
class PresenceStatisticsServiceData : public PresenceServiceData
{
public:
    static __inline PresenceStatisticsServiceData* DefaultInstance()
    {
        return (PresenceStatisticsServiceData*) 0x0000000068894F90;
    }
    static __inline unsigned int ClassId()
    {
        return 1625;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01609
// RuntimeId: 09315
// TypeInfo:  0x000000014287CC60
#ifndef _PresencePlaygroupServiceData_
#define _PresencePlaygroupServiceData_
#pragma pack(push, 8)
class PresencePlaygroupServiceData : public PresenceServiceData
{
public:
    static __inline PresencePlaygroupServiceData* DefaultInstance()
    {
        return (PresencePlaygroupServiceData*) 0x0000000068894C80;
    }
    static __inline unsigned int ClassId()
    {
        return 1609;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01631
// RuntimeId: 09313
// TypeInfo:  0x000000014287CCC0
#ifndef _PresenceLeaderboardServiceData_
#define _PresenceLeaderboardServiceData_
#pragma pack(push, 8)
class PresenceLeaderboardServiceData : public PresenceServiceData
{
public:
    static __inline PresenceLeaderboardServiceData* DefaultInstance()
    {
        return (PresenceLeaderboardServiceData*) 0x0000000068895150;
    }
    static __inline unsigned int ClassId()
    {
        return 1631;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01622
// RuntimeId: 09311
// TypeInfo:  0x000000014287CD20
#ifndef _PresenceFriendsServiceData_
#define _PresenceFriendsServiceData_
#pragma pack(push, 8)
class PresenceFriendsServiceData : public PresenceServiceData
{
public:
    static __inline PresenceFriendsServiceData* DefaultInstance()
    {
        return (PresenceFriendsServiceData*) 0x0000000068894F00;
    }
    static __inline unsigned int ClassId()
    {
        return 1622;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01616
// RuntimeId: 09309
// TypeInfo:  0x000000014287CD80
#ifndef _PresenceAchievementServiceData_
#define _PresenceAchievementServiceData_
#pragma pack(push, 8)
class PresenceAchievementServiceData : public PresenceServiceData
{
public:
    static __inline PresenceAchievementServiceData* DefaultInstance()
    {
        return (PresenceAchievementServiceData*) 0x0000000068894DE0;
    }
    static __inline unsigned int ClassId()
    {
        return 1616;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01619
// RuntimeId: 09321
// TypeInfo:  0x000000014287CB40
#ifndef _PresencePrivilegeServiceData_
#define _PresencePrivilegeServiceData_
#pragma pack(push, 8)
class PresencePrivilegeServiceData : public PresenceServiceData
{
public:
    static __inline PresencePrivilegeServiceData* DefaultInstance()
    {
        return (PresencePrivilegeServiceData*) 0x0000000068894E70;
    }
    static __inline unsigned int ClassId()
    {
        return 1619;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01508
// RuntimeId: 09305
// TypeInfo:  0x000000014287CE40
#ifndef _OnlineProviderAsset_
#define _OnlineProviderAsset_
#pragma pack(push, 8)
class OnlineProviderAsset : public Asset
{
public:
    static __inline OnlineProviderAsset* DefaultInstance()
    {
        return (OnlineProviderAsset*) 0x0000000068892A80;
    }
    static __inline unsigned int ClassId()
    {
        return 1508;
    }
    Array<OnlineProviderConfiguration> m_Configurations; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03196
// RuntimeId: 09299
// TypeInfo:  0x000000014287CEA0
#ifndef _OnlineRichPresenceLevelDescriptionComponent_
#define _OnlineRichPresenceLevelDescriptionComponent_
#pragma pack(push, 8)
class OnlineRichPresenceLevelDescriptionComponent : public LevelDescriptionComponent
{
public:
    static __inline OnlineRichPresenceLevelDescriptionComponent* DefaultInstance()
    {
        return (OnlineRichPresenceLevelDescriptionComponent*) 0x00000000688C92B0;
    }
    static __inline unsigned int ClassId()
    {
        return 3196;
    }
    RichPresencePresenceString* m_PresenceMode; //0x0010
    Array<RichPresenceContextSetting> m_ContextValues; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01921
// RuntimeId: 09279
// TypeInfo:  0x000000014287D020
#ifndef _ServerBackendData_
#define _ServerBackendData_
#pragma pack(push, 8)
class ServerBackendData : public Asset
{
public:
    static __inline ServerBackendData* DefaultInstance()
    {
        return (ServerBackendData*) 0x000000006889BC30;
    }
    static __inline unsigned int ClassId()
    {
        return 1921;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01924
// RuntimeId: 09283
// TypeInfo:  0x000000014287CF60
#ifndef _LanServerBackendData_
#define _LanServerBackendData_
#pragma pack(push, 8)
class LanServerBackendData : public ServerBackendData
{
public:
    static __inline LanServerBackendData* DefaultInstance()
    {
        return (LanServerBackendData*) 0x000000006889BCC0;
    }
    static __inline unsigned int ClassId()
    {
        return 1924;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01922
// RuntimeId: 09281
// TypeInfo:  0x000000014287CFC0
#ifndef _LocalServerBackendData_
#define _LocalServerBackendData_
#pragma pack(push, 8)
class LocalServerBackendData : public ServerBackendData
{
public:
    static __inline LocalServerBackendData* DefaultInstance()
    {
        return (LocalServerBackendData*) 0x000000006889BC60;
    }
    static __inline unsigned int ClassId()
    {
        return 1922;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01926
// RuntimeId: 09287
// TypeInfo:  0x000000014287CF00
#ifndef _BlazeServerBackendData_
#define _BlazeServerBackendData_
#pragma pack(push, 8)
class BlazeServerBackendData : public ServerBackendData
{
public:
    static __inline BlazeServerBackendData* DefaultInstance()
    {
        return (BlazeServerBackendData*) 0x000000006889BD30;
    }
    static __inline unsigned int ClassId()
    {
        return 1926;
    }
    BlazeCreateGameParameters m_CreateParameters; //0x0018
    OnlineEnvironmentConsoleUrl m_ConfigUrl; //0x0020
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01574
// RuntimeId: 09245
// TypeInfo:  0x000000014287D380
#ifndef _PresenceBackendData_
#define _PresenceBackendData_
#pragma pack(push, 8)
class PresenceBackendData : public Asset
{
public:
    static __inline PresenceBackendData* DefaultInstance()
    {
        return (PresenceBackendData*) 0x00000000688941B0;
    }
    static __inline unsigned int ClassId()
    {
        return 1574;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01583
// RuntimeId: 09275
// TypeInfo:  0x000000014287D0E0
#ifndef _Ps4PresenceBackendData_
#define _Ps4PresenceBackendData_
#pragma pack(push, 8)
class Ps4PresenceBackendData : public PresenceBackendData
{
public:
    static __inline Ps4PresenceBackendData* DefaultInstance()
    {
        return (Ps4PresenceBackendData*) 0x00000000688943D0;
    }
    static __inline unsigned int ClassId()
    {
        return 1583;
    }
    Ps4TitleData m_DefaultTitleData; //0x0018
    Array<Ps4TitleData> m_TitleData; //0x0028
    Ps4AgeSettings m_AgeSettings; //0x0030
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01584
// RuntimeId: 09267
// TypeInfo:  0x000000014287D140
#ifndef _XenonPresenceBackendData_
#define _XenonPresenceBackendData_
#pragma pack(push, 8)
class XenonPresenceBackendData : public PresenceBackendData
{
public:
    static __inline XenonPresenceBackendData* DefaultInstance()
    {
        return (XenonPresenceBackendData*) 0x0000000068894430;
    }
    static __inline unsigned int ClassId()
    {
        return 1584;
    }
    Uint32 m_TitleId; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01581
// RuntimeId: 09265
// TypeInfo:  0x000000014287D1A0
#ifndef _Ps3PresenceBackendData_
#define _Ps3PresenceBackendData_
#pragma pack(push, 8)
class Ps3PresenceBackendData : public PresenceBackendData
{
public:
    static __inline Ps3PresenceBackendData* DefaultInstance()
    {
        return (Ps3PresenceBackendData*) 0x0000000068894330;
    }
    static __inline unsigned int ClassId()
    {
        return 1581;
    }
    CString m_CommunicationId; //0x0018
    CString m_CommunicationSignature; //0x0020
    Array<Ps3ParentalLockAgeSettings> m_ParentalLockAgeSettings; //0x0028
    Array<Ps3ServiceSettings> m_ServiceSettings; //0x0030
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03629
// RuntimeId: 09257
// TypeInfo:  0x000000014287D200
#ifndef _Ps3ParentalLockAgeSettingsOverrides_
#define _Ps3ParentalLockAgeSettingsOverrides_
#pragma pack(push, 8)
class Ps3ParentalLockAgeSettingsOverrides : public DataContainer
{
public:
    static __inline Ps3ParentalLockAgeSettingsOverrides* DefaultInstance()
    {
        return (Ps3ParentalLockAgeSettingsOverrides*) 0x00000000688D3180;
    }
    static __inline unsigned int ClassId()
    {
        return 3629;
    }
    Array<Ps3ParentalLockAgeSettingsForCountry> m_Overrides; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01578
// RuntimeId: 09251
// TypeInfo:  0x000000014287D260
#ifndef _LanPresenceBackendData_
#define _LanPresenceBackendData_
#pragma pack(push, 8)
class LanPresenceBackendData : public PresenceBackendData
{
public:
    static __inline LanPresenceBackendData* DefaultInstance()
    {
        return (LanPresenceBackendData*) 0x0000000068894290;
    }
    static __inline unsigned int ClassId()
    {
        return 1578;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01577
// RuntimeId: 09249
// TypeInfo:  0x000000014287D2C0
#ifndef _DirtySockPresenceBackendData_
#define _DirtySockPresenceBackendData_
#pragma pack(push, 8)
class DirtySockPresenceBackendData : public PresenceBackendData
{
public:
    static __inline DirtySockPresenceBackendData* DefaultInstance()
    {
        return (DirtySockPresenceBackendData*) 0x0000000068894260;
    }
    static __inline unsigned int ClassId()
    {
        return 1577;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01582
// RuntimeId: 09247
// TypeInfo:  0x000000014287D320
#ifndef _BlazePresenceBackendData_
#define _BlazePresenceBackendData_
#pragma pack(push, 8)
class BlazePresenceBackendData : public PresenceBackendData
{
public:
    static __inline BlazePresenceBackendData* DefaultInstance()
    {
        return (BlazePresenceBackendData*) 0x0000000068894380;
    }
    static __inline unsigned int ClassId()
    {
        return 1582;
    }
    CString m_DefaultRoleName; //0x0018
    Array<MatchmakingSession*> m_MatchmakingSessions; //0x0020
    Boolean m_UseDemanglerService; //0x0028
    char _0x0029[7];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01579
// RuntimeId: 09277
// TypeInfo:  0x000000014287D080
#ifndef _DurangoPresenceBackendData_
#define _DurangoPresenceBackendData_
#pragma pack(push, 8)
class DurangoPresenceBackendData : public PresenceBackendData
{
public:
    static __inline DurangoPresenceBackendData* DefaultInstance()
    {
        return (DurangoPresenceBackendData*) 0x00000000688942C0;
    }
    static __inline unsigned int ClassId()
    {
        return 1579;
    }
    Uint32 m_TitleId; //0x0018
    char _0x001C[4];
    CString m_ServiceConfigId; //0x0020
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03483
// RuntimeId: 09243
// TypeInfo:  0x000000014287D3E0
#ifndef _MatchmakingSession_
#define _MatchmakingSession_
#pragma pack(push, 8)
class MatchmakingSession : public DataContainer
{
public:
    static __inline MatchmakingSession* DefaultInstance()
    {
        return (MatchmakingSession*) 0x00000000688CFED0;
    }
    static __inline unsigned int ClassId()
    {
        return 3483;
    }
    MatchmakingSessionMode m_Mode; //0x0010
    Uint32 m_DurationMs; //0x0014
    MatchmakingCriteria m_Criteria; //0x0018
    GameParametersData* m_CreateGameParams; //0x0088
    MatchmakingSession* m_OnNotFound; //0x0090
    Array<MatchmakingModifier*> m_Modifiers; //0x0098
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03486
// RuntimeId: 09239
// TypeInfo:  0x000000014287D4A0
#ifndef _MatchmakingModifier_
#define _MatchmakingModifier_
#pragma pack(push, 8)
class MatchmakingModifier : public DataContainer
{
public:
    static __inline MatchmakingModifier* DefaultInstance()
    {
        return (MatchmakingModifier*) 0x00000000688D0020;
    }
    static __inline unsigned int ClassId()
    {
        return 3486;
    }
};//Size=0x0010
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03487
// RuntimeId: 09241
// TypeInfo:  0x000000014287D440
#ifndef _MatchmakingPlayerCapacityModifier_
#define _MatchmakingPlayerCapacityModifier_
#pragma pack(push, 8)
class MatchmakingPlayerCapacityModifier : public MatchmakingModifier
{
public:
    static __inline MatchmakingPlayerCapacityModifier* DefaultInstance()
    {
        return (MatchmakingPlayerCapacityModifier*) 0x00000000688D0050;
    }
    static __inline unsigned int ClassId()
    {
        return 3487;
    }
    CString m_Attribute; //0x0010
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01761
// RuntimeId: 09177
// TypeInfo:  0x000000014287D500
#ifndef _LicenseConfiguration_
#define _LicenseConfiguration_
#pragma pack(push, 8)
class LicenseConfiguration : public Asset
{
public:
    static __inline LicenseConfiguration* DefaultInstance()
    {
        return (LicenseConfiguration*) 0x0000000068897E50;
    }
    static __inline unsigned int ClassId()
    {
        return 1761;
    }
    Array<LicenseInfo> m_Licenses; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01960
// RuntimeId: 09169
// TypeInfo:  0x000000014287D560
#ifndef _GameParametersData_
#define _GameParametersData_
#pragma pack(push, 8)
class GameParametersData : public Asset
{
public:
    static __inline GameParametersData* DefaultInstance()
    {
        return (GameParametersData*) 0x000000006889CB70;
    }
    static __inline unsigned int ClassId()
    {
        return 1960;
    }
    CString m_ServerName; //0x0018
    PersistenceGameType m_GameType; //0x0020
    Uint32 m_QueueCapacity; //0x0024
    Uint32 m_Mod; //0x0028
    Uint32 m_MaxSpectators; //0x002C
    GameNetworkTopology m_GameTopology; //0x0030
    GamePeer2PeerMode m_PeerMode; //0x0034
    GameNetworkTopology m_VoipTopology; //0x0038
    char _0x003C[4];
    Array<GameAttributeData> m_Attributes; //0x0040
    Array<GameRoleInformation*> m_RoleConfiguration; //0x0048
    Boolean m_OpenToInvites; //0x0050
    Boolean m_OpenToMatchmaking; //0x0051
    Boolean m_OpenToJoinByPlayer; //0x0052
    Boolean m_OpenToBrowsing; //0x0053
    Boolean m_Ranked; //0x0054
    Boolean m_JoinInProgressSupported; //0x0055
    char _0x0056[2];
};//Size=0x0058
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03506
// RuntimeId: 09167
// TypeInfo:  0x000000014287D5C0
#ifndef _GameRoleInformation_
#define _GameRoleInformation_
#pragma pack(push, 8)
class GameRoleInformation : public DataContainer
{
public:
    static __inline GameRoleInformation* DefaultInstance()
    {
        return (GameRoleInformation*) 0x00000000688D0570;
    }
    static __inline unsigned int ClassId()
    {
        return 3506;
    }
    CString m_RoleName; //0x0010
    Uint32 m_Capacity; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00079
// RuntimeId: 09331
// TypeInfo:  0x000000014287E050
#ifndef _DirtySockPresenceBackend_
#define _DirtySockPresenceBackend_
class DirtySockPresenceBackend : public PresenceBackend
{
public:
    static __inline unsigned int ClassId()
    {
        return 79;
    }
    char _0x0020[128];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   00085
// RuntimeId: 09126
// TypeInfo:  0x000000014287A3B0
#ifndef _GameParameters_
#define _GameParameters_
class GameParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 85;
    }
    char _0x0000[960];
};//Size=0x03C0
#endif

////////////////////////////////////////
// ClassId:   01630
// RuntimeId: 09125
// TypeInfo:  0x0000000142879650
#ifndef _NickelServiceData_
#define _NickelServiceData_
#pragma pack(push, 8)
class NickelServiceData : public PresenceServiceData
{
public:
    static __inline NickelServiceData* DefaultInstance()
    {
        return (NickelServiceData*) 0x0000000068895120;
    }
    static __inline unsigned int ClassId()
    {
        return 1630;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01580
// RuntimeId: 09121
// TypeInfo:  0x00000001428796B0
#ifndef _NickelPresenceBackendData_
#define _NickelPresenceBackendData_
#pragma pack(push, 8)
class NickelPresenceBackendData : public PresenceBackendData
{
public:
    static __inline NickelPresenceBackendData* DefaultInstance()
    {
        return (NickelPresenceBackendData*) 0x0000000068894300;
    }
    static __inline unsigned int ClassId()
    {
        return 1580;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00047
// RuntimeId: 09119
// TypeInfo:  0x0000000142879710
#ifndef _PresenceOfferPlayStationPlusRequestParameters_
#define _PresenceOfferPlayStationPlusRequestParameters_
class PresenceOfferPlayStationPlusRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 47;
    }
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00038
// RuntimeId: 09118
// TypeInfo:  0x0000000142879760
#ifndef _PresenceRedeemCodeRequestParameters_
#define _PresenceRedeemCodeRequestParameters_
class PresenceRedeemCodeRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 38;
    }
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00007
// RuntimeId: 09117
// TypeInfo:  0x00000001428797B0
#ifndef _PresenceConsumeRequestParameters_
#define _PresenceConsumeRequestParameters_
class PresenceConsumeRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 7;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00039
// RuntimeId: 09116
// TypeInfo:  0x0000000142879800
#ifndef _PresenceCheckoutRequestParameters_
#define _PresenceCheckoutRequestParameters_
class PresenceCheckoutRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 39;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00036
// RuntimeId: 09115
// TypeInfo:  0x0000000142879850
#ifndef _PresenceGetDetailedDescriptionRequestParameters_
#define _PresenceGetDetailedDescriptionRequestParameters_
class PresenceGetDetailedDescriptionRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 36;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00044
// RuntimeId: 09114
// TypeInfo:  0x00000001428798A0
#ifndef _PresenceGetBasicDescriptionRequestParameters_
#define _PresenceGetBasicDescriptionRequestParameters_
class PresenceGetBasicDescriptionRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 44;
    }
    char _0x0008[8];
};//Size=0x0010
#endif

////////////////////////////////////////
// ClassId:   00033
// RuntimeId: 09113
// TypeInfo:  0x00000001428798F0
#ifndef _PresenceLoadConfigurationFileRequestParameters_
#define _PresenceLoadConfigurationFileRequestParameters_
class PresenceLoadConfigurationFileRequestParameters : public PresenceRequestParameters
{
public:
    static __inline unsigned int ClassId()
    {
        return 33;
    }
    char _0x0008[32];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00084
// RuntimeId: 09112
// TypeInfo:  0x0000000142879600
#ifndef _NickelPresenceBackend_
#define _NickelPresenceBackend_
class NickelPresenceBackend : public PresenceBackend
{
public:
    static __inline unsigned int ClassId()
    {
        return 84;
    }
    char _0x0020[416];
};//Size=0x01C0
#endif

////////////////////////////////////////
// ClassId:   01164
// RuntimeId: 09111
// TypeInfo:  0x00000001428791A0
#ifndef _LuaRunnerSharedVarsEntity_
#define _LuaRunnerSharedVarsEntity_
class LuaRunnerSharedVarsEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1164;
    }
    char _0x0020[160];
};//Size=0x00C0
#endif

////////////////////////////////////////
// ClassId:   00900
// RuntimeId: 09110
// TypeInfo:  0x0000000142879240
#ifndef _LuaRunnerScriptEntity_
#define _LuaRunnerScriptEntity_
class LuaRunnerScriptEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 900;
    }
    char _0x0020[11392];
};//Size=0x2CA0
#endif

////////////////////////////////////////
// ClassId:   00087
// RuntimeId: 09109
// TypeInfo:  0x0000000142879150
#ifndef _CompiledLuaResource_
#define _CompiledLuaResource_
class CompiledLuaResource
{
public:
    static __inline unsigned int ClassId()
    {
        return 87;
    }
    char _0x0000[88];
};//Size=0x0058
#endif

////////////////////////////////////////
// ClassId:   02868
// RuntimeId: 09108
// TypeInfo:  0x0000000142878F80
#ifndef _LuaRunnerSharedVarsEntityData_
#define _LuaRunnerSharedVarsEntityData_
#pragma pack(push, 8)
class LuaRunnerSharedVarsEntityData : public EntityData
{
public:
    static __inline LuaRunnerSharedVarsEntityData* DefaultInstance()
    {
        return (LuaRunnerSharedVarsEntityData*) 0x00000000688BAF40;
    }
    static __inline unsigned int ClassId()
    {
        return 2868;
    }
    Realm m_Realm; //0x0018
    Boolean m_AddToDebugDisplay; //0x001C
    char _0x001D[3];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02237
// RuntimeId: 09106
// TypeInfo:  0x0000000142878FE0
#ifndef _LuaRunnerScriptEntityData_
#define _LuaRunnerScriptEntityData_
#pragma pack(push, 8)
class LuaRunnerScriptEntityData : public EntityData
{
public:
    static __inline LuaRunnerScriptEntityData* DefaultInstance()
    {
        return (LuaRunnerScriptEntityData*) 0x00000000688A30D0;
    }
    static __inline unsigned int ClassId()
    {
        return 2237;
    }
    CString m_Script; //0x0018
    Array<CString> m_InputEvents; //0x0020
    Array<CString> m_OutputEvents; //0x0028
    Array<CString> m_InputFloatProperties; //0x0030
    Array<CString> m_OutputFloatProperties; //0x0038
    Array<CString> m_InputIntProperties; //0x0040
    Array<CString> m_OutputIntProperties; //0x0048
    Array<CString> m_InputBoolProperties; //0x0050
    Array<CString> m_OutputBoolProperties; //0x0058
    Array<CString> m_InputStringProperties; //0x0060
    Array<CString> m_OutputStringProperties; //0x0068
    Array<CString> m_InputTransformProperties; //0x0070
    Array<CString> m_OutputTransformProperties; //0x0078
    Array<CString> m_InputVec3Properties; //0x0080
    Array<CString> m_OutputVec3Properties; //0x0088
    ExecuteOnPropertyChangeType m_ExecuteOnPropertyChange; //0x0090
    Int32 m_PriorityForExecutingPerFrame; //0x0094
    Realm m_Realm; //0x0098
    char _0x009C[4];
    LuaRunnerCompiledLua* m_CompiledLua; //0x00A0
    Boolean m_AutoStartExecutingPerFrame; //0x00A8
    Boolean m_AutoStartForInitialization; //0x00A9
    Boolean m_RunOnPropertyChange; //0x00AA
    Boolean m_AddToDebugDisplay; //0x00AB
    char _0x00AC[4];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01562
// RuntimeId: 09102
// TypeInfo:  0x0000000142879040
#ifndef _LuaRunnerCompiledLua_
#define _LuaRunnerCompiledLua_
#pragma pack(push, 8)
class LuaRunnerCompiledLua : public Asset
{
public:
    static __inline LuaRunnerCompiledLua* DefaultInstance()
    {
        return (LuaRunnerCompiledLua*) 0x0000000068893DF0;
    }
    static __inline unsigned int ClassId()
    {
        return 1562;
    }
    ResourceRef m_CompiledLuaResource; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01515
// RuntimeId: 08704
// TypeInfo:  0x0000000142873C30
#ifndef _UITextDatabase_
#define _UITextDatabase_
#pragma pack(push, 8)
class UITextDatabase : public Asset
{
public:
    static __inline UITextDatabase* DefaultInstance()
    {
        return (UITextDatabase*) 0x0000000068892C60;
    }
    static __inline unsigned int ClassId()
    {
        return 1515;
    }
    LanguageFormat m_Language; //0x0018
    Guid m_BinaryChunk; //0x001C
    Uint32 m_BinaryChunkSize; //0x002C
    Guid m_HistogramChunk; //0x0030
    Uint32 m_HistogramChunkSize; //0x0040
    char _0x0044[4];
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01523
// RuntimeId: 08706
// TypeInfo:  0x0000000142873BD0
#ifndef _LocalizationAsset_
#define _LocalizationAsset_
#pragma pack(push, 8)
class LocalizationAsset : public Asset
{
public:
    static __inline LocalizationAsset* DefaultInstance()
    {
        return (LocalizationAsset*) 0x0000000068892F70;
    }
    static __inline unsigned int ClassId()
    {
        return 1523;
    }
    Array<UITextDatabase*> m_LocalizedTexts; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00599
// RuntimeId: 09096
// TypeInfo:  0x00000001428789F0
#ifndef _GroundHeightEntity_
#define _GroundHeightEntity_
class GroundHeightEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 599;
    }
    char _0x0020[8240];
};//Size=0x2050
#endif

////////////////////////////////////////
// ClassId:   01163
// RuntimeId: 09095
// TypeInfo:  0x0000000142878A90
#ifndef _DynamicEnvmapEntity_
#define _DynamicEnvmapEntity_
class DynamicEnvmapEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1163;
    }
    char _0x0020[96];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00632
// RuntimeId: 09094
// TypeInfo:  0x0000000142878B30
#ifndef _DynamicEnlightenEntity_
#define _DynamicEnlightenEntity_
class DynamicEnlightenEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 632;
    }
    char _0x0020[128];
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   00093
// RuntimeId: 08941
// TypeInfo:  0x00000001428749F0
#ifndef _MeshEntityBase_
#define _MeshEntityBase_
class MeshEntityBase
{
public:
    static __inline unsigned int ClassId()
    {
        return 93;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00648
// RuntimeId: 05381
// TypeInfo:  0x0000000142822220
#ifndef _LocalWindForceEntity_
#define _LocalWindForceEntity_
class LocalWindForceEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 648;
    }
    char _0x0028[152];
};//Size=0x00C0
#endif

////////////////////////////////////////
// ClassId:   00088
// RuntimeId: 09091
// TypeInfo:  0x0000000142878950
#ifndef _EnlightenProbeSet_
#define _EnlightenProbeSet_
class EnlightenProbeSet
{
public:
    static __inline unsigned int ClassId()
    {
        return 88;
    }
    char _0x0000[176];
};//Size=0x00B0
#endif

////////////////////////////////////////
// ClassId:   00089
// RuntimeId: 09090
// TypeInfo:  0x0000000142878860
#ifndef _EnlightenStaticDatabase_
#define _EnlightenStaticDatabase_
class EnlightenStaticDatabase
{
public:
    static __inline unsigned int ClassId()
    {
        return 89;
    }
    char _0x0000[40];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   00090
// RuntimeId: 09089
// TypeInfo:  0x00000001428788B0
#ifndef _EnlightenShaderDatabase_
#define _EnlightenShaderDatabase_
class EnlightenShaderDatabase
{
public:
    static __inline unsigned int ClassId()
    {
        return 90;
    }
    char _0x0000[48];
};//Size=0x0030
#endif

////////////////////////////////////////
// ClassId:   00091
// RuntimeId: 09088
// TypeInfo:  0x0000000142878900
#ifndef _EnlightenDatabase_
#define _EnlightenDatabase_
class EnlightenDatabase
{
public:
    static __inline unsigned int ClassId()
    {
        return 91;
    }
    char _0x0000[128];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00092
// RuntimeId: 09087
// TypeInfo:  0x00000001428789A0
#ifndef _EnlightenCubeMap_
#define _EnlightenCubeMap_
class EnlightenCubeMap
{
public:
    static __inline unsigned int ClassId()
    {
        return 92;
    }
    char _0x0000[592];
};//Size=0x0250
#endif

////////////////////////////////////////
// ClassId:   03401
// RuntimeId: 09084
// TypeInfo:  0x00000001428770E0
#ifndef _WorldRenderSettingsBase_
#define _WorldRenderSettingsBase_
#pragma pack(push, 16)
class WorldRenderSettingsBase : public DataContainer
{
public:
    static __inline WorldRenderSettingsBase* DefaultInstance()
    {
        return (WorldRenderSettingsBase*) 0x00000000688CDE10;
    }
    static __inline unsigned int ClassId()
    {
        return 3401;
    }
    Float32 m_CullScreenAreaScale; //0x0010
    Float32 m_ViewportScale; //0x0014
    char _0x0018[8];
    Vec3 m_MotionBlurClearColor; //0x0020
    Vec3 m_DynamicEnvmapDefaultPosition; //0x0030
    Float32 m_ShadowViewportScale; //0x0040
    Float32 m_ShadowmapMinFov; //0x0044
    Float32 m_ShadowmapSizeZScale; //0x0048
    Uint32 m_ShadowmapResolution; //0x004C
    Uint32 m_ShadowmapQuality; //0x0050
    Float32 m_ShadowmapPoissonFilterScale; //0x0054
    Uint32 m_ShadowmapSliceCount; //0x0058
    Float32 m_ShadowmapSliceSchemeWeight; //0x005C
    Float32 m_ShadowmapFirstSliceScale; //0x0060
    Float32 m_ShadowmapViewDistance; //0x0064
    Float32 m_ShadowmapExtrusionLength; //0x0068
    Float32 m_ShadowmapTransitionBlendAmount; //0x006C
    Float32 m_MotionBlurScale; //0x0070
    Float32 m_MotionBlurFixedShutterTime; //0x0074
    Float32 m_MotionBlurMax; //0x0078
    Float32 m_MotionBlurRadialBlurMax; //0x007C
    Float32 m_MotionBlurNoiseScale; //0x0080
    Uint32 m_MotionBlurQuality; //0x0084
    Uint32 m_MotionBlurDebugMode; //0x0088
    Uint32 m_MotionBlurMaxSampleCount; //0x008C
    Float32 m_ForceMotionBlurDepthCutoff; //0x0090
    Float32 m_ForceMotionBlurCutoffGradientScale; //0x0094
    Float32 m_MotionBlurDepthCheckThreshold; //0x0098
    Float32 m_MotionBlurDepthCheckMaxDistance; //0x009C
    Uint32 m_MultisampleCount; //0x00A0
    Float32 m_MultisampleThreshold; //0x00A4
    Int32 m_OnlyShadowmapSlice; //0x00A8
    WorldViewMode m_ViewMode; //0x00AC
    Float32 m_XenonHdrColorScale; //0x00B0
    Float32 m_XenonHdrColorScaleFactor; //0x00B4
    Float32 m_SkyEnvmapFilterWidth; //0x00B8
    Uint32 m_SkyEnvmapResolution; //0x00BC
    Int32 m_DrawDebugSkyEnvmapMipLevel; //0x00C0
    MipmapFilterMode m_SkyEnvmapFilterMode; //0x00C4
    Uint32 m_SkyEnvmapSidesPerFrameCount; //0x00C8
    Float32 m_DynamicEnvmapFilterWidth; //0x00CC
    Uint32 m_DynamicEnvmapResolution; //0x00D0
    Int32 m_DrawDebugDynamicEnvmapMipLevel; //0x00D4
    MipmapFilterMode m_DynamicEnvmapFilterMode; //0x00D8
    Uint32 m_HudTextureWidth; //0x00DC
    Uint32 m_HudTextureHeight; //0x00E0
    Boolean m_ShadowmapsEnable; //0x00E4
    Boolean m_TransparencyShadowmapsEnable; //0x00E5
    Boolean m_TransparencyShadowmapsHalfRes; //0x00E6
    Boolean m_ShadowmapFixedMovementEnable; //0x00E7
    Boolean m_ShadowmapFixedDepthEnable; //0x00E8
    Boolean m_ShadowmapViewDistanceScaleEnable; //0x00E9
    Boolean m_ShadowmapCullVolumeEnable; //0x00EA
    Boolean m_ShadowmapAccumEnable; //0x00EB
    Boolean m_ShadowmapAccumBilinearEnable; //0x00EC
    Boolean m_ShadowmapTransitionBlendEnable; //0x00ED
    Boolean m_Ps3ShadowmapTilingEnable; //0x00EE
    Boolean m_Ps3Shadowmap16BitEnable; //0x00EF
    Boolean m_Ps3SpotLightShadowmap16BitEnable; //0x00F0
    Boolean m_DxShadowmap16BitEnable; //0x00F1
    Boolean m_DxSpotLightShadowmap16BitEnable; //0x00F2
    Boolean m_ApplyShadowmapsEnable; //0x00F3
    Boolean m_GenerateShadowmapsEnable; //0x00F4
    Boolean m_SimpleShadowmapsEnable; //0x00F5
    Boolean m_EmitterShadowingBlendToggle; //0x00F6
    Boolean m_EmitterShadowingManySamplesToggle; //0x00F7
    Boolean m_DxLinearDepth32BitFormatEnable; //0x00F8
    Boolean m_DxDepthBuffer32BitEnable; //0x00F9
    Boolean m_MotionBlurEnable; //0x00FA
    Boolean m_MotionBlurForceOn; //0x00FB
    Boolean m_MotionBlurOptimalStableVelocityFormula; //0x00FC
    Boolean m_MotionBlurStencilPassEnable; //0x00FD
    Boolean m_MotionBlurGeometryPassEnable; //0x00FE
    Boolean m_MotionBlurBackgroundPassEnable; //0x00FF
    Boolean m_MotionBlurCenteredEnable; //0x0100
    Boolean m_DrawDebugMultisampleClassify; //0x0101
    Boolean m_DrawTransparent; //0x0102
    Boolean m_DrawTransparentDecal; //0x0103
    Boolean m_Enable; //0x0104
    Boolean m_HdrEnable; //0x0105
    Boolean m_ReadOnlyDepthEnable; //0x0106
    Boolean m_ConsoleRenderTargetPoolSharingEnable; //0x0107
    Boolean m_Ps3RenderTargetPoolGBufferOffsetEnable; //0x0108
    Boolean m_FastHdrEnable; //0x0109
    Boolean m_XenonFloatDepthBufferEnable; //0x010A
    Boolean m_Ps3HdrClearEnable; //0x010B
    Boolean m_Ps3TilingEnable; //0x010C
    Boolean m_Ps3ZCullEnable; //0x010D
    Boolean m_Ps3SCullEnable; //0x010E
    Boolean m_Ps3ColorCompressionEnable; //0x010F
    Boolean m_Ps3TiledHalfTargetEnable; //0x0110
    Boolean m_Ps3TiledSSAOTargetsEnable; //0x0111
    Boolean m_FinalPostEnable; //0x0112
    Boolean m_OutputGammaCorrectionEnable; //0x0113
    Boolean m_ScreenEffectEnable; //0x0114
    Boolean m_DrawLightSources; //0x0115
    Boolean m_DrawSolidBoundingBoxes; //0x0116
    Boolean m_DrawLineBoundingBoxes; //0x0117
    Boolean m_DrawBoundingSpheres; //0x0118
    Boolean m_DrawFrustums; //0x0119
    Boolean m_DrawDebugShadowmaps; //0x011A
    Boolean m_DrawDebugSpotLightShadowmaps; //0x011B
    Boolean m_DrawDebugSkyEnvmap; //0x011C
    Boolean m_DrawDebugVelocityBuffer; //0x011D
    Boolean m_DrawDebugZBufferEnable; //0x011E
    Boolean m_DrawDebugHalfResEnvironment; //0x011F
    Boolean m_DrawDebugDistortion; //0x0120
    Boolean m_DrawDebugVisibleEntityTypes; //0x0121
    Boolean m_DrawDebugSkyTextures; //0x0122
    Boolean m_DrawDebugMarschnerTextures; //0x0123
    Boolean m_DrawDebugDof; //0x0124
    Boolean m_DrawDebugDofFullscreen; //0x0125
    Boolean m_DrawDebugHalfResHdrTargets; //0x0126
    Boolean m_WireframeEnable; //0x0127
    Boolean m_ZPassEnable; //0x0128
    Boolean m_OccluderMeshZPrepassEnable; //0x0129
    Boolean m_OccluderMeshZPrepassDebugEnable; //0x012A
    Boolean m_HalfResEnable; //0x012B
    Boolean m_ForceFullResEnable; //0x012C
    Boolean m_HalfResLensFlaresEnable; //0x012D
    Boolean m_ForegroundEnable; //0x012E
    Boolean m_ForegroundDepthClearEnable; //0x012F
    Boolean m_ForegroundZPassEnable; //0x0130
    Boolean m_ForegroundTransparentEnable; //0x0131
    Boolean m_BilateralHalfResCompositeEnable; //0x0132
    Boolean m_TiledHalfResCompositeEnable; //0x0133
    Boolean m_TiledHalfResStencilOccludersEnable; //0x0134
    Boolean m_SkyEnable; //0x0135
    Boolean m_SkyFogEnable; //0x0136
    Boolean m_SkyHeightFogEnable; //0x0137
    Boolean m_SkyForwardScatteringEnable; //0x0138
    Boolean m_DistortionEnable; //0x0139
    Boolean m_DistortionHalfResEnable; //0x013A
    Boolean m_Distortion8BitEnable; //0x013B
    Boolean m_DistortionTilingEnable; //0x013C
    Boolean m_StaticEnvmapEnable; //0x013D
    Boolean m_CustomEnvmapEnable; //0x013E
    Boolean m_CustomEnvmapMipmapClampEnable; //0x013F
    Boolean m_SkyEnvmapEnable; //0x0140
    Boolean m_SkyEnvmapMipmapGenEnable; //0x0141
    Boolean m_SkyEnvmapUpdateEnable; //0x0142
    Boolean m_SkyEnvmapForceUpdateEnable; //0x0143
    Boolean m_SkyEnvmapUse8BitTexture; //0x0144
    Boolean m_DynamicEnvmapEnable; //0x0145
    Boolean m_DynamicEnvmapMipmapGenEnable; //0x0146
    Boolean m_DrawDebugDynamicEnvmap; //0x0147
    Boolean m_HairCoverageEnable; //0x0148
    Boolean m_SetupJobEnable; //0x0149
    Boolean m_FinishSyncJobsFirstEnable; //0x014A
    Boolean m_PrepareDispatchListJobEnable; //0x014B
    char _0x014C[4];
};//Size=0x0150
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03402
// RuntimeId: 09086
// TypeInfo:  0x0000000142877080
#ifndef _WorldRenderSettings_
#define _WorldRenderSettings_
#pragma pack(push, 16)
class WorldRenderSettings : public WorldRenderSettingsBase
{
public:
    static __inline WorldRenderSettings* DefaultInstance()
    {
        return (WorldRenderSettings*) 0x00000000688CDF80;
    }
    static __inline unsigned int ClassId()
    {
        return 3402;
    }
    Vec4 m_OverlayColor; //0x0150
    Uint32 m_GenericEntityMaxVisibleEntityCount; //0x0160
    Uint32 m_DrawDebugGroundHeight; //0x0164
    Float32 m_DecalVolumeScale; //0x0168
    Uint32 m_GBufferLayout; //0x016C
    Uint32 m_GBufferTestCount; //0x0170
    Float32 m_GBufferAlphaTestSimpleSmoothness; //0x0174
    Float32 m_GBufferForceSmoothness; //0x0178
    Float32 m_GBufferForceSpecularAlbedo; //0x017C
    QualityLevel m_SpotLightsAsConeLightsLevel; //0x0180
    Float32 m_LightTileMinArea; //0x0184
    Float32 m_LightStencilMinArea; //0x0188
    Float32 m_LightNarrowAngleThreshold; //0x018C
    Uint32 m_OutdoorLightTileBatchCount; //0x0190
    Uint32 m_XenonDrawDebugLightTileGridMode; //0x0194
    Uint32 m_XenonLightTileConstantBufferSize; //0x0198
    Uint32 m_XenonLightTileMaxPointLightCount; //0x019C
    Uint32 m_XenonLightTileMaxLineLightCount; //0x01A0
    Uint32 m_XenonLightTileMaxSpotLightCount; //0x01A4
    Uint32 m_Ps3LightTileMethod; //0x01A8
    Uint32 m_Ps3LightTileJobCount; //0x01AC
    Uint32 m_Ps3LightTileJobPriority; //0x01B0
    Float32 m_Ps3LightTileJobYieldGranularity; //0x01B4
    Float32 m_Ps3LightTileJobYieldAggressiveGranularity; //0x01B8
    Uint32 m_Ps3LightTileJobMaxFbTileCount; //0x01BC
    Int32 m_OnlyLightTileIndex; //0x01C0
    Uint32 m_SpotLightShadowmapResolution; //0x01C4
    Uint32 m_SpotLightShadowmapQuality; //0x01C8
    Float32 m_SpotLightShadowmapPoissonFilterScale; //0x01CC
    QualityLevel m_SpotLightShadowmapLevel; //0x01D0
    Uint32 m_MaxPointLightCount; //0x01D4
    Uint32 m_MaxSpotLightCount; //0x01D8
    Uint32 m_MaxSpotLightShadowCount; //0x01DC
    Uint32 m_MaxDestructionVolumeCount; //0x01E0
    Uint32 m_MaxDecalVolumeCount; //0x01E4
    Float32 m_SpotLightNearPlane; //0x01E8
    Uint32 m_LightTileCsAvgLightCountPerTile; //0x01EC
    Float32 m_LightLodFadeArea; //0x01F0
    Float32 m_LightLodMinArea; //0x01F4
    Float32 m_LightLodRadiusFactor; //0x01F8
    Float32 m_LightLodSpecularFadeAreaStart; //0x01FC
    Float32 m_LightLodSpecularFadeAreaEnd; //0x0200
    Float32 m_LightForceIntensity; //0x0204
    Float32 m_LightIntensityScale; //0x0208
    Float32 m_LightRadiusScale; //0x020C
    Float32 m_LightAttenuationThreshold; //0x0210
    Uint32 m_ShadowOcclusionCullingWidth; //0x0214
    Uint32 m_ShadowOcclusionCullingHeight; //0x0218
    Uint32 m_ShadowOcclusionTriangleCount; //0x021C
    Float32 m_FrustumSilhouetteCullingPadding; //0x0220
    Int32 m_OnlyTileIndex; //0x0224
    Float32 m_PlanarReflectionViewScale; //0x0228
    Float32 m_PlanarReflectionCullFOV; //0x022C
    Float32 m_PlanarReflectionFarPlane; //0x0230
    Uint32 m_DrawDebugPlanarReflectionMode; //0x0234
    Float32 m_ReflectionLodScale; //0x0238
    PostProcessAAMode m_PostProcessAntialiasingMode; //0x023C
    Int32 m_FxaaForceVendor; //0x0240
    ScaleResampleMode m_RenderScaleResampleMode; //0x0244
    Float32 m_LightCubeMapStencilMinArea; //0x0248
    Uint32 m_DrawDebugIndirectCubeMapMipLevel; //0x024C
    Uint32 m_DrawDebugIndirectCubeMapIndex; //0x0250
    Boolean m_SimpleRenderingEnable; //0x0254
    Boolean m_GenericEntityRendererEnable; //0x0255
    Boolean m_ZBufferShadowTestEnable; //0x0256
    Boolean m_DecalVolumeEnable; //0x0257
    Boolean m_DrawDebugDecalVolumes; //0x0258
    Boolean m_DrawDebugDestructionVolumes; //0x0259
    Boolean m_LensFlaresEnable; //0x025A
    Boolean m_DrawDebugLensFlareOccluders; //0x025B
    Boolean m_DrawDebugLensFlares; //0x025C
    Boolean m_LensFlareOcclusionEnable; //0x025D
    Boolean m_CloudShadowEnable; //0x025E
    Boolean m_OverrideDynamicAO; //0x025F
    Boolean m_DrawDebugDynamicAO; //0x0260
    Boolean m_EmissiveEnable; //0x0261
    Boolean m_UnlitEnable; //0x0262
    Boolean m_GBufferClearEnable; //0x0263
    Boolean m_DxGBufferLight16BitEnable; //0x0264
    Boolean m_DxGBufferNormal16BitEnable; //0x0265
    Boolean m_GBufferAlphaTestSimpleEnable; //0x0266
    Boolean m_Gen4aEsramEnable; //0x0267
    Boolean m_SpecularLightingEnable; //0x0268
    Boolean m_SkinLightingEnable; //0x0269
    Boolean m_TranslucencyLightingEnable; //0x026A
    Boolean m_DynamicEnvmapLightingEnable; //0x026B
    Boolean m_OutdoorLightEnable; //0x026C
    Boolean m_PointLightsEnable; //0x026D
    Boolean m_LineLightsEnable; //0x026E
    Boolean m_ConeLightsEnable; //0x026F
    Boolean m_SpotLightsEnable; //0x0270
    Boolean m_LightProbesEnable; //0x0271
    Boolean m_LightStencilMethodEnable; //0x0272
    Boolean m_LightVolumeMethodEnable; //0x0273
    Boolean m_LightVolumeDepthTestEnable; //0x0274
    Boolean m_OutdoorKeyLightEnable; //0x0275
    Boolean m_OutdoorSkyLightEnable; //0x0276
    Boolean m_OutdoorLightTilingEnable; //0x0277
    Boolean m_OutdoorLightTileRenderEnable; //0x0278
    Boolean m_OutdoorLightTileBlendEnable; //0x0279
    Boolean m_OutdoorLightTileSimpleShaderEnable; //0x027A
    Boolean m_XenonOutdoorLightTilingEnable; //0x027B
    Boolean m_XenonPointLightsTilingEnable; //0x027C
    Boolean m_XenonSpotLightsTilingEnable; //0x027D
    Boolean m_XenonLineLightsTilingEnable; //0x027E
    Boolean m_XenonAsyncLightJobsEnable; //0x027F
    Boolean m_XenonLightTileDownsampleSpecularCheckEnable; //0x0280
    Boolean m_XenonLightTileCpuPointLightCullingEnable; //0x0281
    Boolean m_XenonLightTileCpuSpotLightCullingEnable; //0x0282
    Boolean m_Ps3DepthBoundsLightCullingEnable; //0x0283
    Boolean m_Ps3LightTileJobYieldEnable; //0x0284
    Boolean m_Ps3LightTileClearAllEnable; //0x0285
    Boolean m_Ps3LightCullSpuJob; //0x0286
    Boolean m_SpotLightShadowmapEnable; //0x0287
    Boolean m_RadiositySpotLightShadowCullingEnable; //0x0288
    Boolean m_LightTileCsPathEnable; //0x0289
    Boolean m_LightTileMinMaxUseHTile; //0x028A
    Boolean m_LightTileSplitCullingAndLighting; //0x028B
    Boolean m_DrawDebugGBuffer; //0x028C
    Boolean m_DrawDebugLightSources; //0x028D
    Boolean m_DrawDebugLightShadowSources; //0x028E
    Boolean m_DrawDebugLightTextureSources; //0x028F
    Boolean m_DrawDebugLightStats; //0x0290
    Boolean m_DrawDebugLightTiles; //0x0291
    Boolean m_DrawDebugLightTileVolumes; //0x0292
    Boolean m_DrawDebugLightTileFbGrid; //0x0293
    Boolean m_DrawDebugLightTileGrid; //0x0294
    Boolean m_DrawDebugLightTileSources; //0x0295
    Boolean m_LightWidthEnable; //0x0296
    Boolean m_LightIntensityNormalizationEnable; //0x0297
    Boolean m_LightCullEnable; //0x0298
    Boolean m_LightOcclusionCullEnable; //0x0299
    Boolean m_LightDepthCullEnable; //0x029A
    Boolean m_LightNormalCullEnable; //0x029B
    Boolean m_LightConeCullEnable; //0x029C
    Boolean m_LightTileOverlayEnable; //0x029D
    Boolean m_LightAttenuationThresholdEnable; //0x029E
    Boolean m_SkyVisibilityEnvmapScalingEnable; //0x029F
    Boolean m_ShadowOcclusionCullingEnable; //0x02A0
    Boolean m_FrustumSilhouetteCullingEnable; //0x02A1
    Boolean m_SubSurfaceScatteringEnable; //0x02A2
    Boolean m_OpaqueSortBySolutionEnable; //0x02A3
    Boolean m_MainOpaqueZPassEnable; //0x02A4
    Boolean m_PlanarReflectionEnable; //0x02A5
    Boolean m_PlanarReflectionFastHdrEnable; //0x02A6
    Boolean m_PlanarReflectionBlur; //0x02A7
    Boolean m_PlanarReflectionClippingEnable; //0x02A8
    Boolean m_DrawDebugPlanarReflection; //0x02A9
    Boolean m_DrawDebugPlanarReflectionCullFrustum; //0x02AA
    Boolean m_OverlayEnable; //0x02AB
    Boolean m_SmaaVelocityReprojectionEnable; //0x02AC
    Boolean m_SmaaUseStencil; //0x02AD
    Boolean m_SmaaPredicatedThresholdingEnable; //0x02AE
    Boolean m_ViewFxEnable; //0x02AF
    Boolean m_RenderScaleResampleEnable; //0x02B0
    Boolean m_LightCubeMapStencilEnable; //0x02B1
    Boolean m_DrawDebugIndirectCubeMapEnable; //0x02B2
    char _0x02B3[13];
};//Size=0x02C0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01466
// RuntimeId: 09072
// TypeInfo:  0x0000000142877140
#ifndef _VisualEnvironmentSettings_
#define _VisualEnvironmentSettings_
#pragma pack(push, 8)
class VisualEnvironmentSettings : public DataContainer
{
public:
    static __inline VisualEnvironmentSettings* DefaultInstance()
    {
        return (VisualEnvironmentSettings*) 0x0000000068891C60;
    }
    static __inline unsigned int ClassId()
    {
        return 1466;
    }
    Float32 m_SunRotationX; //0x0010
    Float32 m_SunRotationY; //0x0014
    Boolean m_DrawStats; //0x0018
    Boolean m_DrawOnlyVisibleStats; //0x0019
    char _0x001A[6];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03272
// RuntimeId: 09070
// TypeInfo:  0x00000001428771A0
#ifndef _SunFlareEffectState_
#define _SunFlareEffectState_
#pragma pack(push, 16)
class SunFlareEffectState : public DataContainer
{
public:
    static __inline SunFlareEffectState* DefaultInstance()
    {
        return (SunFlareEffectState*) 0x00000000688CB310;
    }
    static __inline unsigned int ClassId()
    {
        return 3272;
    }
    Float32 m_OccluderSize; //0x0010
    char _0x0014[4];
    SurfaceShaderBaseAsset* m_Element1Shader; //0x0018
    Vec4 m_Element1SizeOccluderCurve; //0x0020
    Vec4 m_Element1SizeScreenPosCurve; //0x0030
    Vec4 m_Element1AlphaOccluderCurve; //0x0040
    Vec4 m_Element1AlphaScreenPosCurve; //0x0050
    Vec4 m_Element2SizeOccluderCurve; //0x0060
    Vec4 m_Element2SizeScreenPosCurve; //0x0070
    Vec4 m_Element2AlphaOccluderCurve; //0x0080
    Vec4 m_Element2AlphaScreenPosCurve; //0x0090
    Vec4 m_Element3SizeOccluderCurve; //0x00A0
    Vec4 m_Element3SizeScreenPosCurve; //0x00B0
    Vec4 m_Element3AlphaOccluderCurve; //0x00C0
    Vec4 m_Element3AlphaScreenPosCurve; //0x00D0
    Vec4 m_Element4SizeOccluderCurve; //0x00E0
    Vec4 m_Element4SizeScreenPosCurve; //0x00F0
    Vec4 m_Element4AlphaOccluderCurve; //0x0100
    Vec4 m_Element4AlphaScreenPosCurve; //0x0110
    Vec4 m_Element5SizeOccluderCurve; //0x0120
    Vec4 m_Element5SizeScreenPosCurve; //0x0130
    Vec4 m_Element5AlphaOccluderCurve; //0x0140
    Vec4 m_Element5AlphaScreenPosCurve; //0x0150
    Float32 m_Element1RayDistance; //0x0160
    Vec2 m_Element1Size; //0x0164
    char _0x016C[4];
    SurfaceShaderBaseAsset* m_Element2Shader; //0x0170
    Float32 m_Element2RayDistance; //0x0178
    Vec2 m_Element2Size; //0x017C
    char _0x0184[4];
    SurfaceShaderBaseAsset* m_Element3Shader; //0x0188
    Float32 m_Element3RayDistance; //0x0190
    Vec2 m_Element3Size; //0x0194
    char _0x019C[4];
    SurfaceShaderBaseAsset* m_Element4Shader; //0x01A0
    Float32 m_Element4RayDistance; //0x01A8
    Vec2 m_Element4Size; //0x01AC
    char _0x01B4[4];
    SurfaceShaderBaseAsset* m_Element5Shader; //0x01B8
    Float32 m_Element5RayDistance; //0x01C0
    Vec2 m_Element5Size; //0x01C4
    Boolean m_Enable; //0x01CC
    Boolean m_DebugDrawOccluder; //0x01CD
    Boolean m_Element1Enable; //0x01CE
    Boolean m_Element2Enable; //0x01CF
    Boolean m_Element3Enable; //0x01D0
    Boolean m_Element4Enable; //0x01D1
    Boolean m_Element5Enable; //0x01D2
    char _0x01D3[13];
};//Size=0x01E0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02138
// RuntimeId: 09068
// TypeInfo:  0x0000000142877200
#ifndef _SkyEffectState_
#define _SkyEffectState_
#pragma pack(push, 16)
class SkyEffectState : public DataContainer
{
public:
    static __inline SkyEffectState* DefaultInstance()
    {
        return (SkyEffectState*) 0x00000000688A0600;
    }
    static __inline unsigned int ClassId()
    {
        return 2138;
    }
    Float32 m_SunSize; //0x0010
    Float32 m_SunScale; //0x0014
    char _0x0018[8];
    Vec3 m_CloudLayerSunColor; //0x0020
    SkyCloudLayer m_CloudLayer1; //0x0030
    SkyCloudLayer m_CloudLayer2; //0x0070
    Float32 m_SkyGradientScale; //0x00B0
    char _0x00B4[4];
    TextureAsset* m_SkyGradientTexture; //0x00B8
    Float32 m_PanoramicUVMinX; //0x00C0
    Float32 m_PanoramicUVMaxX; //0x00C4
    Float32 m_PanoramicUVMinY; //0x00C8
    Float32 m_PanoramicUVMaxY; //0x00CC
    Float32 m_PanoramicTileFactor; //0x00D0
    Float32 m_PanoramicRotation; //0x00D4
    TextureAsset* m_PanoramicTexture; //0x00D8
    TextureAsset* m_PanoramicAlphaTexture; //0x00E0
    TextureAsset* m_CloudLayerMaskTexture; //0x00E8
    TextureAsset* m_StaticEnvmapTexture; //0x00F0
    Float32 m_WindDirection; //0x00F8
    Boolean m_Enable; //0x00FC
    char _0x00FD[3];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03482
// RuntimeId: 09064
// TypeInfo:  0x0000000142877260
#ifndef _FogEffectState_
#define _FogEffectState_
#pragma pack(push, 16)
class FogEffectState : public DataContainer
{
public:
    static __inline FogEffectState* DefaultInstance()
    {
        return (FogEffectState*) 0x00000000688CFE10;
    }
    static __inline unsigned int ClassId()
    {
        return 3482;
    }
    Float32 m_Start; //0x0010
    Float32 m_End; //0x0014
    char _0x0018[8];
    Vec4 m_Curve; //0x0020
    Vec3 m_FogColor; //0x0030
    Vec4 m_FogColorCurve; //0x0040
    Vec3 m_ForwardLightScatteringColor; //0x0050
    Float32 m_FogColorStart; //0x0060
    Float32 m_FogColorEnd; //0x0064
    Float32 m_TransparencyFadeStart; //0x0068
    Float32 m_TransparencyFadeEnd; //0x006C
    Float32 m_TransparencyFadeClamp; //0x0070
    Float32 m_ForwardLightScatteringPhaseG; //0x0074
    Float32 m_ForwardLightScatteringStrength; //0x0078
    Float32 m_ForwardLightScatteringPresence; //0x007C
    Float32 m_ForwardLightScatteringMaxBlurLength; //0x0080
    Float32 m_ForwardLightScatteringExtinction; //0x0084
    Float32 m_ForwardLightScatteringSmoothness; //0x0088
    Float32 m_HeightFogFollowCamera; //0x008C
    Float32 m_HeightFogAltitude; //0x0090
    Float32 m_HeightFogDepth; //0x0094
    Float32 m_HeightFogVisibilityRange; //0x0098
    Boolean m_Enable; //0x009C
    Boolean m_ForwardLightScatteringEnabled; //0x009D
    Boolean m_HeightFogEnable; //0x009E
    char _0x009F[1];
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03670
// RuntimeId: 09062
// TypeInfo:  0x00000001428772C0
#ifndef _OutdoorLightEffectState_
#define _OutdoorLightEffectState_
#pragma pack(push, 16)
class OutdoorLightEffectState : public DataContainer
{
public:
    static __inline OutdoorLightEffectState* DefaultInstance()
    {
        return (OutdoorLightEffectState*) 0x00000000688D41C0;
    }
    static __inline unsigned int ClassId()
    {
        return 3670;
    }
    Float32 m_SunRotationX; //0x0010
    Float32 m_SunRotationY; //0x0014
    char _0x0018[8];
    Vec3 m_SunColor; //0x0020
    Vec3 m_SkyColor; //0x0030
    Vec3 m_GroundColor; //0x0040
    Float32 m_SkyLightAngleFactor; //0x0050
    Float32 m_SunShadowHeightScale; //0x0054
    TextureAsset* m_CloudShadowTexture; //0x0058
    Vec2 m_CloudShadowSpeed; //0x0060
    Float32 m_CloudShadowSize; //0x0068
    Float32 m_CloudShadowCoverage; //0x006C
    Float32 m_CloudShadowExponent; //0x0070
    Boolean m_Enable; //0x0074
    Boolean m_CloudShadowEnable; //0x0075
    char _0x0076[10];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03072
// RuntimeId: 05086
// TypeInfo:  0x000000014281E450
#ifndef _VisualEnvironmentComponentData_
#define _VisualEnvironmentComponentData_
#pragma pack(push, 16)
class VisualEnvironmentComponentData : public GameComponentData
{
public:
    static __inline VisualEnvironmentComponentData* DefaultInstance()
    {
        return (VisualEnvironmentComponentData*) 0x00000000688C3050;
    }
    static __inline unsigned int ClassId()
    {
        return 3072;
    }
    Array<CString> m_PropertyOverrides; //0x0070
    Array<Uint32> m_PropertyOverrideMasks; //0x0078
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03081
// RuntimeId: 09056
// TypeInfo:  0x0000000142877380
#ifndef _MotionBlurComponentData_
#define _MotionBlurComponentData_
#pragma pack(push, 16)
class MotionBlurComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline MotionBlurComponentData* DefaultInstance()
    {
        return (MotionBlurComponentData*) 0x00000000688C3B00;
    }
    static __inline unsigned int ClassId()
    {
        return 3081;
    }
    Realm m_Realm; //0x0080
    Float32 m_MotionBlurScale; //0x0084
    Float32 m_MotionBlurCutoffRadius; //0x0088
    Float32 m_CutoffGradientScale; //0x008C
    Vec2 m_RadialBlurCenter; //0x0090
    Float32 m_RadialBlurOffset; //0x0098
    Float32 m_RadialBlurScale; //0x009C
    Boolean m_MotionBlurEnable; //0x00A0
    Boolean m_MotionBlurCentered; //0x00A1
    Boolean m_RadialBlurEnable; //0x00A2
    char _0x00A3[13];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03084
// RuntimeId: 09054
// TypeInfo:  0x00000001428773E0
#ifndef _VehicleLightingComponentData_
#define _VehicleLightingComponentData_
#pragma pack(push, 16)
class VehicleLightingComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline VehicleLightingComponentData* DefaultInstance()
    {
        return (VehicleLightingComponentData*) 0x00000000688C3DD0;
    }
    static __inline unsigned int ClassId()
    {
        return 3084;
    }
    Vec3 m_TopLight; //0x0080
    Vec3 m_BottomLight; //0x0090
    Realm m_Realm; //0x00A0
    Float32 m_CameraUpRotation; //0x00A4
    VehicleLightingMode m_VehicleLightingMode; //0x00A8
    Float32 m_BlendFactor; //0x00AC
    Float32 m_TopLightDirX; //0x00B0
    Float32 m_TopLightDirY; //0x00B4
    Float32 m_StartFadeDistance; //0x00B8
    Float32 m_EndFadeDistance; //0x00BC
    Float32 m_StartFadeOutDistance; //0x00C0
    Float32 m_EndFadeOutDistance; //0x00C4
    Boolean m_VehicleLightEnable; //0x00C8
    Boolean m_FirstPersonEnable; //0x00C9
    Boolean m_LockToCameraDirection; //0x00CA
    char _0x00CB[5];
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03076
// RuntimeId: 09050
// TypeInfo:  0x0000000142877440
#ifndef _CharacterLightingComponentData_
#define _CharacterLightingComponentData_
#pragma pack(push, 16)
class CharacterLightingComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline CharacterLightingComponentData* DefaultInstance()
    {
        return (CharacterLightingComponentData*) 0x00000000688C33F0;
    }
    static __inline unsigned int ClassId()
    {
        return 3076;
    }
    Vec3 m_TopLight; //0x0080
    Vec3 m_BottomLight; //0x0090
    Realm m_Realm; //0x00A0
    Float32 m_CameraUpRotation; //0x00A4
    CharacterLightingMode m_CharacterLightingMode; //0x00A8
    Float32 m_BlendFactor; //0x00AC
    Float32 m_TopLightDirX; //0x00B0
    Float32 m_TopLightDirY; //0x00B4
    Float32 m_StartFadeDistance; //0x00B8
    Float32 m_EndFadeDistance; //0x00BC
    Float32 m_StartFadeOutDistance; //0x00C0
    Float32 m_EndFadeOutDistance; //0x00C4
    Boolean m_CharacterLightEnable; //0x00C8
    Boolean m_FirstPersonEnable; //0x00C9
    Boolean m_LockToCameraDirection; //0x00CA
    char _0x00CB[5];
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03087
// RuntimeId: 09046
// TypeInfo:  0x00000001428774A0
#ifndef _DamageEffectComponentData_
#define _DamageEffectComponentData_
#pragma pack(push, 16)
class DamageEffectComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline DamageEffectComponentData* DefaultInstance()
    {
        return (DamageEffectComponentData*) 0x00000000688C4080;
    }
    static __inline unsigned int ClassId()
    {
        return 3087;
    }
    Vec4 m_TopDamage; //0x0080
    Vec4 m_LeftDamage; //0x0090
    Vec4 m_BottomDamage; //0x00A0
    Vec4 m_RightDamage; //0x00B0
    Realm m_Realm; //0x00C0
    char _0x00C4[4];
    SurfaceShaderBaseAsset* m_Shader; //0x00C8
    Float32 m_FrameWidth; //0x00D0
    Float32 m_OuterFrameOpacity; //0x00D4
    Float32 m_InnerFrameOpacity; //0x00D8
    Float32 m_FallofTime; //0x00DC
    Float32 m_MinDamagePercentageThreshold; //0x00E0
    Float32 m_MaxOpacityDamagePercentage; //0x00E4
    Float32 m_StartCriticalEffectHealthThreshold; //0x00E8
    Float32 m_EndCriticalEffectHealthThreshold; //0x00EC
    Boolean m_DebugDamage; //0x00F0
    char _0x00F1[15];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03096
// RuntimeId: 09044
// TypeInfo:  0x0000000142877500
#ifndef _ScreenEffectComponentData_
#define _ScreenEffectComponentData_
#pragma pack(push, 16)
class ScreenEffectComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline ScreenEffectComponentData* DefaultInstance()
    {
        return (ScreenEffectComponentData*) 0x00000000688C48E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3096;
    }
    Vec4 m_ScreenEffectParams; //0x0080
    Realm m_Realm; //0x0090
    ScreenEffectFrameType m_FrameType; //0x0094
    SurfaceShaderBaseAsset* m_Shader; //0x0098
    Float32 m_FrameWidth; //0x00A0
    Float32 m_OuterFrameOpacity; //0x00A4
    Float32 m_InnerFrameOpacity; //0x00A8
    Float32 m_Angle; //0x00AC
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03082
// RuntimeId: 09040
// TypeInfo:  0x0000000142877560
#ifndef _CameraParamsComponentData_
#define _CameraParamsComponentData_
#pragma pack(push, 16)
class CameraParamsComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline CameraParamsComponentData* DefaultInstance()
    {
        return (CameraParamsComponentData*) 0x00000000688C3BD0;
    }
    static __inline unsigned int ClassId()
    {
        return 3082;
    }
    Realm m_Realm; //0x0080
    Float32 m_ViewDistance; //0x0084
    Float32 m_NearPlane; //0x0088
    Float32 m_SunShadowmapViewDistance; //0x008C
};//Size=0x0090
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03086
// RuntimeId: 09038
// TypeInfo:  0x00000001428775C0
#ifndef _ShaderParamsComponentData_
#define _ShaderParamsComponentData_
#pragma pack(push, 16)
class ShaderParamsComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline ShaderParamsComponentData* DefaultInstance()
    {
        return (ShaderParamsComponentData*) 0x00000000688C3FA0;
    }
    static __inline unsigned int ClassId()
    {
        return 3086;
    }
    Vec4 m_Value; //0x0080
    Realm m_Realm; //0x0090
    char _0x0094[4];
    CString m_ParameterName; //0x0098
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03083
// RuntimeId: 09036
// TypeInfo:  0x0000000142877620
#ifndef _EnlightenComponentData_
#define _EnlightenComponentData_
#pragma pack(push, 16)
class EnlightenComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline EnlightenComponentData* DefaultInstance()
    {
        return (EnlightenComponentData*) 0x00000000688C3C80;
    }
    static __inline unsigned int ClassId()
    {
        return 3083;
    }
    Vec3 m_TerrainColor; //0x0080
    Vec3 m_SkyBoxSkyColor; //0x0090
    Vec3 m_SkyBoxGroundColor; //0x00A0
    Vec3 m_SkyBoxSunLightColor; //0x00B0
    Vec3 m_SkyBoxBackLightColor; //0x00C0
    Vec3 m_OpaqueAlphaTestSimpleScale; //0x00D0
    Vec3 m_OverrideLightProbe; //0x00E0
    Realm m_Realm; //0x00F0
    Float32 m_BounceScale; //0x00F4
    Float32 m_SunScale; //0x00F8
    Float32 m_CullDistance; //0x00FC
    Float32 m_CullRadius; //0x0100
    Float32 m_SkyBoxSunLightColorSize; //0x0104
    Float32 m_SkyBoxBackLightColorSize; //0x0108
    Float32 m_SkyBoxBackLightRotationX; //0x010C
    Float32 m_SkyBoxBackLightRotationY; //0x0110
    char _0x0114[4];
    TextureAsset* m_OverrideIrradianceChromaTexture; //0x0118
    TextureAsset* m_OverrideIrradianceLumaTexture; //0x0120
    Boolean m_SkyBoxEnable; //0x0128
    char _0x0129[7];
};//Size=0x0130
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03097
// RuntimeId: 09034
// TypeInfo:  0x0000000142877680
#ifndef _SubSurfaceScatteringComponentData_
#define _SubSurfaceScatteringComponentData_
#pragma pack(push, 16)
class SubSurfaceScatteringComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline SubSurfaceScatteringComponentData* DefaultInstance()
    {
        return (SubSurfaceScatteringComponentData*) 0x00000000688C49B0;
    }
    static __inline unsigned int ClassId()
    {
        return 3097;
    }
    Vec3 m_SimpleSssColor; //0x0080
    Vec3 m_AdvancedSssMat0Width; //0x0090
    Vec3 m_AdvancedSssMat1Width; //0x00A0
    Vec3 m_AdvancedSssMat2Width; //0x00B0
    Vec3 m_AdvancedSssMat3Width; //0x00C0
    Vec3 m_AdvancedSssMat4Width; //0x00D0
    Realm m_Realm; //0x00E0
    Float32 m_SimpleSssRolloffKeyLight; //0x00E4
    Float32 m_SimpleSssRolloffLocalLight; //0x00E8
    Boolean m_AdvancedSssEnable; //0x00EC
    char _0x00ED[3];
};//Size=0x00F0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03091
// RuntimeId: 09032
// TypeInfo:  0x00000001428776E0
#ifndef _DynamicAOComponentData_
#define _DynamicAOComponentData_
#pragma pack(push, 16)
class DynamicAOComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline DynamicAOComponentData* DefaultInstance()
    {
        return (DynamicAOComponentData*) 0x00000000688C44D0;
    }
    static __inline unsigned int ClassId()
    {
        return 3091;
    }
    Realm m_Realm; //0x0080
    Float32 m_SsaoFade; //0x0084
    Float32 m_SsaoRadius; //0x0088
    Float32 m_SsaoMaxDistanceInner; //0x008C
    Float32 m_SsaoMaxDistanceOuter; //0x0090
    Float32 m_HbaoRadius; //0x0094
    Float32 m_HbaoAngleBias; //0x0098
    Float32 m_HbaoAttenuation; //0x009C
    Float32 m_HbaoContrast; //0x00A0
    Float32 m_HbaoMaxFootprintRadius; //0x00A4
    Float32 m_HbaoPowerExponent; //0x00A8
    Boolean m_Enable; //0x00AC
    char _0x00AD[3];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03079
// RuntimeId: 09030
// TypeInfo:  0x0000000142877740
#ifndef _SunFlareComponentData_
#define _SunFlareComponentData_
#pragma pack(push, 16)
class SunFlareComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline SunFlareComponentData* DefaultInstance()
    {
        return (SunFlareComponentData*) 0x00000000688C3730;
    }
    static __inline unsigned int ClassId()
    {
        return 3079;
    }
    Vec4 m_Element1SizeOccluderCurve; //0x0080
    Vec4 m_Element1SizeScreenPosCurve; //0x0090
    Vec4 m_Element1AlphaOccluderCurve; //0x00A0
    Vec4 m_Element1AlphaScreenPosCurve; //0x00B0
    Vec4 m_Element1RotationDistCurve; //0x00C0
    Vec4 m_Element2SizeOccluderCurve; //0x00D0
    Vec4 m_Element2SizeScreenPosCurve; //0x00E0
    Vec4 m_Element2AlphaOccluderCurve; //0x00F0
    Vec4 m_Element2AlphaScreenPosCurve; //0x0100
    Vec4 m_Element2RotationDistCurve; //0x0110
    Vec4 m_Element3SizeOccluderCurve; //0x0120
    Vec4 m_Element3SizeScreenPosCurve; //0x0130
    Vec4 m_Element3AlphaOccluderCurve; //0x0140
    Vec4 m_Element3AlphaScreenPosCurve; //0x0150
    Vec4 m_Element3RotationDistCurve; //0x0160
    Vec4 m_Element4SizeOccluderCurve; //0x0170
    Vec4 m_Element4SizeScreenPosCurve; //0x0180
    Vec4 m_Element4AlphaOccluderCurve; //0x0190
    Vec4 m_Element4AlphaScreenPosCurve; //0x01A0
    Vec4 m_Element4RotationDistCurve; //0x01B0
    Vec4 m_Element5SizeOccluderCurve; //0x01C0
    Vec4 m_Element5SizeScreenPosCurve; //0x01D0
    Vec4 m_Element5AlphaOccluderCurve; //0x01E0
    Vec4 m_Element5AlphaScreenPosCurve; //0x01F0
    Vec4 m_Element5RotationDistCurve; //0x0200
    Realm m_Realm; //0x0210
    Float32 m_OccluderSize; //0x0214
    SurfaceShaderBaseAsset* m_Element1Shader; //0x0218
    Float32 m_Element1RayDistance; //0x0220
    Vec2 m_Element1Size; //0x0224
    Float32 m_Element1RotationLocal; //0x022C
    Float32 m_Element1RotationDistMultiplier; //0x0230
    char _0x0234[4];
    SurfaceShaderBaseAsset* m_Element2Shader; //0x0238
    Float32 m_Element2RayDistance; //0x0240
    Vec2 m_Element2Size; //0x0244
    Float32 m_Element2RotationLocal; //0x024C
    Float32 m_Element2RotationDistMultiplier; //0x0250
    char _0x0254[4];
    SurfaceShaderBaseAsset* m_Element3Shader; //0x0258
    Float32 m_Element3RayDistance; //0x0260
    Vec2 m_Element3Size; //0x0264
    Float32 m_Element3RotationLocal; //0x026C
    Float32 m_Element3RotationDistMultiplier; //0x0270
    char _0x0274[4];
    SurfaceShaderBaseAsset* m_Element4Shader; //0x0278
    Float32 m_Element4RayDistance; //0x0280
    Vec2 m_Element4Size; //0x0284
    Float32 m_Element4RotationLocal; //0x028C
    Float32 m_Element4RotationDistMultiplier; //0x0290
    char _0x0294[4];
    SurfaceShaderBaseAsset* m_Element5Shader; //0x0298
    Float32 m_Element5RayDistance; //0x02A0
    Vec2 m_Element5Size; //0x02A4
    Float32 m_Element5RotationLocal; //0x02AC
    Float32 m_Element5RotationDistMultiplier; //0x02B0
    Boolean m_Enable; //0x02B4
    Boolean m_DebugDrawOccluder; //0x02B5
    Boolean m_Element1Enable; //0x02B6
    Boolean m_Element1RotationAlignedToRay; //0x02B7
    Boolean m_Element2Enable; //0x02B8
    Boolean m_Element2RotationAlignedToRay; //0x02B9
    Boolean m_Element3Enable; //0x02BA
    Boolean m_Element3RotationAlignedToRay; //0x02BB
    Boolean m_Element4Enable; //0x02BC
    Boolean m_Element4RotationAlignedToRay; //0x02BD
    Boolean m_Element5Enable; //0x02BE
    Boolean m_Element5RotationAlignedToRay; //0x02BF
};//Size=0x02C0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03095
// RuntimeId: 09028
// TypeInfo:  0x00000001428777A0
#ifndef _WindComponentData_
#define _WindComponentData_
#pragma pack(push, 16)
class WindComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline WindComponentData* DefaultInstance()
    {
        return (WindComponentData*) 0x00000000688C4820;
    }
    static __inline unsigned int ClassId()
    {
        return 3095;
    }
    Realm m_Realm; //0x0080
    Float32 m_WindDirection; //0x0084
    Float32 m_WindStrength; //0x0088
    Float32 m_WindVariationMultiplier; //0x008C
    Float32 m_WindVariationRateMultiplier; //0x0090
    Float32 m_WindMicroVariationMultiplier; //0x0094
    Float32 m_TurbulenceMultiplier; //0x0098
    Float32 m_TurbulenceScale; //0x009C
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03088
// RuntimeId: 09026
// TypeInfo:  0x0000000142877800
#ifndef _DynamicEnvmapComponentData_
#define _DynamicEnvmapComponentData_
#pragma pack(push, 16)
class DynamicEnvmapComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline DynamicEnvmapComponentData* DefaultInstance()
    {
        return (DynamicEnvmapComponentData*) 0x00000000688C41A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3088;
    }
    Vec3 m_KeyColorEnvmap; //0x0080
    Vec3 m_SkyColorEnvmap; //0x0090
    Vec3 m_GroundColorEnvmap; //0x00A0
    Realm m_Realm; //0x00B0
    Boolean m_Enable; //0x00B4
    Boolean m_TerrainReflectionsEnable; //0x00B5
    char _0x00B6[10];
};//Size=0x00C0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03080
// RuntimeId: 09024
// TypeInfo:  0x0000000142877860
#ifndef _PlanarReflectionComponentData_
#define _PlanarReflectionComponentData_
#pragma pack(push, 16)
class PlanarReflectionComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline PlanarReflectionComponentData* DefaultInstance()
    {
        return (PlanarReflectionComponentData*) 0x00000000688C3A10;
    }
    static __inline unsigned int ClassId()
    {
        return 3080;
    }
    Vec3 m_KeyColorReflection; //0x0080
    Vec3 m_SkyColorReflection; //0x0090
    Vec3 m_GroundColorReflection; //0x00A0
    Realm m_Realm; //0x00B0
    Float32 m_GroundHeight; //0x00B4
    Float32 m_ViewDistance; //0x00B8
    BlurFilter m_VerticalBlurFilter; //0x00BC
    Float32 m_VerticalDeviation; //0x00C0
    BlurFilter m_HorizontalBlurFilter; //0x00C4
    Float32 m_HorizontalDeviation; //0x00C8
    Boolean m_Enable; //0x00CC
    Boolean m_TerrainReflectionsEnable; //0x00CD
    Boolean m_SkyRenderEnable; //0x00CE
    Boolean m_OverideOutdoorLightColors; //0x00CF
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03090
// RuntimeId: 09022
// TypeInfo:  0x00000001428778C0
#ifndef _SkyComponentData_
#define _SkyComponentData_
#pragma pack(push, 16)
class SkyComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline SkyComponentData* DefaultInstance()
    {
        return (SkyComponentData*) 0x00000000688C4340;
    }
    static __inline unsigned int ClassId()
    {
        return 3090;
    }
    Vec3 m_CloudLayerSunColor; //0x0080
    Vec3 m_CloudLayer1Color; //0x0090
    Vec3 m_CloudLayer2Color; //0x00A0
    Realm m_Realm; //0x00B0
    Float32 m_BrightnessScale; //0x00B4
    TextureAsset* m_SkyGradientTexture; //0x00B8
    Float32 m_SunSize; //0x00C0
    Float32 m_SunScale; //0x00C4
    Float32 m_PanoramicUVMinX; //0x00C8
    Float32 m_PanoramicUVMaxX; //0x00CC
    Float32 m_PanoramicUVMinY; //0x00D0
    Float32 m_PanoramicUVMaxY; //0x00D4
    Float32 m_PanoramicTileFactor; //0x00D8
    Float32 m_PanoramicRotation; //0x00DC
    TextureAsset* m_PanoramicTexture; //0x00E0
    TextureAsset* m_PanoramicAlphaTexture; //0x00E8
    TextureAsset* m_CloudLayerMaskTexture; //0x00F0
    Float32 m_CloudLayer1Altitude; //0x00F8
    Float32 m_CloudLayer1TileFactor; //0x00FC
    Float32 m_CloudLayer1Rotation; //0x0100
    Float32 m_CloudLayer1Speed; //0x0104
    Float32 m_CloudLayer1SunLightIntensity; //0x0108
    Float32 m_CloudLayer1SunLightPower; //0x010C
    Float32 m_CloudLayer1AmbientLightIntensity; //0x0110
    Float32 m_CloudLayer1AlphaMul; //0x0114
    TextureAsset* m_CloudLayer1Texture; //0x0118
    Float32 m_CloudLayer2Altitude; //0x0120
    Float32 m_CloudLayer2TileFactor; //0x0124
    Float32 m_CloudLayer2Rotation; //0x0128
    Float32 m_CloudLayer2Speed; //0x012C
    Float32 m_CloudLayer2SunLightIntensity; //0x0130
    Float32 m_CloudLayer2SunLightPower; //0x0134
    Float32 m_CloudLayer2AmbientLightIntensity; //0x0138
    Float32 m_CloudLayer2AlphaMul; //0x013C
    TextureAsset* m_CloudLayer2Texture; //0x0140
    TextureAsset* m_StaticEnvmapTexture; //0x0148
    Float32 m_StaticEnvmapScale; //0x0150
    Float32 m_SkyEnvmap8BitTexScale; //0x0154
    TextureAsset* m_CustomEnvmapTexture; //0x0158
    Float32 m_CustomEnvmapScale; //0x0160
    Float32 m_CustomEnvmapAmbient; //0x0164
    Float32 m_SkyVisibilityExponent; //0x0168
    Boolean m_Enable; //0x016C
    Boolean m_IndirectCubeMapOverride; //0x016D
    char _0x016E[2];
};//Size=0x0170
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03078
// RuntimeId: 09020
// TypeInfo:  0x0000000142877920
#ifndef _FogComponentData_
#define _FogComponentData_
#pragma pack(push, 16)
class FogComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline FogComponentData* DefaultInstance()
    {
        return (FogComponentData*) 0x00000000688C35E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3078;
    }
    Vec4 m_Curve; //0x0080
    Vec3 m_FogColor; //0x0090
    Vec4 m_FogColorCurve; //0x00A0
    Vec4 m_TransparencyFadeCurve; //0x00B0
    Vec3 m_ForwardLightScatteringColor; //0x00C0
    Realm m_Realm; //0x00D0
    Float32 m_FogDistanceMultiplier; //0x00D4
    Float32 m_Start; //0x00D8
    Float32 m_End; //0x00DC
    Float32 m_FogColorStart; //0x00E0
    Float32 m_FogColorEnd; //0x00E4
    Float32 m_TransparencyFadeStart; //0x00E8
    Float32 m_TransparencyFadeEnd; //0x00EC
    Float32 m_TransparencyFadeClamp; //0x00F0
    Float32 m_ForwardLightScatteringPhaseG; //0x00F4
    Float32 m_ForwardLightScatteringStrength; //0x00F8
    Float32 m_ForwardLightScatteringPresence; //0x00FC
    Float32 m_ForwardLightScatteringMaxBlurLength; //0x0100
    Float32 m_ForwardLightScatteringExtinction; //0x0104
    Float32 m_ForwardLightScatteringSmoothness; //0x0108
    Float32 m_HeightFogFollowCamera; //0x010C
    Float32 m_HeightFogAltitude; //0x0110
    Float32 m_HeightFogDepth; //0x0114
    Float32 m_HeightFogVisibilityRange; //0x0118
    Boolean m_Enable; //0x011C
    Boolean m_FogGradientEnable; //0x011D
    Boolean m_FogColorEnable; //0x011E
    Boolean m_ForwardLightScatteringEnabled; //0x011F
    Boolean m_HeightFogEnable; //0x0120
    char _0x0121[15];
};//Size=0x0130
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03075
// RuntimeId: 09018
// TypeInfo:  0x0000000142877980
#ifndef _OutdoorLightComponentData_
#define _OutdoorLightComponentData_
#pragma pack(push, 16)
class OutdoorLightComponentData : public VisualEnvironmentComponentData
{
public:
    static __inline OutdoorLightComponentData* DefaultInstance()
    {
        return (OutdoorLightComponentData*) 0x00000000688C32B0;
    }
    static __inline unsigned int ClassId()
    {
        return 3075;
    }
    Vec3 m_SunColor; //0x0080
    Vec3 m_SkyColor; //0x0090
    Vec3 m_GroundColor; //0x00A0
    Realm m_Realm; //0x00B0
    Float32 m_SunRotationX; //0x00B4
    Float32 m_SunRotationY; //0x00B8
    Float32 m_ShadowSunRotationX; //0x00BC
    Float32 m_ShadowSunRotationY; //0x00C0
    Float32 m_SkyLightAngleFactor; //0x00C4
    Float32 m_SunSpecularScale; //0x00C8
    Float32 m_SkyEnvmapShadowScale; //0x00CC
    Float32 m_SunShadowHeightScale; //0x00D0
    char _0x00D4[4];
    TextureAsset* m_CloudShadowTexture; //0x00D8
    Vec2 m_CloudShadowSpeed; //0x00E0
    Float32 m_CloudShadowSize; //0x00E8
    Float32 m_CloudShadowCoverage; //0x00EC
    Float32 m_CloudShadowExponent; //0x00F0
    Float32 m_CloudShadowStartFade; //0x00F4
    Float32 m_CloudShadowsFadeDistance; //0x00F8
    Vec2 m_CloudXZTranslation; //0x00FC
    TextureAddress m_CloudShadowAddressingMode; //0x0104
    Float32 m_TranslucencyAmbient; //0x0108
    Float32 m_TranslucencyScale; //0x010C
    Float32 m_TranslucencyPower; //0x0110
    Float32 m_TranslucencyDistortion; //0x0114
    Boolean m_Enable; //0x0118
    Boolean m_ShadowSunRotationEnable; //0x0119
    Boolean m_CloudShadowEnable; //0x011A
    Boolean m_CloudShadowIsTopDown; //0x011B
    char _0x011C[4];
};//Size=0x0120
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02899
// RuntimeId: 04970
// TypeInfo:  0x000000014281F3B0
#ifndef _TimelineTrackData_
#define _TimelineTrackData_
#pragma pack(push, 8)
class TimelineTrackData : public GameObjectData
{
public:
    static __inline TimelineTrackData* DefaultInstance()
    {
        return (TimelineTrackData*) 0x00000000688BB970;
    }
    static __inline unsigned int ClassId()
    {
        return 2899;
    }
    Array<TimelineTrackDataConditionsBase*> m_Conditions; //0x0018
    Boolean m_ExposePins; //0x0020
    Boolean m_IsDisabled; //0x0021
    Boolean m_DependsOnAnimation; //0x0022
    char _0x0023[5];
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03360
// RuntimeId: 09014
// TypeInfo:  0x0000000142877A40
#ifndef _RenderFramesKeyframe_
#define _RenderFramesKeyframe_
#pragma pack(push, 8)
class RenderFramesKeyframe : public DataContainer
{
public:
    static __inline RenderFramesKeyframe* DefaultInstance()
    {
        return (RenderFramesKeyframe*) 0x00000000688CD1E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3360;
    }
    Float32 m_Time; //0x0010
    Float32 m_Length; //0x0014
    CString m_RenderFileName; //0x0018
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03417
// RuntimeId: 09012
// TypeInfo:  0x0000000142877AA0
#ifndef _OcclusionSettings_
#define _OcclusionSettings_
#pragma pack(push, 8)
class OcclusionSettings : public DataContainer
{
public:
    static __inline OcclusionSettings* DefaultInstance()
    {
        return (OcclusionSettings*) 0x00000000688CE610;
    }
    static __inline unsigned int ClassId()
    {
        return 3417;
    }
    Boolean m_Enable; //0x0010
    Boolean m_CoverageEnable; //0x0011
    Boolean m_DrawShadowZbuffer; //0x0012
    Boolean m_DrawZbuffer; //0x0013
    Boolean m_DrawSplitView; //0x0014
    Boolean m_DrawBinaryBuffer; //0x0015
    Boolean m_DrawCoverageBuffer; //0x0016
    char _0x0017[1];
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02543
// RuntimeId: 09010
// TypeInfo:  0x0000000142877B00
#ifndef _MeshProxyEntityData_
#define _MeshProxyEntityData_
#pragma pack(push, 16)
class MeshProxyEntityData : public SpatialEntityData
{
public:
    static __inline MeshProxyEntityData* DefaultInstance()
    {
        return (MeshProxyEntityData*) 0x00000000688AEB10;
    }
    static __inline unsigned int ClassId()
    {
        return 2543;
    }
    MeshAsset* m_Mesh; //0x0060
    Array<LinearTransform> m_BasePoseTransforms; //0x0068
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02415
// RuntimeId: 09008
// TypeInfo:  0x0000000142877B60
#ifndef _OccluderMeshEntityData_
#define _OccluderMeshEntityData_
#pragma pack(push, 16)
class OccluderMeshEntityData : public SpatialEntityData
{
public:
    static __inline OccluderMeshEntityData* DefaultInstance()
    {
        return (OccluderMeshEntityData*) 0x00000000688A7560;
    }
    static __inline unsigned int ClassId()
    {
        return 2415;
    }
    RigidMeshAsset* m_Mesh; //0x0060
    char _0x0068[8];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02497
// RuntimeId: 09006
// TypeInfo:  0x0000000142877BC0
#ifndef _IndirectCubeMapData_
#define _IndirectCubeMapData_
#pragma pack(push, 16)
class IndirectCubeMapData : public SpatialEntityData
{
public:
    static __inline IndirectCubeMapData* DefaultInstance()
    {
        return (IndirectCubeMapData*) 0x00000000688AC9B0;
    }
    static __inline unsigned int ClassId()
    {
        return 2497;
    }
    Uint32 m_Resolution; //0x0060
    Float32 m_Scale; //0x0064
    Float32 m_FadeDistance; //0x0068
    Boolean m_Enable; //0x006C
    char _0x006D[3];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02494
// RuntimeId: 09004
// TypeInfo:  0x0000000142877C20
#ifndef _LightProbeVolumeData_
#define _LightProbeVolumeData_
#pragma pack(push, 16)
class LightProbeVolumeData : public SpatialEntityData
{
public:
    static __inline LightProbeVolumeData* DefaultInstance()
    {
        return (LightProbeVolumeData*) 0x00000000688AC7E0;
    }
    static __inline unsigned int ClassId()
    {
        return 2494;
    }
    Uint32 m_Xres; //0x0060
    Uint32 m_Yres; //0x0064
    Uint32 m_Zres; //0x0068
    Float32 m_BlendDistance; //0x006C
    Int32 m_Priority; //0x0070
    char _0x0074[12];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02506
// RuntimeId: 08998
// TypeInfo:  0x0000000142877D40
#ifndef _LocalLightEntityData_
#define _LocalLightEntityData_
#pragma pack(push, 16)
class LocalLightEntityData : public SpatialEntityData
{
public:
    static __inline LocalLightEntityData* DefaultInstance()
    {
        return (LocalLightEntityData*) 0x00000000688ACEC0;
    }
    static __inline unsigned int ClassId()
    {
        return 2506;
    }
    Vec3 m_Color; //0x0060
    Vec3 m_EnlightenColorScale; //0x0070
    Vec3 m_ParticleColorScale; //0x0080
    Float32 m_Radius; //0x0090
    Float32 m_Intensity; //0x0094
    Float32 m_AttenuationOffset; //0x0098
    EnlightenColorMode m_EnlightenColorMode; //0x009C
    Boolean m_Visible; //0x00A0
    Boolean m_DirectLightEnable; //0x00A1
    Boolean m_SpecularEnable; //0x00A2
    Boolean m_EnlightenEnable; //0x00A3
    char _0x00A4[12];
};//Size=0x00B0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02507
// RuntimeId: 09000
// TypeInfo:  0x0000000142877CE0
#ifndef _PointLightEntityData_
#define _PointLightEntityData_
#pragma pack(push, 16)
class PointLightEntityData : public LocalLightEntityData
{
public:
    static __inline PointLightEntityData* DefaultInstance()
    {
        return (PointLightEntityData*) 0x00000000688ACF90;
    }
    static __inline unsigned int ClassId()
    {
        return 2507;
    }
    Float32 m_Width; //0x00B0
    Float32 m_TranslucencyAmbient; //0x00B4
    Float32 m_TranslucencyScale; //0x00B8
    Float32 m_TranslucencyPower; //0x00BC
    Float32 m_TranslucencyDistortion; //0x00C0
    char _0x00C4[12];
};//Size=0x00D0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02508
// RuntimeId: 09002
// TypeInfo:  0x0000000142877C80
#ifndef _SpotLightEntityData_
#define _SpotLightEntityData_
#pragma pack(push, 16)
class SpotLightEntityData : public LocalLightEntityData
{
public:
    static __inline SpotLightEntityData* DefaultInstance()
    {
        return (SpotLightEntityData*) 0x00000000688AD080;
    }
    static __inline unsigned int ClassId()
    {
        return 2508;
    }
    SpotLightShape m_Shape; //0x00B0
    Float32 m_ConeInnerAngle; //0x00B4
    Float32 m_ConeOuterAngle; //0x00B8
    Float32 m_FrustumFov; //0x00BC
    Float32 m_FrustumAspect; //0x00C0
    Float32 m_OrthoWidth; //0x00C4
    Float32 m_OrthoHeight; //0x00C8
    Float32 m_NearPlane; //0x00CC
    TextureAsset* m_Texture; //0x00D0
    QualityScalableEnabled m_CastShadows; //0x00D8
    Float32 m_ShadowRadius; //0x00DC
    Float32 m_ShadowCullDistance; //0x00E0
    QualityScalableEnabled m_FrustumAsCone; //0x00E4
    Float32 m_FrustumAsConeIntensityScale; //0x00E8
    QualityLevel m_CastShadowsMinLevel; //0x00EC
    Boolean m_FrustumAsConeAngle; //0x00F0
    Boolean m_CastShadowsEnable; //0x00F1
    char _0x00F2[14];
};//Size=0x0100
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02529
// RuntimeId: 08994
// TypeInfo:  0x0000000142877DA0
#ifndef _LensFlareEntityData_
#define _LensFlareEntityData_
#pragma pack(push, 16)
class LensFlareEntityData : public SpatialEntityData
{
public:
    static __inline LensFlareEntityData* DefaultInstance()
    {
        return (LensFlareEntityData*) 0x00000000688ADF50;
    }
    static __inline unsigned int ClassId()
    {
        return 2529;
    }
    Float32 m_OccluderSize; //0x0060
    Float32 m_DepthBias; //0x0064
    Array<LensFlareElement> m_Elements; //0x0068
    Boolean m_Visible; //0x0070
    Boolean m_DebugDrawOccluder; //0x0071
    Boolean m_HalfRes; //0x0072
    char _0x0073[13];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02503
// RuntimeId: 08990
// TypeInfo:  0x0000000142877E00
#ifndef _GroundHeightEntityData_
#define _GroundHeightEntityData_
#pragma pack(push, 16)
class GroundHeightEntityData : public SpatialEntityData
{
public:
    static __inline GroundHeightEntityData* DefaultInstance()
    {
        return (GroundHeightEntityData*) 0x00000000688ACD10;
    }
    static __inline unsigned int ClassId()
    {
        return 2503;
    }
    GroundHeightData m_Data; //0x0060
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02500
// RuntimeId: 08986
// TypeInfo:  0x0000000142877E60
#ifndef _PlanarReflectionLocatorEntityData_
#define _PlanarReflectionLocatorEntityData_
#pragma pack(push, 16)
class PlanarReflectionLocatorEntityData : public SpatialEntityData
{
public:
    static __inline PlanarReflectionLocatorEntityData* DefaultInstance()
    {
        return (PlanarReflectionLocatorEntityData*) 0x00000000688ACB50;
    }
    static __inline unsigned int ClassId()
    {
        return 2500;
    }
    Boolean m_Enable; //0x0060
    char _0x0061[15];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02495
// RuntimeId: 08984
// TypeInfo:  0x0000000142877EC0
#ifndef _DynamicEnvmapEntityData_
#define _DynamicEnvmapEntityData_
#pragma pack(push, 16)
class DynamicEnvmapEntityData : public SpatialEntityData
{
public:
    static __inline DynamicEnvmapEntityData* DefaultInstance()
    {
        return (DynamicEnvmapEntityData*) 0x00000000688AC880;
    }
    static __inline unsigned int ClassId()
    {
        return 2495;
    }
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02509
// RuntimeId: 08982
// TypeInfo:  0x0000000142877F20
#ifndef _RadiosityModifierEntityData_
#define _RadiosityModifierEntityData_
#pragma pack(push, 16)
class RadiosityModifierEntityData : public SpatialEntityData
{
public:
    static __inline RadiosityModifierEntityData* DefaultInstance()
    {
        return (RadiosityModifierEntityData*) 0x00000000688AD1A0;
    }
    static __inline unsigned int ClassId()
    {
        return 2509;
    }
    Float32 m_BounceScale; //0x0060
    Float32 m_SunScale; //0x0064
    char _0x0068[8];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02238
// RuntimeId: 08980
// TypeInfo:  0x0000000142877F80
#ifndef _RadiosityMaterialEntityData_
#define _RadiosityMaterialEntityData_
#pragma pack(push, 16)
class RadiosityMaterialEntityData : public EntityData
{
public:
    static __inline RadiosityMaterialEntityData* DefaultInstance()
    {
        return (RadiosityMaterialEntityData*) 0x00000000688A31A0;
    }
    static __inline unsigned int ClassId()
    {
        return 2238;
    }
    ObjectBlueprint* m_Blueprint; //0x0018
    Vec3 m_Color; //0x0020
    Uint64 m_MaterialId; //0x0030
    Boolean m_Emissive; //0x0038
    char _0x0039[7];
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02871
// RuntimeId: 08974
// TypeInfo:  0x00000001428780A0
#ifndef _EnlightenEntityData_
#define _EnlightenEntityData_
#pragma pack(push, 8)
class EnlightenEntityData : public EntityData
{
public:
    static __inline EnlightenEntityData* DefaultInstance()
    {
        return (EnlightenEntityData*) 0x00000000688BB010;
    }
    static __inline unsigned int ClassId()
    {
        return 2871;
    }
    Int32 m_Priority; //0x0018
    Realm m_Realm; //0x001C
    Boolean m_Enable; //0x0020
    char _0x0021[7];
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02872
// RuntimeId: 08976
// TypeInfo:  0x0000000142878040
#ifndef _DynamicEnlightenEntityData_
#define _DynamicEnlightenEntityData_
#pragma pack(push, 8)
class DynamicEnlightenEntityData : public EnlightenEntityData
{
public:
    static __inline DynamicEnlightenEntityData* DefaultInstance()
    {
        return (DynamicEnlightenEntityData*) 0x00000000688BB050;
    }
    static __inline unsigned int ClassId()
    {
        return 2872;
    }
    EnlightenDataAsset* m_EnlightenData; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02873
// RuntimeId: 08978
// TypeInfo:  0x0000000142877FE0
#ifndef _StaticEnlightenEntityData_
#define _StaticEnlightenEntityData_
#pragma pack(push, 8)
class StaticEnlightenEntityData : public EnlightenEntityData
{
public:
    static __inline StaticEnlightenEntityData* DefaultInstance()
    {
        return (StaticEnlightenEntityData*) 0x00000000688BB0A0;
    }
    static __inline unsigned int ClassId()
    {
        return 2873;
    }
    StaticEnlightenData* m_EnlightenData; //0x0028
    EnlightenDataAsset* m_DynamicEnlightenData; //0x0030
    ObjectBlueprint* m_VisualEnvironment; //0x0038
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02267
// RuntimeId: 08972
// TypeInfo:  0x0000000142878100
#ifndef _RadiosityEntityData_
#define _RadiosityEntityData_
#pragma pack(push, 8)
class RadiosityEntityData : public EntityData
{
public:
    static __inline RadiosityEntityData* DefaultInstance()
    {
        return (RadiosityEntityData*) 0x00000000688A3C30;
    }
    static __inline unsigned int ClassId()
    {
        return 2267;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02471
// RuntimeId: 08966
// TypeInfo:  0x0000000142878220
#ifndef _RenderVolumeEntityData_
#define _RenderVolumeEntityData_
#pragma pack(push, 16)
class RenderVolumeEntityData : public SpatialEntityData
{
public:
    static __inline RenderVolumeEntityData* DefaultInstance()
    {
        return (RenderVolumeEntityData*) 0x00000000688AB620;
    }
    static __inline unsigned int ClassId()
    {
        return 2471;
    }
    Vec4 m_UserMasks; //0x0060
    SurfaceShaderInstanceDataStruct m_Shader; //0x0070
    RenderVolumeTransformType m_TransformType; //0x0098
    Boolean m_Enabled; //0x009C
    char _0x009D[3];
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02473
// RuntimeId: 08968
// TypeInfo:  0x00000001428781C0
#ifndef _DecalVolumeEntityData_
#define _DecalVolumeEntityData_
#pragma pack(push, 16)
class DecalVolumeEntityData : public RenderVolumeEntityData
{
public:
    static __inline DecalVolumeEntityData* DefaultInstance()
    {
        return (DecalVolumeEntityData*) 0x00000000688AB7C0;
    }
    static __inline unsigned int ClassId()
    {
        return 2473;
    }
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02472
// RuntimeId: 09891
// TypeInfo:  0x000000014288B0A0
#ifndef _DecalRibbonEntityData_
#define _DecalRibbonEntityData_
#pragma pack(push, 16)
class DecalRibbonEntityData : public RenderVolumeEntityData
{
public:
    static __inline DecalRibbonEntityData* DefaultInstance()
    {
        return (DecalRibbonEntityData*) 0x00000000688AB6E0;
    }
    static __inline unsigned int ClassId()
    {
        return 2472;
    }
    Float32 m_RibbonWidth; //0x00A0
    Float32 m_RibbonHeight; //0x00A4
    Array<Vec3> m_Points; //0x00A8
    Float32 m_RibbonOffset; //0x00B0
    char _0x00B4[12];
};//Size=0x00C0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02417
// RuntimeId: 08962
// TypeInfo:  0x0000000142878280
#ifndef _OccluderVolumeEntityData_
#define _OccluderVolumeEntityData_
#pragma pack(push, 16)
class OccluderVolumeEntityData : public SpatialEntityData
{
public:
    static __inline OccluderVolumeEntityData* DefaultInstance()
    {
        return (OccluderVolumeEntityData*) 0x00000000688A76B0;
    }
    static __inline unsigned int ClassId()
    {
        return 2417;
    }
    Float32 m_CoverageValue; //0x0060
    Boolean m_OccluderHighPriority; //0x0064
    Boolean m_OccluderIsConservative; //0x0065
    Boolean m_Visible; //0x0066
    char _0x0067[9];
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02410
// RuntimeId: 05296
// TypeInfo:  0x0000000142821450
#ifndef _LocalWindForceEntityBaseData_
#define _LocalWindForceEntityBaseData_
#pragma pack(push, 16)
class LocalWindForceEntityBaseData : public SpatialEntityData
{
public:
    static __inline LocalWindForceEntityBaseData* DefaultInstance()
    {
        return (LocalWindForceEntityBaseData*) 0x00000000688A71E0;
    }
    static __inline unsigned int ClassId()
    {
        return 2410;
    }
    Float32 m_Strength; //0x0060
    Float32 m_Variation; //0x0064
    Float32 m_VariationRate; //0x0068
    Float32 m_MicroVariation; //0x006C
    Float32 m_Hardness; //0x0070
    Float32 m_ForceAsInstantVelocity; //0x0074
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03723
// RuntimeId: 08958
// TypeInfo:  0x0000000142878340
#ifndef _EnlightenState_
#define _EnlightenState_
#pragma pack(push, 16)
class EnlightenState : public DataContainer
{
public:
    static __inline EnlightenState* DefaultInstance()
    {
        return (EnlightenState*) 0x00000000688D5000;
    }
    static __inline unsigned int ClassId()
    {
        return 3723;
    }
    Float32 m_BounceScale; //0x0010
    Float32 m_SunScale; //0x0014
    char _0x0018[8];
    Vec3 m_SkyBoxSkyColor; //0x0020
    Vec3 m_SkyBoxGroundColor; //0x0030
    Vec3 m_SkyBoxSunLightColor; //0x0040
    Vec3 m_SkyBoxBackLightColor; //0x0050
    Float32 m_OutputScale; //0x0060
    Float32 m_SkyBoxSunLightColorSize; //0x0064
    Float32 m_SkyBoxBackLightColorSize; //0x0068
    Float32 m_SkyBoxBackLightRotationX; //0x006C
    Float32 m_SkyBoxBackLightRotationY; //0x0070
    Boolean m_SkyBoxEnable; //0x0074
    char _0x0075[11];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01554
// RuntimeId: 08956
// TypeInfo:  0x00000001428783A0
#ifndef _EnlightenRuntimeConfig_
#define _EnlightenRuntimeConfig_
#pragma pack(push, 8)
class EnlightenRuntimeConfig : public Asset
{
public:
    static __inline EnlightenRuntimeConfig* DefaultInstance()
    {
        return (EnlightenRuntimeConfig*) 0x0000000068893B20;
    }
    static __inline unsigned int ClassId()
    {
        return 1554;
    }
    Uint32 m_JobCount; //0x0018
    char _0x001C[4];
};//Size=0x0020
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03804
// RuntimeId: 08954
// TypeInfo:  0x0000000142878400
#ifndef _EnlightenRuntimeSettings_
#define _EnlightenRuntimeSettings_
#pragma pack(push, 16)
class EnlightenRuntimeSettings : public SystemSettings
{
public:
    static __inline EnlightenRuntimeSettings* DefaultInstance()
    {
        return (EnlightenRuntimeSettings*) 0x00000000688D74C0;
    }
    static __inline unsigned int ClassId()
    {
        return 3804;
    }
    Vec3 m_AlbedoDefaultColor; //0x0020
    Float32 m_TemporalCoherenceThreshold; //0x0030
    Float32 m_SkyBoxScale; //0x0034
    Float32 m_MaxPerFrameSolveTime; //0x0038
    Uint32 m_MinSystemUpdateCount; //0x003C
    Uint32 m_JobCount; //0x0040
    Uint32 m_CubeMapMaxUpdateCount; //0x0044
    Uint32 m_CubeMapConvolutionSampleCount; //0x0048
    Float32 m_CubeMapForceGlobalScale; //0x004C
    Uint32 m_LightProbeMaxSourceSolveCount; //0x0050
    Uint32 m_LightProbeMaxInstanceUpdateCount; //0x0054
    Uint32 m_LightProbeLookupTableGridRes; //0x0058
    Float32 m_LocalLightForceRadius; //0x005C
    Int32 m_DrawDebugSystemDependenciesEnable; //0x0060
    Int32 m_DrawDebugSystemBoundingBoxEnable; //0x0064
    Float32 m_DrawDebugLightProbeSize; //0x0068
    Boolean m_Enable; //0x006C
    Boolean m_ForceDynamic; //0x006D
    Boolean m_ForceUpdateStaticLightingBuffersEnable; //0x006E
    Boolean m_AllowLightmapTextureOverride; //0x006F
    Boolean m_SaveRadiosityTexturesEnable; //0x0070
    Boolean m_JobsEnable; //0x0071
    Boolean m_ShadowsEnable; //0x0072
    Boolean m_SpotLightShadowsEnable; //0x0073
    Boolean m_CubeMapsEnable; //0x0074
    Boolean m_CubeMapMip0OnlyEnable; //0x0075
    Boolean m_CubeMapCpuMipMapGenerationEnable; //0x0076
    Boolean m_CubeMapConvolutionEnable; //0x0077
    Boolean m_CompensateSunShadowHeightScale; //0x0078
    Boolean m_LightMapsEnable; //0x0079
    Boolean m_LightProbeEnable; //0x007A
    Boolean m_LightProbeNewSamplingEnable; //0x007B
    Boolean m_LightProbeForceUpdate; //0x007C
    Boolean m_LightProbeJobsEnable; //0x007D
    Boolean m_LocalLightsEnable; //0x007E
    Boolean m_LocalLightCullingEnable; //0x007F
    Boolean m_LocalLightCustumFalloff; //0x0080
    Boolean m_DrawDebugCubeMaps; //0x0081
    Boolean m_DrawDebugEntities; //0x0082
    Boolean m_DrawDebugSystemsEnable; //0x0083
    Boolean m_DrawDebugLightProbes; //0x0084
    Boolean m_DrawDebugLightProbeGrid; //0x0085
    Boolean m_DrawDebugLightProbeOcclusion; //0x0086
    Boolean m_DrawDebugLightProbeStats; //0x0087
    Boolean m_DrawDebugLightProbeBoundingBoxes; //0x0088
    Boolean m_DrawSolveTaskPerformance; //0x0089
    Boolean m_DrawDebugColoringEnable; //0x008A
    Boolean m_DrawDebugTextures; //0x008B
    Boolean m_DrawDebugBackFaces; //0x008C
    Boolean m_DrawDebugTargetMeshes; //0x008D
    Boolean m_DrawWarningsEnable; //0x008E
    Boolean m_AlbedoForceUpdateEnable; //0x008F
    Boolean m_AlbedoForceColorEnable; //0x0090
    Boolean m_TerrainMapEnable; //0x0091
    Boolean m_EmissiveEnable; //0x0092
    char _0x0093[13];
};//Size=0x00A0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03003
// RuntimeId: 08952
// TypeInfo:  0x0000000142878460
#ifndef _DestructionVolumeComponentData_
#define _DestructionVolumeComponentData_
#pragma pack(push, 16)
class DestructionVolumeComponentData : public GameComponentData
{
public:
    static __inline DestructionVolumeComponentData* DefaultInstance()
    {
        return (DestructionVolumeComponentData*) 0x00000000688BEE80;
    }
    static __inline unsigned int ClassId()
    {
        return 3003;
    }
    DestructionVolumeData* m_DestructionVolumeData; //0x0070
    char _0x0078[8];
};//Size=0x0080
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03704
// RuntimeId: 08950
// TypeInfo:  0x00000001428784C0
#ifndef _DestructionVolumeData_
#define _DestructionVolumeData_
#pragma pack(push, 16)
class DestructionVolumeData : public DataContainer
{
public:
    static __inline DestructionVolumeData* DefaultInstance()
    {
        return (DestructionVolumeData*) 0x00000000688D4AD0;
    }
    static __inline unsigned int ClassId()
    {
        return 3704;
    }
    DestructionVolumeAsset* m_Asset; //0x0010
    Array<Vec4> m_Impacts; //0x0018
    AxisAlignedBox m_BoundingBox; //0x0020
    Array<Uint32> m_PartToImpactIndices; //0x0040
    char _0x0048[8];
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   01553
// RuntimeId: 08948
// TypeInfo:  0x0000000142878520
#ifndef _DestructionVolumeAsset_
#define _DestructionVolumeAsset_
#pragma pack(push, 8)
class DestructionVolumeAsset : public Asset
{
public:
    static __inline DestructionVolumeAsset* DefaultInstance()
    {
        return (DestructionVolumeAsset*) 0x0000000068893AD0;
    }
    static __inline unsigned int ClassId()
    {
        return 1553;
    }
    TextureAsset* m_DiffuseAtlas; //0x0018
    TextureAsset* m_NormalmapAtlas; //0x0020
    Float32 m_AtlasTextureScale; //0x0028
    char _0x002C[4];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03770
// RuntimeId: 08946
// TypeInfo:  0x0000000142878580
#ifndef _DestructionVolumeSettings_
#define _DestructionVolumeSettings_
#pragma pack(push, 8)
class DestructionVolumeSettings : public DataContainer
{
public:
    static __inline DestructionVolumeSettings* DefaultInstance()
    {
        return (DestructionVolumeSettings*) 0x00000000688D5BD0;
    }
    static __inline unsigned int ClassId()
    {
        return 3770;
    }
    Float32 m_PixelsPerMeter; //0x0010
    Float32 m_DistanceFieldMultiplier; //0x0014
    Int32 m_TexturePoolSize; //0x0018
    Int32 m_TexturePoolHeadroomSize; //0x001C
    Int32 m_TexturePoolDefragTransferLimit; //0x0020
    Boolean m_JobsEnable; //0x0024
    Boolean m_ForceUpdateEnable; //0x0025
    Boolean m_DrawDebugVolumes; //0x0026
    Boolean m_DrawDebugImpacts; //0x0027
    Boolean m_DrawDebugTexturePool; //0x0028
    char _0x0029[7];
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00655
// RuntimeId: 08944
// TypeInfo:  0x0000000142874B80
#ifndef _ClientVisibleAreaEntity_
#define _ClientVisibleAreaEntity_
class ClientVisibleAreaEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 655;
    }
    char _0x0028[32];
};//Size=0x0048
#endif

////////////////////////////////////////
// ClassId:   00625
// RuntimeId: 08943
// TypeInfo:  0x0000000142874C20
#ifndef _StaticEnlightenEntity_
#define _StaticEnlightenEntity_
class StaticEnlightenEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 625;
    }
    char _0x0020[80];
};//Size=0x0070
#endif

////////////////////////////////////////
// ClassId:   00094
// RuntimeId: 08942
// TypeInfo:  0x00000001428749A0
#ifndef _RigidMeshEntity_
#define _RigidMeshEntity_
class RigidMeshEntity : public MeshEntityBase
{
public:
    static __inline unsigned int ClassId()
    {
        return 94;
    }
    char _0x0008[120];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00095
// RuntimeId: 09093
// TypeInfo:  0x0000000142878810
#ifndef _CompositeMeshEntity_
#define _CompositeMeshEntity_
class CompositeMeshEntity : public MeshEntityBase
{
public:
    static __inline unsigned int ClassId()
    {
        return 95;
    }
    char _0x0008[136];
};//Size=0x0090
#endif

////////////////////////////////////////
// ClassId:   01322
// RuntimeId: 08940
// TypeInfo:  0x0000000142874CC0
#ifndef _RadiosityModifierEntity_
#define _RadiosityModifierEntity_
class RadiosityModifierEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1322;
    }
    char _0x0020[144];
};//Size=0x00B0
#endif

////////////////////////////////////////
// ClassId:   00633
// RuntimeId: 08939
// TypeInfo:  0x0000000142874D60
#ifndef _RadiosityMaterialEntity_
#define _RadiosityMaterialEntity_
class RadiosityMaterialEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 633;
    }
    char _0x0020[96];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00864
// RuntimeId: 08936
// TypeInfo:  0x0000000142874E00
#ifndef _LocalLightEntity_
#define _LocalLightEntity_
class LocalLightEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 864;
    }
    char _0x0020[192];
};//Size=0x00E0
#endif

////////////////////////////////////////
// ClassId:   00866
// RuntimeId: 08937
// TypeInfo:  0x0000000142874AE0
#ifndef _PointLightEntity_
#define _PointLightEntity_
class PointLightEntity : public LocalLightEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 866;
    }
};//Size=0x00E0
#endif

////////////////////////////////////////
// ClassId:   00865
// RuntimeId: 08938
// TypeInfo:  0x0000000142874A40
#ifndef _SpotLightEntity_
#define _SpotLightEntity_
class SpotLightEntity : public LocalLightEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 865;
    }
    char _0x00E0[32];
};//Size=0x0100
#endif

////////////////////////////////////////
// ClassId:   01171
// RuntimeId: 08935
// TypeInfo:  0x0000000142874EA0
#ifndef _PlanarReflectionLocatorEntity_
#define _PlanarReflectionLocatorEntity_
class PlanarReflectionLocatorEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1171;
    }
    char _0x0020[112];
};//Size=0x0090
#endif

////////////////////////////////////////
// ClassId:   01236
// RuntimeId: 08934
// TypeInfo:  0x0000000142874F40
#ifndef _OccluderVolumeEntity_
#define _OccluderVolumeEntity_
class OccluderVolumeEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1236;
    }
    char _0x0020[96];
};//Size=0x0080
#endif

////////////////////////////////////////
// ClassId:   00926
// RuntimeId: 08933
// TypeInfo:  0x0000000142874FE0
#ifndef _OccluderMeshEntity_
#define _OccluderMeshEntity_
class OccluderMeshEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 926;
    }
    char _0x0020[24];
};//Size=0x0038
#endif

////////////////////////////////////////
// ClassId:   00763
// RuntimeId: 08932
// TypeInfo:  0x0000000142875080
#ifndef _MeshProxyEntity_
#define _MeshProxyEntity_
class MeshProxyEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 763;
    }
    char _0x0028[152];
};//Size=0x00C0
#endif

////////////////////////////////////////
// ClassId:   01312
// RuntimeId: 08931
// TypeInfo:  0x0000000142875120
#ifndef _MaskVolumeEntity_
#define _MaskVolumeEntity_
class MaskVolumeEntity : public RenderVolumeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1312;
    }
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   01313
// RuntimeId: 08930
// TypeInfo:  0x00000001428751C0
#ifndef _DecalVolumeEntity_
#define _DecalVolumeEntity_
class DecalVolumeEntity : public RenderVolumeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1313;
    }
};//Size=0x00A0
#endif

////////////////////////////////////////
// ClassId:   01311
// RuntimeId: 09887
// TypeInfo:  0x000000014288B260
#ifndef _DecalRibbonEntity_
#define _DecalRibbonEntity_
class DecalRibbonEntity : public RenderVolumeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1311;
    }
    char _0x00A0[112];
};//Size=0x0110
#endif

////////////////////////////////////////
// ClassId:   01333
// RuntimeId: 08928
// TypeInfo:  0x0000000142875300
#ifndef _LightProbeVolumeEntity_
#define _LightProbeVolumeEntity_
class LightProbeVolumeEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1333;
    }
    char _0x0020[64];
};//Size=0x0060
#endif

////////////////////////////////////////
// ClassId:   00881
// RuntimeId: 08927
// TypeInfo:  0x00000001428753A0
#ifndef _LensFlareEntity_
#define _LensFlareEntity_
class LensFlareEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 881;
    }
    char _0x0020[160];
};//Size=0x00C0
#endif

////////////////////////////////////////
// ClassId:   01353
// RuntimeId: 08926
// TypeInfo:  0x0000000142875440
#ifndef _IndirectCubeMapEntity_
#define _IndirectCubeMapEntity_
class IndirectCubeMapEntity : public Entity
{
public:
    static __inline unsigned int ClassId()
    {
        return 1353;
    }
    char _0x0020[144];
};//Size=0x00B0
#endif

////////////////////////////////////////
// ClassId:   00269
// RuntimeId: 05435
// TypeInfo:  0x0000000142823700
#ifndef _TimelineTrack_
#define _TimelineTrack_
class TimelineTrack
{
public:
    static __inline unsigned int ClassId()
    {
        return 269;
    }
    char _0x0000[104];
};//Size=0x0068
#endif

////////////////////////////////////////
// ClassId:   00096
// RuntimeId: 08924
// TypeInfo:  0x00000001428744D0
#ifndef _OccluderMesh_
#define _OccluderMesh_
class OccluderMesh
{
public:
    static __inline unsigned int ClassId()
    {
        return 96;
    }
    char _0x0000[40];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   01981
// RuntimeId: 08923
// TypeInfo:  0x0000000142874400
#ifndef _PathfindingObjectCategoryAsset_
#define _PathfindingObjectCategoryAsset_
#pragma pack(push, 8)
class PathfindingObjectCategoryAsset : public Asset
{
public:
    static __inline PathfindingObjectCategoryAsset* DefaultInstance()
    {
        return (PathfindingObjectCategoryAsset*) 0x000000006889D240;
    }
    static __inline unsigned int ClassId()
    {
        return 1981;
    }
};//Size=0x0018
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02141
// RuntimeId: 08921
// TypeInfo:  0x00000001428740A0
#ifndef _VegetationSystemSettings_
#define _VegetationSystemSettings_
#pragma pack(push, 8)
class VegetationSystemSettings : public DataContainer
{
public:
    static __inline VegetationSystemSettings* DefaultInstance()
    {
        return (VegetationSystemSettings*) 0x00000000688A07C0;
    }
    static __inline unsigned int ClassId()
    {
        return 2141;
    }
    Float32 m_WindVariation; //0x0010
    Float32 m_WindVariationRate; //0x0014
    Float32 m_WindStrength; //0x0018
    Float32 m_WindMicroVariation; //0x001C
    Float32 m_MaxActiveDistance; //0x0020
    Float32 m_MaxEffectDistance; //0x0024
    Uint32 m_MaxActiveBones; //0x0028
    Uint32 m_SimulationMemKbServer; //0x002C
    Uint32 m_SimulationMemKbClient; //0x0030
    Uint32 m_MaxPreSimsPerJob; //0x0034
    Float32 m_MaxWiggleDistance; //0x0038
    Int32 m_ForceShadowLod; //0x003C
    Float32 m_TimeScale; //0x0040
    Uint32 m_JobCount; //0x0044
    Int32 m_JointTensionLimitIndex; //0x0048
    Float32 m_JointTensionLimit; //0x004C
    Boolean m_SimulateServerSide; //0x0050
    Boolean m_DestructionEnabled; //0x0051
    Boolean m_SubDestructionEnabled; //0x0052
    Boolean m_LocalInfluencesEnabled; //0x0053
    Boolean m_UseShadowLodOffset; //0x0054
    Boolean m_ShadowMeshEnable; //0x0055
    Boolean m_DissolveEnable; //0x0056
    Boolean m_Enable; //0x0057
    Boolean m_EnableJobs; //0x0058
    Boolean m_DrawNodes; //0x0059
    Boolean m_DrawNodeIDs; //0x005A
    Boolean m_DrawNodeStiffness; //0x005B
    Boolean m_DrawEnable; //0x005C
    Boolean m_BatchDrawEnable; //0x005D
    Boolean m_DrawNonSimulatedAsRigid; //0x005E
    Boolean m_DrawActiveInstanceBoxesEnable; //0x005F
    Boolean m_DrawEffectDebugInfoEnable; //0x0060
    Boolean m_DrawDamageDebugInfoEnable; //0x0061
    Boolean m_DrawStatsEnable; //0x0062
    Boolean m_ProceduralAnimationEnable; //0x0063
    char _0x0064[4];
};//Size=0x0068
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02420
// RuntimeId: 08915
// TypeInfo:  0x0000000142874160
#ifndef _VegetationBaseEntityData_
#define _VegetationBaseEntityData_
#pragma pack(push, 16)
class VegetationBaseEntityData : public GameComponentEntityData
{
public:
    static __inline VegetationBaseEntityData* DefaultInstance()
    {
        return (VegetationBaseEntityData*) 0x00000000688A7870;
    }
    static __inline unsigned int ClassId()
    {
        return 2420;
    }
    Array<LinearTransform> m_BasePoseTransforms; //0x0080
    Array<Int32> m_Hierarchy; //0x0088
    Array<LinearTransform> m_LowResBasePoseTransforms; //0x0090
    Array<Int32> m_LowResHierarchy; //0x0098
    Array<Int32> m_PartIndirection; //0x00A0
    Array<Int32> m_PartHierarchy; //0x00A8
    Array<Float32> m_PartInitialHealths; //0x00B0
    SkinnedMeshAsset* m_Mesh; //0x00B8
    SkinnedMeshAsset* m_ShadowMesh; //0x00C0
    Array<Boolean> m_BoneIsStem; //0x00C8
    PhysicsEntityData* m_PhysicsData; //0x00D0
    char _0x00D8[8];
};//Size=0x00E0
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   02421
// RuntimeId: 08919
// TypeInfo:  0x0000000142874100
#ifndef _VegetationTreeEntityData_
#define _VegetationTreeEntityData_
#pragma pack(push, 16)
class VegetationTreeEntityData : public VegetationBaseEntityData
{
public:
    static __inline VegetationTreeEntityData* DefaultInstance()
    {
        return (VegetationTreeEntityData*) 0x00000000688A7970;
    }
    static __inline unsigned int ClassId()
    {
        return 2421;
    }
    Vec3 m_InertiaModifier; //0x00E0
    Vec3 m_TranslucencyVolumeCenter; //0x00F0
    Float32 m_Stiffness; //0x0100
    Float32 m_Damping; //0x0104
    Float32 m_StemMass; //0x0108
    Float32 m_StiffnessSpread; //0x010C
    Float32 m_DampingSpread; //0x0110
    Float32 m_MassSpread; //0x0114
    Float32 m_StemLockedUpTo; //0x0118
    Int32 m_StemBoneCount; //0x011C
    Float32 m_BreakableJointThreshold; //0x0120
    Float32 m_BoundingBoxScaleFactor; //0x0124
    Float32 m_PartsTimeToLive; //0x0128
    Float32 m_LinearVelocityDamping; //0x012C
    Float32 m_AngularVelocityDamping; //0x0130
    Float32 m_Friction; //0x0134
    Float32 m_Restitution; //0x0138
    Float32 m_StemPhysicsWidth; //0x013C
    Float32 m_StemPhysicsHeightScale; //0x0140
    Float32 m_BranchPhysicsWidth; //0x0144
    Float32 m_BranchPhysicsHeightScale; //0x0148
    Float32 m_DestructionMassScale; //0x014C
    Float32 m_CenterOfMassVerticalScale; //0x0150
    char _0x0154[4];
    VegetationEffectSlot m_StemBreakEffect; //0x0158
    VegetationEffectSlot m_BranchBreakEffect; //0x0170
    VegetationEffectSlot m_ImpactEffect; //0x0188
    EffectBlueprint* m_WindEffect; //0x01A0
    Float32 m_MinRespawnTime; //0x01A8
    Uint32 m_StemEffectNodeThreshold; //0x01AC
    Uint32 m_ShadowLODOffset; //0x01B0
    Float32 m_ColiPlaneDepth; //0x01B4
    Float32 m_StemHitpoints; //0x01B8
    Float32 m_BranchHitpoints; //0x01BC
    Float32 m_BranchL2Hitpoints; //0x01C0
    Float32 m_StemStiffness; //0x01C4
    Float32 m_StemStiffnessSpread; //0x01C8
    Float32 m_StemStiffnessInherit; //0x01CC
    Float32 m_BranchStiffness; //0x01D0
    Float32 m_BranchStiffnessInherit; //0x01D4
    Float32 m_BranchStiffnessL2; //0x01D8
    Float32 m_BranchStiffnessL2Inherit; //0x01DC
    EffectBlueprint* m_BulletImpactEffect; //0x01E0
    EffectBlueprint* m_CollisionEffect; //0x01E8
    EffectBlueprint* m_SplashNearEffect; //0x01F0
    EffectBlueprint* m_SplashDistantEffect; //0x01F8
    EffectBlueprint* m_LocalWindEffect; //0x0200
    EffectBlueprint* m_StemRipEffect; //0x0208
    EffectBlueprint* m_TreeFallEffect; //0x0210
    EffectBlueprint* m_GroundImpactEffect; //0x0218
    Float32 m_WindStem; //0x0220
    Float32 m_WindBranch; //0x0224
    Float32 m_WindBranchL2; //0x0228
    Float32 m_WindEndPoints; //0x022C
    Float32 m_InheritParentEndPoints; //0x0230
    Float32 m_ImpactThreshold; //0x0234
    Float32 m_CollisionImpactMultiplier; //0x0238
    Float32 m_WindMicroVariationMultiplier; //0x023C
    Float32 m_WindEPMicroVariationMultiplier; //0x0240
    Float32 m_FallDirectionStart; //0x0244
    Float32 m_FallDirectionEnd; //0x0248
    Boolean m_ConstantFalloff; //0x024C
    Boolean m_Indestructable; //0x024D
    Boolean m_TranslucencyEnabled; //0x024E
    Boolean m_ClientSideOnly; //0x024F
    Boolean m_UsePhysicsShapes; //0x0250
    Boolean m_ConstraintStemB1; //0x0251
    Boolean m_ConstraintStemB2; //0x0252
    Boolean m_ForceFullSim; //0x0253
    Boolean m_UseImpactThreshold; //0x0254
    char _0x0255[11];
};//Size=0x0260
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   00764
// RuntimeId: 08913
// TypeInfo:  0x00000001428741C0
#ifndef _VegetationTreeEntity_
#define _VegetationTreeEntity_
class VegetationTreeEntity : public SpatialEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 764;
    }
    char _0x0028[104];
};//Size=0x0090
#endif

////////////////////////////////////////
// ClassId:   00765
// RuntimeId: 08912
// TypeInfo:  0x0000000142874300
#ifndef _ServerVegetationTreeEntity_
#define _ServerVegetationTreeEntity_
class ServerVegetationTreeEntity : public VegetationTreeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 765;
    }
    char _0x0090[224];
};//Size=0x0170
#endif

////////////////////////////////////////
// ClassId:   00766
// RuntimeId: 08911
// TypeInfo:  0x0000000142874260
#ifndef _ClientVegetationTreeEntity_
#define _ClientVegetationTreeEntity_
class ClientVegetationTreeEntity : public VegetationTreeEntity
{
public:
    static __inline unsigned int ClassId()
    {
        return 766;
    }
    char _0x0090[256];
};//Size=0x0190
#endif

////////////////////////////////////////
// ClassId:   00097
// RuntimeId: 08909
// TypeInfo:  0x0000000142873E10
#ifndef _ISwfMovie_
#define _ISwfMovie_
class ISwfMovie
{
public:
    static __inline unsigned int ClassId()
    {
        return 97;
    }
    char _0x0000[8];
};//Size=0x0008
#endif

////////////////////////////////////////
// ClassId:   00098
// RuntimeId: 08910
// TypeInfo:  0x0000000142873DC0
#ifndef _SwfMovie_
#define _SwfMovie_
class SwfMovie : public ISwfMovie
{
public:
    static __inline unsigned int ClassId()
    {
        return 98;
    }
    char _0x0008[32];
};//Size=0x0028
#endif

////////////////////////////////////////
// ClassId:   02217
// RuntimeId: 08844
// TypeInfo:  0x00000001428729D0
#ifndef _UIGraphEntityData_
#define _UIGraphEntityData_
#pragma pack(push, 8)
class UIGraphEntityData : public EntityData
{
public:
    static __inline UIGraphEntityData* DefaultInstance()
    {
        return (UIGraphEntityData*) 0x00000000688A29D0;
    }
    static __inline unsigned int ClassId()
    {
        return 2217;
    }
    Array<EventSpec> m_Events; //0x0018
    UIGraphAsset* m_GraphAsset; //0x0020
    UIGraphPriority m_GraphPriority; //0x0028
    UIState m_State; //0x002C
    Boolean m_PopPreviousGraph; //0x0030
    char _0x0031[7];
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03634
// RuntimeId: 08762
// TypeInfo:  0x00000001428735D0
#ifndef _UINodeData_
#define _UINodeData_
#pragma pack(push, 8)
class UINodeData : public DataContainer
{
public:
    static __inline UINodeData* DefaultInstance()
    {
        return (UINodeData*) 0x00000000688D32D0;
    }
    static __inline unsigned int ClassId()
    {
        return 3634;
    }
    CString m_Name; //0x0010
    UIGraphAsset* m_ParentGraph; //0x0018
    Boolean m_IsRootNode; //0x0020
    Boolean m_ParentIsScreen; //0x0021
    char _0x0022[6];
};//Size=0x0028
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03648
// RuntimeId: 08838
// TypeInfo:  0x0000000142872A90
#ifndef _ScreenVisibilityNode_
#define _ScreenVisibilityNode_
#pragma pack(push, 8)
class ScreenVisibilityNode : public UINodeData
{
public:
    static __inline ScreenVisibilityNode* DefaultInstance()
    {
        return (ScreenVisibilityNode*) 0x00000000688D3880;
    }
    static __inline unsigned int ClassId()
    {
        return 3648;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    Uint32 m_ScreenCount; //0x0038
    Uint32 m_SkipCount; //0x003C
    Boolean m_Visible; //0x0040
    char _0x0041[7];
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03649
// RuntimeId: 08836
// TypeInfo:  0x0000000142872AF0
#ifndef _JumpNode_
#define _JumpNode_
#pragma pack(push, 8)
class JumpNode : public UINodeData
{
public:
    static __inline JumpNode* DefaultInstance()
    {
        return (JumpNode*) 0x00000000688D38E0;
    }
    static __inline unsigned int ClassId()
    {
        return 3649;
    }
    UINodePort* m_In; //0x0028
    UINodeData* m_TargetNode; //0x0030
    UINodePort* m_TargetPort; //0x0038
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03657
// RuntimeId: 08786
// TypeInfo:  0x00000001428732D0
#ifndef _StateNode_
#define _StateNode_
#pragma pack(push, 8)
class StateNode : public UINodeData
{
public:
    static __inline StateNode* DefaultInstance()
    {
        return (StateNode*) 0x00000000688D3C00;
    }
    static __inline unsigned int ClassId()
    {
        return 3657;
    }
    UIViewBaseAsset* m_Screen; //0x0028
    UINodePort* m_In; //0x0030
    UINodePort* m_Show; //0x0038
    UINodePort* m_Hide; //0x0040
    Array<UINodePort*> m_Inputs; //0x0048
    Array<UINodePort*> m_Outputs; //0x0050
    Int32 m_RenderToRootView; //0x0058
    Boolean m_RenderToTexture; //0x005C
    char _0x005D[3];
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03656
// RuntimeId: 08832
// TypeInfo:  0x0000000142872BB0
#ifndef _GlobalNode_
#define _GlobalNode_
#pragma pack(push, 8)
class GlobalNode : public UINodeData
{
public:
    static __inline GlobalNode* DefaultInstance()
    {
        return (GlobalNode*) 0x00000000688D3BB0;
    }
    static __inline unsigned int ClassId()
    {
        return 3656;
    }
    Array<UINodePort*> m_Outputs; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03635
// RuntimeId: 08828
// TypeInfo:  0x0000000142872C10
#ifndef _ScreenOutputEventNode_
#define _ScreenOutputEventNode_
#pragma pack(push, 8)
class ScreenOutputEventNode : public UINodeData
{
public:
    static __inline ScreenOutputEventNode* DefaultInstance()
    {
        return (ScreenOutputEventNode*) 0x00000000688D3310;
    }
    static __inline unsigned int ClassId()
    {
        return 3635;
    }
    UINodePort* m_Out; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03653
// RuntimeId: 08826
// TypeInfo:  0x0000000142872C70
#ifndef _ScreenInputEventNode_
#define _ScreenInputEventNode_
#pragma pack(push, 8)
class ScreenInputEventNode : public UINodeData
{
public:
    static __inline ScreenInputEventNode* DefaultInstance()
    {
        return (ScreenInputEventNode*) 0x00000000688D3AA0;
    }
    static __inline unsigned int ClassId()
    {
        return 3653;
    }
    UINodePort* m_In; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03654
// RuntimeId: 08824
// TypeInfo:  0x0000000142872CD0
#ifndef _InstanceOutputNode_
#define _InstanceOutputNode_
#pragma pack(push, 8)
class InstanceOutputNode : public UINodeData
{
public:
    static __inline InstanceOutputNode* DefaultInstance()
    {
        return (InstanceOutputNode*) 0x00000000688D3AF0;
    }
    static __inline unsigned int ClassId()
    {
        return 3654;
    }
    UINodePort* m_In; //0x0028
    Int32 m_Id; //0x0030
    Boolean m_DestroyGraph; //0x0034
    char _0x0035[3];
};//Size=0x0038
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03639
// RuntimeId: 08822
// TypeInfo:  0x0000000142872D30
#ifndef _InstanceInputNode_
#define _InstanceInputNode_
#pragma pack(push, 8)
class InstanceInputNode : public UINodeData
{
public:
    static __inline InstanceInputNode* DefaultInstance()
    {
        return (InstanceInputNode*) 0x00000000688D3470;
    }
    static __inline unsigned int ClassId()
    {
        return 3639;
    }
    UINodePort* m_Out; //0x0028
};//Size=0x0030
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03646
// RuntimeId: 08820
// TypeInfo:  0x0000000142872D90
#ifndef _InstanceNode_
#define _InstanceNode_
#pragma pack(push, 8)
class InstanceNode : public UINodeData
{
public:
    static __inline InstanceNode* DefaultInstance()
    {
        return (InstanceNode*) 0x00000000688D37A0;
    }
    static __inline unsigned int ClassId()
    {
        return 3646;
    }
    UIGraphAsset* m_UIGraph; //0x0028
    Array<UINodePort*> m_Inputs; //0x0030
    Array<UINodePort*> m_Outputs; //0x0038
};//Size=0x0040
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03645
// RuntimeId: 08818
// TypeInfo:  0x0000000142872DF0
#ifndef _ActionNode_
#define _ActionNode_
#pragma pack(push, 8)
class ActionNode : public UINodeData
{
public:
    static __inline ActionNode* DefaultInstance()
    {
        return (ActionNode*) 0x00000000688D3720;
    }
    static __inline unsigned int ClassId()
    {
        return 3645;
    }
    Int32 m_ActionKey; //0x0028
    char _0x002C[4];
    Array<CString> m_Params; //0x0030
    Asset* m_ActionAsset; //0x0038
    UINodePort* m_In; //0x0040
    Array<UINodePort*> m_DataInputs; //0x0048
    UINodePort* m_Out; //0x0050
    Boolean m_AppendIncomingParams; //0x0058
    char _0x0059[7];
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03640
// RuntimeId: 08816
// TypeInfo:  0x0000000142872E50
#ifndef _OperandLogicNode_
#define _OperandLogicNode_
#pragma pack(push, 8)
class OperandLogicNode : public UINodeData
{
public:
    static __inline OperandLogicNode* DefaultInstance()
    {
        return (OperandLogicNode*) 0x00000000688D34C0;
    }
    static __inline unsigned int ClassId()
    {
        return 3640;
    }
    UISimpleDataSource m_LeftDataSourceInfo; //0x0028
    UILogicOperator m_Operator; //0x0038
    char _0x003C[4];
    UISimpleDataSource m_RightDataSourceInfo; //0x0040
    Float64 m_RightLiteralOperand; //0x0050
    UINodePort* m_In; //0x0058
    UINodePort* m_True; //0x0060
    UINodePort* m_False; //0x0068
};//Size=0x0070
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03643
// RuntimeId: 08814
// TypeInfo:  0x0000000142872EB0
#ifndef _ComparisonLogicNode_
#define _ComparisonLogicNode_
#pragma pack(push, 8)
class ComparisonLogicNode : public UINodeData
{
public:
    static __inline ComparisonLogicNode* DefaultInstance()
    {
        return (ComparisonLogicNode*) 0x00000000688D3640;
    }
    static __inline unsigned int ClassId()
    {
        return 3643;
    }
    UINodePort* m_In; //0x0028
    Array<UINodePort*> m_Outputs; //0x0030
    UISimpleDataSource m_DataSourceInfo; //0x0038
    Boolean m_SkipFractionals; //0x0048
    char _0x0049[7];
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03644
// RuntimeId: 08812
// TypeInfo:  0x0000000142872F10
#ifndef _BinaryLogicNode_
#define _BinaryLogicNode_
#pragma pack(push, 8)
class BinaryLogicNode : public UINodeData
{
public:
    static __inline BinaryLogicNode* DefaultInstance()
    {
        return (BinaryLogicNode*) 0x00000000688D36B0;
    }
    static __inline unsigned int ClassId()
    {
        return 3644;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_True; //0x0030
    UINodePort* m_False; //0x0038
    UISimpleDataSource m_DataSourceInfo; //0x0040
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03641
// RuntimeId: 08810
// TypeInfo:  0x0000000142872F70
#ifndef _MovieNavigationNode_
#define _MovieNavigationNode_
#pragma pack(push, 8)
class MovieNavigationNode : public UINodeData
{
public:
    static __inline MovieNavigationNode* DefaultInstance()
    {
        return (MovieNavigationNode*) 0x00000000688D3550;
    }
    static __inline unsigned int ClassId()
    {
        return 3641;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    CString m_MovieClipPath; //0x0038
    CString m_FrameLabel; //0x0040
    Uint32 m_Frame; //0x0048
    Boolean m_UseLabel; //0x004C
    Boolean m_Play; //0x004D
    char _0x004E[2];
};//Size=0x0050
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03652
// RuntimeId: 08808
// TypeInfo:  0x0000000142872FD0
#ifndef _DataBindingNode_
#define _DataBindingNode_
#pragma pack(push, 8)
class DataBindingNode : public UINodeData
{
public:
    static __inline DataBindingNode* DefaultInstance()
    {
        return (DataBindingNode*) 0x00000000688D3A40;
    }
    static __inline unsigned int ClassId()
    {
        return 3652;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    UIDataBinding* m_DataBinding; //0x0038
    UIWidgetEventID m_WidgetEvent; //0x0040
    char _0x0044[4];
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03638
// RuntimeId: 08806
// TypeInfo:  0x0000000142873030
#ifndef _RefreshNode_
#define _RefreshNode_
#pragma pack(push, 8)
class RefreshNode : public UINodeData
{
public:
    static __inline RefreshNode* DefaultInstance()
    {
        return (RefreshNode*) 0x00000000688D3410;
    }
    static __inline unsigned int ClassId()
    {
        return 3638;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    UISimpleDataSource m_DataSource; //0x0038
};//Size=0x0048
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03647
// RuntimeId: 08804
// TypeInfo:  0x0000000142873090
#ifndef _DataStepNode_
#define _DataStepNode_
#pragma pack(push, 8)
class DataStepNode : public UINodeData
{
public:
    static __inline DataStepNode* DefaultInstance()
    {
        return (DataStepNode*) 0x00000000688D3800;
    }
    static __inline unsigned int ClassId()
    {
        return 3647;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    Array<Float32> m_Steps; //0x0038
    UISimpleDataSource m_CurrentStepDataSource; //0x0040
    UISimpleDataSource m_DataSource; //0x0050
};//Size=0x0060
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03651
// RuntimeId: 08802
// TypeInfo:  0x00000001428730F0
#ifndef _DataIncrementNode_
#define _DataIncrementNode_
#pragma pack(push, 8)
class DataIncrementNode : public UINodeData
{
public:
    static __inline DataIncrementNode* DefaultInstance()
    {
        return (DataIncrementNode*) 0x00000000688D39D0;
    }
    static __inline unsigned int ClassId()
    {
        return 3651;
    }
    UINodePort* m_In; //0x0028
    UINodePort* m_Out; //0x0030
    Float32 m_Max; //0x0038
    Float32 m_Min; //0x003C
    Float32 m_IncrementSize; //0x0040
    char _0x0044[4];
    UISimpleDataSource m_DataSource; //0x0048
};//Size=0x0058
#pragma pack(pop)
#endif

////////////////////////////////////////
// ClassId:   03636
// RuntimeId: 08800
// TypeInfo:  0x0000000142873150
#ifndef _DataToggleNode_
#define _DataToggleNode_
#pragma pack(push, 8)
class DataToggleNode : public UINodeData
{
public:
