// Generated using ReClass 2016

class OFFSET_MAIN;
class Main;
class Server;
class Offset_ClientGameContext;
class ClientGameContext;
class GameContext;
class ClientPlayerManager;
class ClientPlayer;
class Player;
class ClientSoldierEntity;
class BFClientSoldierHealthComponent;
class ClientControllableEntity;
class UIEntities;
class ClientCharacterEntity;
class CharacterPhysicsEntity;
class ClientAntAnimatableComponent;
class SoldierEntity;
class ClientSoldierPrediction;
class ClientSoldierWeaponsComponent;
class CameraCallbacks;
class ClientAnimatedSoldierWeaponHandler;
class SoldierAimingEnvironment;
class ClientSoldierWeapon;
class OFFSET_CLIENTSOLDIERWEAPON;
class ClientSoldierAimingSimulation;
class SoldierAimingSimulationData;
class AimingPoseData;
class FPSAimer;
class WeaponFiring;
class WeaponSwayData;
class GunSwayData;
class WeaponFiringData;
class FiringFunctionData;
class WeaponDispersion;
class FiringDispersionData;
class ShotConfigData;
class OverHeatData;
class FireLogicData;
class HoldAndReleaseData;
class BoltActionData;
class RecoilData;
class AmmoConfigData;
class BulletEntityData;
class MeshProjectileEntityData;
class ProjectileEntityData;
class WeaponSuppressionData;
class SoldierEntityData;
class ControllableEntityData;
class CharacterEntityData;
class ClientRagdollComponent;
class QuatTransform;
class ClientSoldierBreathComponent;
class ClientLevel;
class LevelData;
class WorldData;
class CompnentsList;
class LevelSetupOption;

class AAVCustomization;
class FACCustomization;
class JETCustomization;
class USRecon;
class USEngineer;
class N0000D326;
class N0000D388;
class N0000D38B;
class N00006958;
class ClientActiveWeaponHandler;
class N0000D2F3;
class N0000D2FD;
class FirstPersonCameraData;
class N0000D369;
class N0000D37D;
class N0000D399;
class N0000D3B5;
class N0000D3D9;
class N0000D3F5;
class N0000D42D;
class N0000D452;
class WeaponModifier;
class ControllableFinder;
class ControllableResult;
class N0000D5D1;
class N0000D5E4;
class N0000D5F7;
class N0000D633;
class N0000D63D;
class N0000D648;
class N0000D666;
class N0000D672;
class N0000D686;
class N0000D6A2;
class N0000D6BF;
class ClientDestructionManager;
class GameTime;
class GunSwayStandData;
class GunSwayCrouchProneData;
class GunSwayCrouchProneData;
class N0000D7F8;
class N0000D7FD;
class N0000D808;
class N0000D81D;
class N0000D821;
class N0000D827;
class N0000D863;
class N0000D871;
class N0000D87E;
class N0000D882;
class N0000D885;
class N0000D888;
class N0000D88B;
class N0000D88E;
class N0000D891;
class N0000D894;
class N0000D897;
class N0000D89A;
class N0000D89D;
class N0000D8A0;
class N0000D8A3;
class N0000D8A6;
class N0000D8A9;
class N0000D8AC;
class N0000D8AF;
class N0000D8B2;
class N0000D8B5;
class N0000D8B8;
class N0000D8BB;
class N0000D8BE;
class N0000D8C1;
class N0000D8C4;
class N0000D8C7;
class N0000D8CA;
class N0000D8CD;
class N0000D8D0;
class N0000D8D3;
class N0000D8D6;
class N0000D8D9;
class N0000D8DC;
class N0000D8DF;
class N0000D8E2;
class N0000D8E5;
class N0000D8E8;
class N0000D8EB;
class N0000D8EE;
class N0000D8F1;
class N0000D8F4;
class N0000D8F7;
class N0000D9B2;
class N00006C28;
class N00006C62;
class N00006E9C;
class N00006EBF;
class N00006ED2;
class WeaponZoomLevelData;
class N00006F8D;
class ZoomLevelData;
class N00006FF0;
class WeaponAnimationSettingsData;
class N0000701C;
class N0000F521;
class N0000F537;
class N0000F545;
class N0000F550;
class N0000F555;
class N00006688;
class OriginSettings;
class N000066A8;
class VeniceOnlineSettings;
class N00006767;
class N00006C81;
class DamageData;
class WeaponUnlockAsset;
class ClientPeer;
class ClientConnection;
class ClientDamageStream;
class N00006CE2;
class N0000D3ED;
class N0000D409;
class Physics;
class AimingConstraintsData;
class N000067B3;
class N0000682F;
class N00006842;
class AimingContraints;
class N0000687C;
class N000068A7;
class N000068B2;
class N000068D4;
class N000068E3;
class SoldierAimingConstraintsData;
class N00006911;
class OFFSET_AudioSettings;
class SoldierAimAssistData;
class OFFSET_PhysicsSettings;
class OFFSET_GameSettings;
class N000069DB;
class OFFSET_SHOTSTATS;
class ExplosionEntityData;
class N000069FD;
class N00006A67;
class N00006A84;
class N00006A87;
class N00006A90;
class N00006A9B;
class N00006AAE;
class N00006AB1;
class N00006ABC;
class RagdollComponentData;
class SkeletonCollisionData;
class BoneCollisionData;
class N00006B3A;
class N00006B4C;
class N00006B52;
class N00006B5D;
class N00006B68;
class N00006A81;

class OFFSET_MAIN
{
public:
	char N0000608A[32]; //0x0000 
	char pad_0x0020[0x28]; //0x0020
	Server* m_pServer; //0x0048 
	Client* m_pClient; //0x0050 
	char pad_0x0058[0x28]; //0x0058

}; //Size=0x0080

class Main
{
public:
	char pad_0x0000[0x24]; //0x0000
	unsigned char m_IsDedicatedServer; //0x0024 
	unsigned char m_IsDedicatedServerData; //0x0025 
	unsigned char m_IsPaused; //0x0026 
	char pad_0x0027[0x29]; //0x0027
	__int64 m_pServer; //0x0050 
	ClientGameContext* m_pClient; //0x0058 
	__int64 m_pFileSystem; //0x0060 
	__int64 m_pSimulationGameTimer; //0x0068 
	__int64 m_pUIGameTimer; //0x0070 
	char pad_0x0078[0x50]; //0x0078

}; //Size=0x00C8

class Server
{
public:
	__int64 N21F243A8; //0x0000 
	char pad_0x0008[0x40]; //0x0008
	N0000D672* N21F2B082; //0x0048 
	char pad_0x0050[0xC0]; //0x0050

}; //Size=0x0110

class Offset_ClientGameContext
{
public:
	char pad_0x0000[0x48]; //0x0000
	ClientGameContext* m_pGameContext; //0x0048 
	ClientSettings* m_pClientSettings; //0x0050 
	char pad_0x0058[0x8]; //0x0058
	ClientPlayerManager* m_pClientPlayerManager; //0x0060 
	OnlineManager* m_pOnlineManager; //0x0068 
	ClientGameView* m_pGameView; //0x0070 
	__int64 m_pFileSystem; //0x0078 
	__int64 m_pGameTime; //0x0080 
	BorderInputNode* m_pBorderInputNode; //0x0088 
	char pad_0x0090[0x10]; //0x0090
	__int64 m_pUISystem; //0x00A0 
	__int32 m_UISystemType; //0x00A8 
	char pad_0x00AC[0x25C]; //0x00AC
	__int32 m_ClientState; //0x0308 

}; //Size=0x030C

class ClientGameContext
{
public:
	GameContext* GameContext; //0x0000 
	char pad_0x0008[0x18]; //0x0008
	GameTime* m_gameTime; //0x0020 
	Level* m_level; //0x0028 
	char pad_0x0030[0x30]; //0x0030
	ClientPlayerManager* m_pClientPlayerManager; //0x0060 
	OnlineManager* m_pOnlineManager; //0x0068 
	__int64 m_pGameView; //0x0070 
	char pad_0x0078[0x30]; //0x0078

}; //Size=0x00A8

class GameContext
{
public:
	char pad_0x0000[0x20]; //0x0000
	ClientPlayerManager* m_pPlayerManager; //0x0020 
	__int64 m_pGameTime; //0x0028 
	ClientLevel* m_pLevel; //0x0030 
	__int64 m_pMaterialGridManager; //0x0038 
	__int64 m_pAnimationManager; //0x0040 
	char pad_0x0048[0x18]; //0x0048

}; //Size=0x0060

class ClientPlayerManager
{
public:
	char pad_0x0000[0x8]; //0x0000
	PlayerData* m_pPlayerData; //0x0008 
	__int32 m_MaxPlayerCount; //0x0010 
	__int32 m_PlayerCountBitCount; //0x0014 
	__int32 m_PlayerIdBitCount; //0x0018 
	char pad_0x001C[0x4]; //0x001C
	char N21F96D90[1023]; //0x0020 
	char N0000D2E0[200]; //0x041F 
	char pad_0x04E7[0x59]; //0x04E7
	ClientPlayer* m_pLocalPlayer; //0x0540 
	idToPlayerMapOffset* m_ppPlayers; //0x0548 
	char pad_0x0550[0x8]; //0x0550
	__int64 m_pNetworkablePlayers; //0x0558 
	char pad_0x0560[0x198]; //0x0560

}; //Size=0x06F8

class ClientPlayer : public Player
{
public:
	char pad_0x0CCC[0x8]; //0x0CCC
	unsigned char N2202723A; //0x0CD4 
	char pad_0x0CD5[0x4]; //0x0CD5
	unsigned char N00002D57; //0x0CD9 
	char pad_0x0CDA[0x2]; //0x0CDA
	__int32 N2202723B; //0x0CDC 
	char pad_0x0CE0[0x6E9]; //0x0CE0
	unsigned char m_isSpectator; //0x13C9 
	char pad_0x13CA[0x2]; //0x13CA
	unsigned char m_TeamId; //0x13CC 
	char pad_0x13CD[0xE2]; //0x13CD
	unsigned char N00003071; //0x14AF 
	ClientCharacterEntity* m_character; //0x14B0 
	char pad_0x14B8[0x8]; //0x14B8
	ClientVehicleEntity* m_pAttachedControllable; //0x14C0 
	__int32 m_attachedEntryId; //0x14C8 
	char pad_0x14CC[0x4]; //0x14CC
	ClientSoldierEntity* m_pControlledControllable; //0x14D0 
	__int32 N00002BA5; //0x14D8 
	__int32 N0000D5CD; //0x14DC 
	char pad_0x14E0[0x18]; //0x14E0
	DWORD N00002BA9; //0x14F8 
	DWORD N00005CA9; //0x14FC 
	DWORD N00002BAA; //0x1500 
	char pad_0x1504[0xC]; //0x1504
	N000031FA* m_ownPlayerView; //0x1510 
	char pad_0x1518[0x8]; //0x1518
	m_PlayerView* m_PlayerView; //0x1520 
	char pad_0x1528[0x39C]; //0x1528

}; //Size=0x18C4

class Player
{
public:
	char pad_0x0000[0x8]; //0x0000
	N00002D09* m_pPlayerData; //0x0008 
	char pad_0x0010[0x8]; //0x0010
	char * m_pLocalName; //0x0018 
	char pad_0x0020[0x8]; //0x0020
	N0000D9B2* N000055D3; //0x0028 
	char pad_0x0030[0x10]; //0x0030
	char szName[16]; //0x0040 
	char pad_0x0050[0xA8]; //0x0050
	m_Owner* m_Owner; //0x00F8 
	char pad_0x0100[0x151]; //0x0100
	__int64 m_pCustomizationAsset; //0x0251 fb::VeniceSoldierCustomizationAsset*
	char pad_0x0259[0x2E0]; //0x0259
	unsigned char N22052FB8; //0x0539 
	char pad_0x053A[0x6]; //0x053A
	unsigned char N00002FF5; //0x0540 
	char pad_0x0541[0x18]; //0x0541
	unsigned char N2205327A; //0x0559 
	char pad_0x055A[0x6]; //0x055A
	unsigned char N00003000; //0x0560 
	char pad_0x0561[0x3E0]; //0x0561
	DWORD N220532F7; //0x0941 
	unsigned char N00005709; //0x0945 
	char pad_0x0946[0x2]; //0x0946
	VeniceSoldierCustimizationAsset* m_pCustomization; //0x0948 
	char pad_0x0950[0x289]; //0x0950
	unsigned char N22053474; //0x0BD9 
	char pad_0x0BDA[0x6]; //0x0BDA
	N00002C66* N00002C64; //0x0BE0 
	char pad_0x0BE8[0xE0]; //0x0BE8
	__int32 m_TeamId; //0x0CC8 

}; //Size=0x0CCC

class ClientSoldierEntity : public ClientControllableEntity
{
public:
	ClientCharacterEntity ClientCharacterEntity; //0x0188 
	SoldierEntity SoldierEntity; //0x0288 
	char pad_0x0430[0x60]; //0x0430
	ClientSoldierPrediction* ClientReplication; //0x0490 
	char pad_0x0498[0x40]; //0x0498
	Vector2 m_ViewAngles; //0x04D8 
	char pad_0x04E0[0x8]; //0x04E0
	__int64 m_pSoldierSound; //0x04E8 
	__int32 m_Pose; //0x04F0 
	unsigned char m_RenderFlags; //0x04F4  4 = no weapon render | 6 = no player render
	char pad_0x04F5[0x7B]; //0x04F5
	ClientSoldierWeaponsComponent* m_pSoldierWeaponsComponent; //0x0570 fb::ClientSoldierWeaponsComponent
	__int64 m_pBodyComponent; //0x0578 
	ClientRagdollComponent* m_pRagdollComponent; //0x0580 
	ClientSoldierBreathComponent* m_pBreathControlComponent; //0x0588 
	__int64 m_pVehicleListenerComponent; //0x0590 
	char pad_0x0598[0x8]; //0x0598
	__int64 m_pSprintInputHandler; //0x05A0 check*
	char pad_0x05A8[0x4]; //0x05A8
	float m_LastSprinted; //0x05AC 
	unsigned char m_Sprinting; //0x05B0 
	unsigned char m_Occluded; //0x05B1 
	char pad_0x05B2[0x59E]; //0x05B2
	ParachuteComponent* m_pParachute; //0x0B50 
	char pad_0x0B58[0x98]; //0x0B58
	SpottingComponent* m_pSpottingComp; //0x0BF0 
	char pad_0x0BF8[0x18]; //0x0BF8
	SpottingTargetComponent* m_pSpottingTargetComp; //0x0C10 
	char pad_0x0C18[0x58]; //0x0C18
	SoldierSuppressionComponent* m_pSuppressionComp; //0x0C70 
	char pad_0x0C78[0xB8]; //0x0C78
	ClientVaultComponent* ClientVaultComponent; //0x0D30 
	char pad_0x0D38[0xE8]; //0x0D38

}; //Size=0x0E20

class BFClientSoldierHealthComponent
{
public:
	char pad_0x0000[0x20]; //0x0000
	float m_Health; //0x0020 
	float m_MaxHealth; //0x0024 
	char pad_0x0028[0x10]; //0x0028
	float m_VehicleHealth; //0x0038 
	char pad_0x003C[0xB4]; //0x003C
	__int64 N22C12F99; //0x00F0 
	__int64 N22C12F9A; //0x00F8 
	char pad_0x0100[0x10]; //0x0100

}; //Size=0x0110

class ClientControllableEntity
{
public:
	char pad_0x0000[0x18]; //0x0000
	unsigned char N22CAB289; //0x0018 
	WORD N00006C24; //0x0019 
	char pad_0x001B[0x15]; //0x001B
	SoldierEntityData* m_pData; //0x0030 
	__int64 m_pComponents; //0x0038 
	char pad_0x0040[0xC8]; //0x0040
	UIEntities* m_pUIEntities; //0x0108 
	char pad_0x0110[0x20]; //0x0110
	__int64 m_pSpawnEntity; //0x0130 
	char pad_0x0138[0x8]; //0x0138
	BFClientSoldierHealthComponent* m_pHealthComponent; //0x0140 
	__int64 m_pSoldierPhysicsComponent; //0x0148 
	char pad_0x0150[0x38]; //0x0150

}; //Size=0x0188

class UIEntities
{
public:
	char pad_0x0000[0x78]; //0x0000
	__int64 m_pUIElementWidgetReferenceData; //0x0078 
	__int64 m_pUIScoringWidgetData; //0x0080 
	char pad_0x0088[0x8]; //0x0088
	__int64 m_pClientUIScreenRenderEntity; //0x0090 
	char pad_0x0098[0xA8]; //0x0098
	__int64 m_pUIStatusUpdateWidgetData; //0x0140 
	char pad_0x0148[0x28]; //0x0148
	__int64 m_pUIHudBackgroundData; //0x0170 

}; //Size=0x0178

class ClientCharacterEntity
{
public:
	char pad_0x0000[0x28]; //0x0000
	CharacterPhysicsEntity* m_pPhysicsEntity; //0x0028 
	char pad_0x0030[0x18]; //0x0030
	ClientAntAnimatableComponent* m_pAnimatableComponent; //0x0048 
	__int64 m_pAnimatableComponent; //0x0050 
	__int64 m_pCameraComponent; //0x0058 VeniceClientSoldierCameraComponent* 
	char pad_0x0060[0x28]; //0x0060
	__int64 m_pSoldierBlueprint; //0x0088 
	char pad_0x0090[0x70]; //0x0090

}; //Size=0x0100

class CharacterPhysicsEntity
{
public:
	char pad_0x0000[0x70]; //0x0000
	PhysicsEntityBase* PhysicsEntityBase; //0x0070 

}; //Size=0x0078

class ClientAntAnimatableComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_pAnimatableData; //0x0010 
	char pad_0x0018[0x8]; //0x0018
	__int64 m_pEntry; //0x0020 
	char pad_0x0028[0x40]; //0x0028
	GameAnimatable* m_pGameAnimatable; //0x0068  todo: check 
	char pad_0x0070[0xB8]; //0x0070
	__int64 m_pAnimatable; //0x0128 
	char pad_0x0130[0x418]; //0x0130
	SkeletonAsset* m_pSkeletonAsset; //0x0548 

}; //Size=0x0550

class SoldierEntity
{
public:
	N00005E2D* N22FADE15; //0x0000 
	N00005E22* m_pSoldierData; //0x0008 
	char pad_0x0010[0x28]; //0x0010
	float m_headRotationSpeed; //0x0038 
	unsigned char m_headRotationSpeed; //0x003C 
	char N00005E48[39]; //0x003D 
	char pad_0x0064[0x24]; //0x0064
	Vector4 m_forwardVector; //0x0088 
	Vector4 m_upVector; //0x0098 
	Vector4 m_characterGravity; //0x00A8 
	float m_waterLevel_2; //0x00B8 
	float m_waterSpeed_2; //0x00BC 
	float m_speedScale; //0x00C0 
	float m_yaw; //0x00C4 
	float m_pitch; //0x00C8 
	float m_forwardInput; //0x00CC 
	float m_strafeInput; //0x00D0 
	float m_sprintMultiplier; //0x00D4 
	char N00002C7F[4]; //0x00D8 
	unsigned char m_tryJump_1; //0x00DC 
	unsigned char bUnkn_1; //0x00DD 
	unsigned char m_tryJump_2; //0x00DE 
	unsigned char m_sprint; //0x00DF 
	char pad_0x00E0[0x18]; //0x00E0
	N00005EC4* m_pBoneCollisionComponent; //0x00F8 
	float m_MoveSpeedMultiplier; //0x0100 
	float m_SprintSpeedMultiplier; //0x0104 
	float m_JumpHeightMultiplier; //0x0108 
	float m_LookSpeedMultiplier; //0x010C 
	float m_waterLevel; //0x0110 
	float m_waterSpeed; //0x0114 
	char pad_0x0118[0x8]; //0x0118
	__int64 m_pCharacterEntity; //0x0120 
	char pad_0x0128[0x80]; //0x0128

}; //Size=0x01A8

class ClientSoldierPrediction
{
public:
	char pad_0x0000[0x8]; //0x0000
	N00005F59* N23017656; //0x0008 
	char pad_0x0010[0x10]; //0x0010
	Vector4 m_ParachuteRotation; //0x0020 
	Vector3 m_Position; //0x0030 
	char pad_0x003C[0x14]; //0x003C
	Vector3 m_Velocity; //0x0050 
	char pad_0x005C[0x4]; //0x005C
	Vector3 groundNormal; //0x0060 
	char pad_0x006C[0x4]; //0x006C
	DWORD groundSupported; //0x0070 
	__int32 groundMaterialIndex; //0x0074 
	DWORD m_state; //0x0078 
	unsigned char m_Pose; //0x007C 
	char pad_0x007D[0x3]; //0x007D
	unsigned char m_ChangingToPose; //0x0080 
	char pad_0x0081[0x4F]; //0x0081

}; //Size=0x00D0

class ClientSoldierWeaponsComponent
{
public:
	char pad_0x0000[0x40]; //0x0000
	CameraCallbacks* m_pCameraCallbacks; //0x0040 
	char pad_0x0048[0x88]; //0x0048
	matrix3x4_t m_Transform; //0x00D0 
	char pad_0x0110[0x780]; //0x0110
	ClientAnimatedSoldierWeaponHandler* m_pHandler; //0x0890 
	char pad_0x0898[0x20]; //0x0898
	ClientAntAnimatableComponent* m_pAnimatable; //0x08B8 
	char pad_0x08C0[0x8]; //0x08C0
	__int64 m_pOwner; //0x08C8 
	ClientActiveWeaponHandler* m_activeHandler; //0x08D0 
	char -----------------------------[192]; //0x08D8 
	__int64 ClientAimingConstraintsEntity; //0x0998 
	char ----------------------------[248]; //0x09A0 
	DWORD m_activeSlot; //0x0A98 
	DWORD m_lastActiveSlot; //0x0A9C 
	DWORD m_lastActiveWeaponSlot; //0x0AA0 
	char ----------------------------------[28]; //0x0AA4 
	__int32 m_currentZoomLevel; //0x0AC0 
	__int32 m_zoomLevelMax; //0x0AC4 
	__int32 m_zeroingDistanceLevel; //0x0AC8 
	unsigned char m_noMagnifierAccessory; //0x0ACC 
	char null[779]; //0x0ACD 
	float m_TimeSinceFire; //0x0DD8 
	char pad_0x0DDC[0x4]; //0x0DDC

}; //Size=0x0DE0

class CameraCallbacks
{
public:
	char pad_0x0000[0xE8]; //0x0000
	__int64 m_pVeniceFPSCamera; //0x00E8 
	__int64 m_pCSECameraCallback; //0x00F0 
	char pad_0x00F8[0x8]; //0x00F8
	__int64 m_pChaseCamera; //0x0100 
	__int64 m_pCSECameraCallback; //0x0108 
	char pad_0x0110[0x8]; //0x0110
	__int64 m_pChaseCamera; //0x0118 
	__int64 m_pCameraCallback; //0x0120 

}; //Size=0x0128

class ClientAnimatedSoldierWeaponHandler
{
public:
	ClientSoldierWeapon* m_pWeaponList; //0x0000 fb::ClientSoldierWeapon[8]
	__int64 m_pWeaponList; //0x0008 
	__int64 m_pWeaponList; //0x0010 
	__int64 m_pWeaponList; //0x0018 
	__int64 m_pWeaponList; //0x0020 
	__int64 m_pWeaponList; //0x0028 
	__int64 m_pWeaponList; //0x0030 
	__int64 m_pWeaponList; //0x0038 

}; //Size=0x0040

class SoldierAimingEnvironment
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_pWeaponFiringData; //0x0010 
	char pad_0x0018[0x10]; //0x0018
	__int64 m_pAimingSimulationData; //0x0028 
	char pad_0x0030[0x18]; //0x0030

}; //Size=0x0048

class ClientSoldierWeapon
{
public:
	char pad_0x0000[0x30]; //0x0000
	fb::WeaponEntityData* m_pWeaponData; //0x0030 
	char pad_0x0038[0x8]; //0x0038
	char N2325D771[1023]; //0x0040 
	char N0000D2F6[1023]; //0x043F 
	char N0000D2F8[1023]; //0x083E 
	char pad_0x0C3D[0x3C6B]; //0x0C3D
	__int64 m_pWeaponZoomLevelData; //0x48A8 fb::WeaponZoomLevelData[2]
	__int64 m_pWeaponZoomLevelData; //0x48B0 
	char pad_0x48B8[0x18]; //0x48B8
	__int64 m_pWeaponFiringEffectsModifier; //0x48D0 fb::WeaponFiringEffectsModifier*
	char pad_0x48D8[0x30]; //0x48D8
	__int64 m_pWeaponAimingSimulationModifier; //0x4908 
	char pad_0x4910[0x8]; //0x4910
	__int64 m_pWeaponAnimTypeModifier; //0x4918 
	char pad_0x4920[0x28]; //0x4920
	__int64 m_pWeaponZoomLevelModifier; //0x4948 fb::WeaponZoomLevelModifier[2]
	__int64 m_pWeaponZoomLevelModifier; //0x4950 
	__int64 m_pZoomLevelData; //0x4958 fb::ZoomLevelData[2]
	__int64 m_pZoomLevelData; //0x4960 
	char pad_0x4968[0x8]; //0x4968
	FirstPersonCameraData* FirstPersonCameraData; //0x4970 FirstPersonCameraData**
	char pad_0x4978[0x10]; //0x4978
	ClientSoldierAimingSimulation* m_pAimingSimulation; //0x4988 For Aimbot
	char pad_0x4990[0x18]; //0x4990
	ClientWeapon* m_pClientWeapon; //0x49A8 
	char pad_0x49B0[0x10]; //0x49B0
	WeaponFiring* m_pPrimaryFire; //0x49C0 
	char pad_0x49C8[0x60]; //0x49C8

}; //Size=0x4A28

class OFFSET_CLIENTSOLDIERWEAPON
{
public:
	ClientSoldierWeapon* lpSoldierWeapon; //0x0000 

}; //Size=0x0008

class ClientSoldierAimingSimulation
{
public:
	SoldierAimingSimulationData* m_pData; //0x0000 
	char pad_0x0008[0x8]; //0x0008
	FPSAimer* m_pFPSAimer; //0x0010 
	float m_Yaw; //0x0018 
	float m_Pitch; //0x001C 
	float m_AimYawTimer; //0x0020 
	float m_AimPitchTimer; //0x0024 
	Vector2 m_Sway; //0x0028 
	float m_DeltaTime; //0x0030 
	char pad_0x0034[0x8]; //0x0034
	Vector2 m_ViewDelta; //0x003C 
	char pad_0x0044[0x2C]; //0x0044
	matrix3x4_t m_Transform; //0x0070 
	Vector4 m_Position; //0x00B0 
	Vector4 m_View; //0x00C0 
	Vector4 m_Velocity; //0x00D0 
	char pad_0x00E0[0x58]; //0x00E0
	float m_FOV; //0x0138 check
	char pad_0x013C[0x1C]; //0x013C
	__int64 m_pRayResult; //0x0158 
	Vector4 m_RayEnd; //0x0160 
	__int32 m_RayMaximumLength; //0x0170 
	char pad_0x0174[0x3C]; //0x0174

}; //Size=0x01B0

class SoldierAimingSimulationData
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_ppZoomLevels; //0x0010 
	SoldierAimAssistData* m_pAimAssist; //0x0018 
	AimingPoseData m_StandPose; //0x0020 
	AimingPoseData m_CrouchPose; //0x0038 
	AimingPoseData m_PronePose; //0x0050 
	float m_ZoomTransitionTime; //0x0068 
	char pad_0x006C[0x4]; //0x006C
	__int64 m_ZoomTransitionTimeArray; //0x0070 Float**
	float m_FovDelayTime; //0x0078 
	float m_FovTransitionTime; //0x007C 
	float m_AimingRange; //0x0080 
	float m_LockAimToTargetSpeed; //0x0084 
	__int64 m_Modifiers; //0x0088 
	unsigned char m_ReturnToZoomAfterReload; //0x0090 
	char pad_0x0091[0x7]; //0x0091

}; //Size=0x0098

class AimingPoseData
{
public:
	float m_MinimumPitch; //0x0000 
	float m_MaximumPitch; //0x0004 
	float m_TargetingFov; //0x0008 
	float m_AimSteadiness; //0x000C 
	float m_SpeedMultiplier; //0x0010 
	float m_RecoilMultiplier; //0x0014 

}; //Size=0x0018

class FPSAimer
{
public:
	__int64 m_pAimAssistData; //0x0000 
	char pad_0x0008[0xC]; //0x0008
	Vector2 m_AuthoratativeViewAngles; //0x0014 

}; //Size=0x001C

class WeaponFiring
{
public:
	char pad_0x0000[0x78]; //0x0000
	WeaponSwayData* m_pSway; //0x0078 
	char pad_0x0080[0x18]; //0x0080
	__int64 m_pShaderParam; //0x0098 fb::ShaderParameterEntityData*
	char pad_0x00A0[0x88]; //0x00A0
	WeaponFiringData* m_pWeaponFiringData; //0x0128 
	char pad_0x0130[0x18]; //0x0130
	__int32 m_WeaponState; //0x0148 
	__int32 m_LastWeaponState; //0x014C 
	__int32 m_NextWeaponState; //0x0150 
	char pad_0x0154[0x8]; //0x0154
	float m_TimeToWait; //0x015C 
	float m_ReloadTimer; //0x0160 
	float m_HoldReleaseMinDelay; //0x0164 
	float m_RecoilTimer; //0x0168 
	float m_RecoilAngleX; //0x016C 
	float m_RecoilAngleY; //0x0170 
	float m_RecoilAngleZ; //0x0174 
	float m_RecoilFovAngle; //0x0178 
	float m_RecoilTimeMultiplier; //0x017C 
	float m_OverheatDropMultiplier; //0x0180 
	float N234366AE; //0x0184 
	float N23460EA3; //0x0188 
	float N234366AF; //0x018C 
	float N23460EA5; //0x0190 
	char pad_0x0194[0x14]; //0x0194
	__int32 m_ProjectilesLoaded; //0x01A8 
	__int32 m_ProjectilesInMagazines; //0x01AC 
	char pad_0x01B0[0x10]; //0x01B0
	DWORD m_TickCounter; //0x01C0 
	char pad_0x01C4[0xC]; //0x01C4
	__int64 m_pFiringHoldingData; //0x01D0 fb::SoldierWeaponData*
	char pad_0x01D8[0x140]; //0x01D8

}; //Size=0x0318

class WeaponSwayData
{
public:
	char pad_0x0000[0x8]; //0x0000
	GunSwayData* m_pSwayData; //0x0008 
	char pad_0x0010[0x1F4]; //0x0010
	unsigned char N0000319B; //0x0204 
	char pad_0x0205[0x16F]; //0x0205
	DWORD N000031C9; //0x0374 
	char pad_0x0378[0x104]; //0x0378

}; //Size=0x047C

class GunSwayData
{
public:
	char pad_0x0000[0x10]; //0x0000
	GunSwayStandData m_Stand; //0x0010 Recoil Data For Poses, NULL all of it (float m_RecoilData[180])
	GunSwayCrouchProneData m_Crouch; //0x0188 
	GunSwayCrouchProneData m_Prone; //0x0240 
	char pad_0x02F8[0x138]; //0x02F8
	float m_DeviationScaleFactorZoom; //0x0430 
	float m_GameplayDeviationScaleFactorZoom; //0x0434 
	float m_DeviationScaleFactorNoZoom; //0x0438 
	float m_GameplayDeviationScaleFactorNoZoom; //0x043C 
	float m_ShootingRecoilDecreaseScale; //0x0440 
	float m_FirstShotRecoilMultiplier; //0x0444 
	CameraRecoilData* CameraRecoilData; //0x0448 
	char pad_0x0450[0x30]; //0x0450

}; //Size=0x0480

class WeaponFiringData
{
public:
	char pad_0x0000[0x10]; //0x0000
	FiringFunctionData* m_PrimaryFire; //0x0010 
	float m_DeployTime; //0x0018 
	float m_ReactiveCooldownTime; //0x001C 
	float m_DisableZoomOnDeployTime; //0x0020 
	float m_AltDeployTime; //0x0024 
	__int32 m_AltDeployId; //0x0028 
	char pad_0x002C[0x4]; //0x002C
	WeaponSwayData* m_WeaponSway; //0x0030 
	RumbleFiringData* m_Rumble; //0x0038 
	DWORD N234BF486; //0x0040 
	float m_SupportDelayStand; //0x0044 
	float m_SupportDelayProne; //0x0048 
	unsigned char m_UseAutoAiming; //0x004C 
	unsigned char m_InflictSelfDamage; //0x004D 
	unsigned char m_ShowEnemyNametagOnAim; //0x004E 
	unsigned char m_ReloadWholeMags; //0x004F 
	unsigned char m_DisableReloadWhileSprinting; //0x0050 
	unsigned char m_AbortReloadOnSprint; //0x0051 
	char pad_0x0052[0x6]; //0x0052

}; //Size=0x0058

class FiringFunctionData
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_Dispersion; //0x0010 
	WeaponDispersion m_WeaponDispersion; //0x0018 
	ShotConfigData m_Shot; //0x0060 
	OverHeatData m_OverHeat; //0x00F0 
	__int64 m_pFireEffects1p; //0x0150 
	__int64 m_pFireEffects3p; //0x0158 
	__int64 m_pSound; //0x0160 fb::SoundPatchConfigurationAsset*
	FireLogicData m_FireLogic; //0x0168 
	AmmoConfigData m_Ammo; //0x0220 
	float m_SelfHealTimeWhenDeployed; //0x0244 
	unsigned char m_UsePrimaryAmmo; //0x0248 
	unsigned char m_UnlimitedAmmoForAI; //0x0249 
	char pad_0x024A[0xE]; //0x024A

}; //Size=0x0258

class WeaponDispersion : public FiringDispersionData
{
public:
	FiringDispersionData m_CrouchDispersion; //0x0010 
	FiringDispersionData m_ProneDispersion; //0x0020 
	float m_JumpDispersionAngle; //0x0030 
	char pad_0x0034[0x14]; //0x0034

}; //Size=0x0048

class FiringDispersionData
{
public:
	float m_MinAngle; //0x0000 
	float m_MaxAngle; //0x0004 
	float m_IncreasePerShot; //0x0008 
	float m_DecreasePerSecond; //0x000C 

}; //Size=0x0010

class ShotConfigData
{
public:
	Vector3 m_InitialPosition; //0x0000 
	char pad_0x000C[0x4]; //0x000C
	Vector3 m_InitialDirection; //0x0010 
	char pad_0x001C[0x4]; //0x001C
	Vector3 m_InitialSpeed; //0x0020 
	char pad_0x002C[0x14]; //0x002C
	float m_InheritWeaponSpeedAmount; //0x0040 
	char pad_0x0044[0x4]; //0x0044
	__int64 m_pMuzzleExplosion; //0x0048 
	ProjectileEntityData* m_pProjectileData; //0x0050 
	__int64 m_pSecondaryProjectileData; //0x0058 
	__int64 m_pProjectile; //0x0060 fb::ProjectileBlueprint*
	__int64 m_pSecondaryProjectile; //0x0068 
	float m_SpawnDelay; //0x0070 
	float m_QuickSwitchFireDelay; //0x0074 
	__int32 m_NumberOfBulletsPerShell; //0x0078 
	__int32 m_NumberOfBulletsPerShot; //0x007C 
	__int32 m_NumberOfBulletsPerBurst; //0x0080 
	unsigned char m_RelativeTargetAiming; //0x0084 
	unsigned char m_ForceSpawnToCamera; //0x0085 
	unsigned char m_SpawnVisualAtWeaponBone; //0x0086 
	unsigned char m_ActiveForceSpawnToCamera; //0x0087 
	char pad_0x0088[0x8]; //0x0088

}; //Size=0x0090

class OverHeatData
{
public:
	char pad_0x0000[0x4]; //0x0000
	unsigned char m_IsHoming; //0x0004 
	unsigned char m_IsGuided; //0x0005 
	unsigned char m_IsGuidedWhenZoomed; //0x0006 
	unsigned char m_IsGuidedHoming; //0x0007 
	unsigned char m_FireOnlyWhenLockedOn; //0x0008 
	char pad_0x0009[0x7]; //0x0009
	float m_X; //0x0010 
	char pad_0x0014[0x1C]; //0x0014
	unsigned char m_KnockOut; //0x0030 
	unsigned char m_HudeObject; //0x0031 
	unsigned char m_FineBlur; //0x0032 
	unsigned char N0000322B; //0x0033 
	char pad_0x0034[0x14]; //0x0034
	float m_HeatPerBullet; //0x0048 
	float m_HeatDropPerSecond; //0x004C 
	float m_OverHeatPenaltyTime; //0x0050 
	float m_OverHeatThreshold; //0x0054 
	unsigned char m_DropheatWhileFiring; //0x0058 
	char pad_0x0059[0x7]; //0x0059

}; //Size=0x0060

class FireLogicData : public HoldAndReleaseData
{
public:
	BoltActionData m_BoltAction; //0x001C 
	RecoilData m_Recoil; //0x002C 
	char pad_0x003C[0x14]; //0x003C
	__int32 m_FireInputAction; //0x0050 
	__int32 m_ReloadInputAction; //0x0054 
	__int32 m_CycleFireModeInputAction; //0x0058 
	float m_TriggerPullWeight; //0x005C 
	float m_RateOfFire; //0x0060 
	float m_RateOfFireForBurst; //0x0064 
	float m_DelayBetweenBursts; //0x0068 
	float m_ClientFireRateMultiplier; //0x006C 
	float m_ReloadDelay; //0x0070 
	float m_ReloadTime; //0x0074 
	__int64 m_ReloadTimerArray; //0x0078 
	float m_ReloadTimeBulletsLeft; //0x0080 
	float m_ReloadThreshold; //0x0084 
	float m_PreFireDelay; //0x0088 
	float m_PreFireDelayZoomed; //0x008C 
	float m_PreFireRequireHold; //0x0090 
	float m_AutomaticDelay; //0x0094 
	DWORD m_ReloadLogic; //0x0098 
	DWORD m_ReloadType; //0x009C 
	__int32 m_FireLogicType; //0x00A0 
	char pad_0x00A4[0x4]; //0x00A4
	__int64 m_FireLogicTypeArray; //0x00A8 
	unsigned char m_HoldOffReloadUntilFireRelease; //0x00B0 
	unsigned char m_HoldOffReloadUntilZoomRelease; //0x00B1 
	unsigned char m_ForceReloadActionOnFireTrigger; //0x00B2 
	unsigned char m_AlwaysAutoReload; //0x00B3 
	unsigned char m_ZoomTransitionDisableFire; //0x00B4 
	char pad_0x00B5[0x3]; //0x00B5

}; //Size=0x00B8

class HoldAndReleaseData
{
public:
	float m_MaxHoldTime; //0x0000 
	float m_MinPowerModifier; //0x0004 
	float m_MaxPowerModifier; //0x0008 
	float m_PowerIncreasePerSecond; //0x000C 
	char pad_0x0010[0xC]; //0x0010

}; //Size=0x001C

class BoltActionData
{
public:
	float m_BoltActionDelay; //0x0000 
	float m_BoltActionTime; //0x0004 
	unsigned char m_HoldBoltActionUntilFireRelease; //0x0008 
	unsigned char m_HoldBoltActionUntilZoomRelease; //0x0009 
	char pad_0x000A[0x6]; //0x000A

}; //Size=0x0010

class RecoilData
{
public:
	float m_MaxRecoilAngleX; //0x0000 
	float m_MinRecoilAngleX; //0x0004 
	float m_MaxRecoilAngleY; //0x0008 
	float m_MinRecoilAngleY; //0x000C 

}; //Size=0x0010

class AmmoConfigData
{
public:
	__int32 m_MagazineCapacity; //0x0000 
	__int32 m_NumberOfMagazines; //0x0004 
	__int32 m_TraceFrequency; //0x0008 
	__int32 m_AmmoPickupMinAmount; //0x000C 
	__int32 m_AmmoPickupMaxAmount; //0x0010 
	float m_AutoReplenishDelay; //0x0014 
	float m_AmmoBagPickupDelayMultiplier; //0x0018 
	__int32 m_AmmoBagPickupAmount; //0x001C 
	unsigned char m_AutoReplenishMagazine; //0x0020 
	char pad_0x0021[0x3]; //0x0021

}; //Size=0x0024

class BulletEntityData
{
public:
	char pad_0x0000[0xE]; //0x0000
	MeshProjectileEntityData MeshProjectileEntityData; //0x000E 
	__int64 m_pFlyBySound; //0x01C5 
	__int64 m_DudExplosion; //0x01CD 
	float m_Gravity; //0x01D5 
	float m_ImpactImpulse; //0x01D9 
	float m_DetonationTimeVariation; //0x01DD 
	float m_VehicleDetonationRadius; //0x01E1 
	float m_VehicleDetonationActivationDelay; //0x01E5 
	float m_FlyBySoundRadius; //0x01E9 
	float m_FlyBySoundSpeed; //0x01ED 
	float m_Stamina; //0x01F1 
	float m_DistributeDamageOverTime; //0x01F5 
	float m_StartDamage; //0x01F9 
	float m_EndDamage; //0x01FD 
	float m_DamageFalloffStartDistance; //0x0201 
	float m_DamageFalloffEndDistance; //0x0205 
	float m_TimeToArmExplosion; //0x0209 
	float m_FirstFrameTravelDistance; //0x020D 
	unsigned char m_HasVehicleDetonation; //0x0211 
	unsigned char m_InstantHit; //0x0212 
	unsigned char m_StopTrailEffectOnUnspawn; //0x0213 
	char pad_0x0214[0x59]; //0x0214

}; //Size=0x026D

class MeshProjectileEntityData : public ProjectileEntityData
{
public:
	Vector4 m_InitialAngularVelocity; //0x0187 
	char pad_0x0197[0x8]; //0x0197
	float m_InstantAttachableTestDistance; //0x019F 
	float m_InstantAttachableVisualConvergenceDelay; //0x01A3 
	float m_InstantAttachableVisualConvergenceDuration; //0x01A7 
	float m_MaxAttachableInclination; //0x01AB 
	float m_UnspawnAfterDetonationDelay; //0x01AF 
	unsigned char m_IsAttachable; //0x01B3 
	unsigned char m_InstantAttachableTestUnderReticule; //0x01B4 
	unsigned char m_ExtraDamping; //0x01B5 
	char pad_0x01B6[0x1]; //0x01B6

}; //Size=0x01B7

class ProjectileEntityData
{
public:
	char pad_0x0000[0x60]; //0x0000
	wchar_t * m_ResourceName; //0x0060 
	char pad_0x0068[0x28]; //0x0068
	float m_InitialSpeed; //0x0090  fb::ProjectileEntityData
	float m_TimeToLive; //0x0094 
	__int32 m_MaxCount; //0x0098 
	float m_InitMeshHideTime; //0x009C 
	float m_VisualConvergeDistance; //0x00A0 
	float m_VisualConvergenceDelay; //0x00A4 
	float m_VisualConvergenceDuration; //0x00A8 
	float m_ProxyVisualConvergenceDelay; //0x00AC 
	float m_ProxyVisualConvergenceDuration; //0x00B0 
	char pad_0x00B4[0x4]; //0x00B4
	ExplosionEntityData* m_pExplosion; //0x00B8 
	WeaponSuppressionData* m_pSuppressionData; //0x00C0 
	char * m_AmmunitionType; //0x00C8 
	__int32 m_MaterialPair; //0x00D0 
	__int32 m_HitReactionWeaponType; //0x00D4 
	unsigned char m_DetonateOnTimeout; //0x00D8 
	unsigned char m_ServerProjectileDisabled; //0x00D9 
	unsigned char m_HideOnDetonation; //0x00DA 
	unsigned char m_VehicleLightingEnable; //0x00DB 
	char pad_0x00DC[0x44]; //0x00DC
	__int64 m_FlyBySound; //0x0120 fb::BulletEntityData
	ExplosionEntityData* m_DudExplosion; //0x0128 
	float m_Gravity; //0x0130 
	float m_ImpactImpulse; //0x0134 
	float m_DetonationTimeVariation; //0x0138 
	float m_VehicleDetonationRadius; //0x013C 
	float m_VehicleDetonationActivationDelay; //0x0140 
	float m_FlyBySoundRadius; //0x0144 
	float m_FlyBySoundSpeed; //0x0148 
	float m_Stamina; //0x014C 
	float m_DistributeDamageOverTime; //0x0150 
	float m_StartDamage; //0x0154 
	float m_EndDamage; //0x0158 
	float m_DamageFalloffStartDistance; //0x015C 
	float m_DamageFalloffEndDistance; //0x0160 
	float m_TimeToArmExplosion; //0x0164 
	float m_FirstFrameTravelDistance; //0x0168 
	unsigned char m_HasVehicleDetonation; //0x016C 
	unsigned char m_InstantHit; //0x016D 
	unsigned char m_StopTrailEffectOnUnspawn; //0x016E 
	char pad_0x016F[0x18]; //0x016F

}; //Size=0x0187

class WeaponSuppressionData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_MaxMultiplier; //0x0010 
	float m_MinMultiplier; //0x0014 
	float m_MinDistance; //0x0018 
	float m_MaxDistance; //0x001C 

}; //Size=0x0020

class SoldierEntityData : public CharacterEntityData
{
public:
	char N0000D39F[5]; //0x00A7 
	char pad_0x00AC[0x4]; //0x00AC
	float m_MaxHealth; //0x00B0 
	__int32 m_DefaultViewMode; //0x00B4 
	__int32 m_PlayerSpawnType; //0x00B8 
	char pad_0x00BC[0x4]; //0x00BC
	__int64 m_pVoiceOverInfo; //0x00C0 
	__int64 m_pSound; //0x00C8 
	unsigned char m_CharacterLightingEnabled; //0x00D0 
	char pad_0x00D1[0xF]; //0x00D1
	Vector3 m_FLIRKeyColor; //0x00E0 
	char pad_0x00EC[0x4]; //0x00EC
	__int32 m_FootMaterialPair; //0x00F0 
	__int32 m_HeadMaterialPair; //0x00F4 
	N00002CEB N23C73F85[1]; //0x00F8 
	char pad_0x0100[0x8]; //0x0100
	SoldierAimingConstraintsData* m_pAimingConstraints; //0x0108 
	SoldierHeadCollisionData* m_HeadCollision; //0x0110 
	CharacterPhysicsData* m_CharacterPhysics; //0x0118 
	SoldierSprintSettingsData* m_SprintSettings; //0x0120 
	char pad_0x0128[0x8]; //0x0128
	float m_ImpulseReactionTime; //0x0130 
	char pad_0x0134[0x4]; //0x0134
	N00005C78* m_HealthModule; //0x0138 
	N00005C83* m_AbortSpawnInvisibilityInputs; //0x0140 
	N00002CA3* m_BreathControl; //0x0148 
	CollisionData* m_CollisionInfo; //0x0150 
	float m_FLIRValue; //0x0158 
	float m_ExplosionDamageModifier; //0x015C 
	float m_RegenerationDelayModifier; //0x0160 
	float m_FallDamageThreshold; //0x0164 
	unsigned char m_UseSpineXRotation; //0x0168 
	unsigned char m_ShowWeaponWhenDead; //0x0169 
	unsigned char m_EnableGroundmapLighting; //0x016A 
	unsigned char m_LowerGunOnOwnTeam; //0x016B 
	unsigned char m_ProximityCheck; //0x016C 
	unsigned char m_FreeSpaceCheck; //0x016D 
	unsigned char m_CollisionEnabled; //0x016E 
	unsigned char m_PhysicsControlled; //0x016F 
	unsigned char m_IsPushable; //0x0170 
	unsigned char m_HumanPlayerControlled; //0x0171 
	unsigned char m_InteractiveManDownAllowed; //0x0172 
	unsigned char m_ShowNametag; //0x0173 
	char pad_0x0174[0x4]; //0x0174

}; //Size=0x0178

class ControllableEntityData
{
public:
	char pad_0x0000[0x90]; //0x0000
	__int32 m_DefaultTeam; //0x0090 
	float m_LowHealthThreshold; //0x0094 
	__int32 m_MaterialPair; //0x0098 
	unsigned char m_UsePrediction; //0x009C 
	unsigned char m_ResetTeamOnLastPlayerExits; //0x009D 
	unsigned char m_Immortal; //0x009E 
	unsigned char m_FakeImmortal; //0x009F 
	unsigned char m_ForceForegroundRendering; //0x00A0 
	unsigned char m_IgnorePhysicsCorrection; //0x00A1 
	char pad_0x00A2[0x5]; //0x00A2

}; //Size=0x00A7

class CharacterEntityData : public ControllableEntityData
{
public:
}; //Size=0x00A7

class ClientRagdollComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	RagdollComponentData* RagdollComponentData; //0x0010 
	char pad_0x0018[0xA8]; //0x0018
	QuatTransform m_ActiveWorldTransforms; //0x00C0 Array

}; //Size=0x00E0

class QuatTransform
{
public:
	Vector4 m_TransAndScale; //0x0000 
	Vector4 m_Rotation; //0x0010 

}; //Size=0x0020

class ClientSoldierBreathComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_pData; //0x0010 
	char pad_0x0018[0x8]; //0x0018
	__int64 m_pEntry; //0x0020 
	char pad_0x0028[0x1C]; //0x0028
	float m_BreathControlTimer; //0x0044 
	float m_BreathControlMultiplier; //0x0048 
	float m_BreathControlPenaltyTimer; //0x004C 
	float m_BreathControlPenaltyMultiplier; //0x0050 
	float m_BreathControlActive; //0x0054 
	float m_BreathControlInput; //0x0058 
	char pad_0x005C[0x10]; //0x005C

}; //Size=0x006C

class ClientLevel
{
public:
	char pad_0x0000[0x38]; //0x0000
	LevelData* m_pLevelData; //0x0038 
	__int64 m_pTeamInfo; //0x0040 
	char pad_0x0048[0x8]; //0x0048
	LevelSetupOption* m_pLevelOption; //0x0050 
	__int32 m_DifficultyIndex; //0x0058 
	char pad_0x005C[0xC4]; //0x005C
	Level* m_pPhysicsManager; //0x0120 
	char pad_0x0128[0x8]; //0x0128
	__int64 m_pGameWorld; //0x0130 

}; //Size=0x0138

class LevelData : public WorldData
{
public:
	__int64 m_pLevelReference; //0x0060 
	__int64 m_PathfindingBlobs; //0x0068 
	__int64 m_AISystem; //0x0070 
	__int64 m_AI2System; //0x0078 
	float m_WorldSizeXZ; //0x0080 
	char pad_0x0084[0x4]; //0x0084
	__int64 m_LevelDescription; //0x0088 
	wchar_t * m_GameConfigurationName; //0x0090 
	char pad_0x0098[0x10]; //0x0098
	char * N23E2CED2; //0x00A8 
	float N23E2CED3; //0x00B0 
	float N00006A8A; //0x00B4 
	char pad_0x00B8[0x18]; //0x00B8
	float N23E2CED7; //0x00D0 
	char pad_0x00D4[0x44]; //0x00D4
	float m_DefaultFOV; //0x0118 
	char pad_0x011C[0x4]; //0x011C

}; //Size=0x0120

class WorldData
{
public:
	char pad_0x0000[0x38]; //0x0000
	__int64 m_pRuntimeMaterialGrid; //0x0038 
	__int32 m_OffscreenDecalTextureEntryCount; //0x0040 
	char pad_0x0044[0xC]; //0x0044
	unsigned char m_IsWin32SubLevel; //0x0050 
	unsigned char m_IsXenonSubLevel; //0x0051 
	unsigned char m_IsPs3SubLevel; //0x0052 
	unsigned char m_IsGen4aSubLevel; //0x0053 
	unsigned char m_IsGen4bSubLevel; //0x0054 
	unsigned char m_RememberStateOnStreamOut; //0x0055 
	char pad_0x0056[0x2]; //0x0056
	CompnentsList* m_pComponents; //0x0058 

}; //Size=0x0060

class CompnentsList
{
public:
	__int64 m_pComponent; //0x0000 **
	__int64 m_pComponent; //0x0008 
	__int64 m_pComponent; //0x0010 
	__int64 m_pComponent; //0x0018 
	__int64 m_pComponent; //0x0020 
	__int64 m_pComponent; //0x0028 
	__int64 m_pComponent; //0x0030 
	__int64 m_pComponent; //0x0038 
	__int64 m_pComponent; //0x0040 
	__int64 m_pComponent; //0x0048 
	__int64 m_pComponent; //0x0050 
	__int64 m_pComponent; //0x0058 
	__int64 m_pComponent; //0x0060 
	__int64 m_pComponent; //0x0068 
	__int64 m_pComponent; //0x0070 
	__int64 m_pComponent; //0x0078 
	__int64 m_pComponent; //0x0080 
	__int64 m_pComponent; //0x0088 
	__int64 m_pComponent; //0x0090 

}; //Size=0x0098

class LevelSetupOption
{
public:
	wchar_t * m_Criterion; //0x0000 
	wchar_t * m_Value; //0x0008 

}; //Size=0x0010

class HavokPhysicsManager
{
public:
	char pad_0x0000[0x58]; //0x0000
	N00006A9B* m_pRayCaster; //0x0058 
	char pad_0x0060[0x150]; //0x0060
	Physics* N280DA5D6; //0x01B0 
	char pad_0x01B8[0x8]; //0x01B8
	__int64 m_pPhysicsSettings; //0x01C0 
	__int64 m_pPhysicsRenderSettings; //0x01C8 
	char pad_0x01D0[0x20]; //0x01D0

}; //Size=0x01F0

class BorderInputNode
{
public:
	char pad_0x0000[0x8]; //0x0000
	InputCache* m_pInputCache; //0x0008 
	char pad_0x0010[0x130]; //0x0010
	Keyboard* m_pKeyboard; //0x0140 
	char pad_0x0148[0x58]; //0x0148

}; //Size=0x01A0

class Keyboard
{
public:
	char pad_0x0000[0x68]; //0x0000
	__int64 m_pKeyboardInputActionData; //0x0068 
	char pad_0x0070[0x10]; //0x0070
	__int64 m_pPadInputActionData; //0x0080 

}; //Size=0x0088

class OFFSET_BORDERINPUTNODE
{
public:
	BorderInputNode* lpBorderInputNode; //0x0000 

}; //Size=0x0008

class InputCache
{
public:
	char pad_0x0000[0xB8]; //0x0000

}; //Size=0x00B8

class ClientSettings : public SystemSettings
{
public:
	char pad_0x0008[0xB0]; //0x0008
	unsigned char m_IsSpectator; //0x00B8 
	unsigned char m_VsyncEnable; //0x00B9 
	unsigned char m_VsyncDuringLoadingScreenEnable; //0x00BA 
	unsigned char m_VisualFrameInterpolation; //0x00BB 
	unsigned char m_DebrisClusterEnabled; //0x00BC 
	unsigned char m_VegetationEnabled; //0x00BD 
	unsigned char m_ForceEnabled; //0x00BE 
	unsigned char m_WorldRenderEnabled; //0x00BF 
	char pad_0x00C0[0x98]; //0x00C0

}; //Size=0x0158

class SystemSettings
{
public:
	__int32 m_GamePlatform; //0x0000 
	char pad_0x0004[0x4]; //0x0004

}; //Size=0x0008

class OFFSET_SYNCEDBFSETTINGS
{
public:
	SyncedBFSettings* lpSyncedBFSettings; //0x0000 
	char pad_0x0008[0xC0]; //0x0008

}; //Size=0x00C8

class SyncedBFSettings
{
public:
	char pad_0x0000[0xC]; //0x0000
	DWORD N00003016; //0x000C 
	char * m_Name; //0x0010 
	__int32 m_Platform; //0x0018 
	char pad_0x001C[0x4]; //0x001C
	float m_GameModeCounterModifier; //0x0020 
	float m_RoundTimeLimit; //0x0024 
	__int64 N00005566; //0x0028 
	__int32 m_Team1Faction; //0x0030 
	__int32 m_Team2Faction; //0x0034 
	__int32 m_Team3Faction; //0x0038 
	__int32 m_Team4Faction; //0x003C 
	DWORD m_CommanderSize; //0x0040 
	char pad_0x0044[0x4]; //0x0044
	char * m_FieldSpecLevels; //0x0048 
	__int32 m_ServerType; //0x0050 
	unsigned char m_AllUnlocksUnlocked; //0x0054 
	unsigned char m_NoMinimap; //0x0055 
	unsigned char m_NoHud; //0x0056 
	unsigned char m_NoMinimapSpotting; //0x0057 
	unsigned char m_No3dSpotting; //0x0058 
	unsigned char m_NoNameTag; //0x0059 
	unsigned char m_OnlySquadLeaderSpawn; //0x005A 
	unsigned char m_TeamSwitchingAllowed; //0x005B 
	unsigned char m_RevertBackToBF3KillerCamera; //0x005C 
	unsigned char m_DisableHitIndicators; //0x005D 
	unsigned char m_DisableVehicleCommanderActions; //0x005E 
	unsigned char m_IsCompetitive; //0x005F 
	unsigned char m_CommanderEnabled; //0x0060 
	unsigned char m_FieldUpgradeSystemActive; //0x0061 
	unsigned char m_NotifyServerWhenIgnoringDamage; //0x0062 
	unsigned char m_ForceCrashWhenIgnoringDamage; //0x0063 

}; //Size=0x0064

class OFFSET_WORLDRENDERSETTINGS
{
public:
	WorldRenderSettings* m_pWorldRenderSettings; //0x0000 
	char pad_0x0008[0x70]; //0x0008
	float N000032B0; //0x0078 
	float N000032BB; //0x007C 
	float N000032B1; //0x0080 
	char pad_0x0084[0x3C]; //0x0084
	DWORD N000032B9; //0x00C0 
	DWORD N000032E6; //0x00C4 
	DWORD N000032BF; //0x00C8 
	char pad_0x00CC[0x14]; //0x00CC
	DWORD N000032C2; //0x00E0 
	unsigned char N000033DD; //0x00E4 
	unsigned char N000033DF; //0x00E5 
	unsigned char N000033E2; //0x00E6 
	unsigned char N000033E0; //0x00E7 
	unsigned char N000032C3; //0x00E8 
	unsigned char N000033E9; //0x00E9 
	unsigned char N000033ED; //0x00EA 
	unsigned char N000033F0; //0x00EB 
	unsigned char N000033EE; //0x00EC 
	unsigned char N000033EA; //0x00ED 
	unsigned char N000033F5; //0x00EE 
	unsigned char N000033EB; //0x00EF 
	unsigned char N000032C4; //0x00F0 
	unsigned char N000033FA; //0x00F1 
	unsigned char N000033FF; //0x00F2 
	unsigned char N00003403; //0x00F3 
	unsigned char N00003400; //0x00F4 
	unsigned char N000033FB; //0x00F5 
	unsigned char N0000340A; //0x00F6 
	unsigned char N000033FC; //0x00F7 
	unsigned char N000032C5; //0x00F8 
	unsigned char N00003412; //0x00F9 
	unsigned char N00003416; //0x00FA 
	unsigned char N00003419; //0x00FB 
	unsigned char N00003417; //0x00FC 
	unsigned char N00003413; //0x00FD 
	unsigned char N0000341D; //0x00FE 
	unsigned char N00003414; //0x00FF 
	unsigned char N000032C6; //0x0100 
	unsigned char N00003424; //0x0101 
	unsigned char N00003428; //0x0102 
	unsigned char N0000342B; //0x0103 
	unsigned char N00003429; //0x0104 
	unsigned char N00003425; //0x0105 
	unsigned char N00003432; //0x0106 
	unsigned char N00003426; //0x0107 
	unsigned char N000032C7; //0x0108 
	unsigned char N00003436; //0x0109 
	unsigned char N0000343B; //0x010A 
	unsigned char N0000343E; //0x010B 
	unsigned char N0000343C; //0x010C 
	unsigned char N00003437; //0x010D 
	unsigned char N00003441; //0x010E 
	unsigned char N00003438; //0x010F 
	unsigned char N000032C8; //0x0110 
	unsigned char N00003455; //0x0111 
	unsigned char N0000345E; //0x0112 
	unsigned char N00003462; //0x0113 
	unsigned char N0000345F; //0x0114 
	unsigned char N00003456; //0x0115 
	unsigned char N0000345A; //0x0116 
	unsigned char N00003457; //0x0117 
	unsigned char N000032C9; //0x0118 
	unsigned char N00003450; //0x0119 
	unsigned char N00003469; //0x011A 
	unsigned char N0000346D; //0x011B 
	unsigned char N0000346A; //0x011C 
	unsigned char N00003451; //0x011D 
	unsigned char N00003471; //0x011E 
	unsigned char N00003452; //0x011F 
	unsigned char N000032CA; //0x0120 
	unsigned char N0000347D; //0x0121 
	unsigned char N00003485; //0x0122 
	unsigned char N00003488; //0x0123 
	unsigned char N00003486; //0x0124 
	unsigned char N0000347E; //0x0125 
	unsigned char N00003482; //0x0126 
	unsigned char N0000347F; //0x0127 
	unsigned char N000032CB; //0x0128 
	unsigned char N00003475; //0x0129 
	unsigned char N0000347A; //0x012A 
	unsigned char N0000348F; //0x012B 
	unsigned char N0000347B; //0x012C 
	unsigned char N00003476; //0x012D 
	unsigned char N00003494; //0x012E 
	unsigned char N00003477; //0x012F 
	unsigned char N000032CC; //0x0130 
	unsigned char N000032DD; //0x0131 
	unsigned char N000032E1; //0x0132 
	unsigned char N000032DE; //0x0133 
	unsigned char N000032D0; //0x0134 
	unsigned char m_drawSky; //0x0135 
	unsigned char m_SkyFogEnable; //0x0136 
	unsigned char m_SkyHeightFogEnable; //0x0137 
	unsigned char m_SkyForwardScatteringEnable; //0x0138 
	unsigned char N000032D9; //0x0139 
	unsigned char N00003319; //0x013A 
	unsigned char N0000331C; //0x013B 
	unsigned char N0000331A; //0x013C 
	unsigned char N000032DA; //0x013D 
	unsigned char N00003320; //0x013E 
	unsigned char N000032DB; //0x013F 
	char pad_0x0140[0x10]; //0x0140
	Vector4 m_OverlayColor; //0x0150 
	__int32 m_GenericEntityMaxVisibleEntityCount; //0x0160 
	__int32 m_DrawDebugGroundHeight; //0x0164 
	char pad_0x0168[0xE8]; //0x0168
	DWORD N00003309; //0x0250 
	unsigned char m_SimpleRenderingEnable; //0x0254 
	unsigned char m_GenericEntityRendererEnable; //0x0255 
	unsigned char m_ZBufferShadowTestEnable; //0x0256 
	unsigned char N00003314; //0x0257 
	unsigned char N0000330A; //0x0258 
	unsigned char N00003314; //0x0259 
	unsigned char N00003318; //0x025A 
	unsigned char N0000331B; //0x025B 
	unsigned char N00003319; //0x025C 
	unsigned char N00003315; //0x025D 
	unsigned char m_CloudShadowEnable; //0x025E 
	unsigned char m_OverrideDynamicAO; //0x025F 
	unsigned char m_DrawDebugDynamicAO; //0x0260 
	unsigned char N00003323; //0x0261 
	unsigned char N00003327; //0x0262 
	unsigned char N0000332A; //0x0263 
	unsigned char N00003328; //0x0264 
	unsigned char N00003324; //0x0265 
	unsigned char N0000332F; //0x0266 
	unsigned char N00003325; //0x0267 
	unsigned char N0000330C; //0x0268 
	unsigned char N00003333; //0x0269 
	unsigned char N00003337; //0x026A 
	unsigned char N0000333A; //0x026B 
	unsigned char N00003338; //0x026C 
	unsigned char N00003334; //0x026D 
	unsigned char N0000333E; //0x026E 
	unsigned char N00003335; //0x026F 
	unsigned char N0000330D; //0x0270 
	unsigned char N00003344; //0x0271 
	unsigned char N00003348; //0x0272 
	unsigned char N0000334B; //0x0273 
	unsigned char N00003349; //0x0274 
	unsigned char N00003345; //0x0275 
	unsigned char N0000334F; //0x0276 
	unsigned char N00003346; //0x0277 
	unsigned char N0000330E; //0x0278 
	unsigned char N00003353; //0x0279 
	unsigned char N00003357; //0x027A 
	unsigned char N0000335A; //0x027B 
	unsigned char N00003358; //0x027C 
	unsigned char N00003354; //0x027D 
	unsigned char N0000335E; //0x027E 
	unsigned char N00003355; //0x027F 
	unsigned char N0000330F; //0x0280 
	unsigned char N00003362; //0x0281 
	unsigned char N00003366; //0x0282 
	unsigned char N00003369; //0x0283 
	unsigned char N00003367; //0x0284 
	unsigned char N00003363; //0x0285 
	unsigned char N0000336D; //0x0286 
	unsigned char N00003364; //0x0287 
	unsigned char N0000330A; //0x0288 
	unsigned char N00003373; //0x0289 
	unsigned char N00003377; //0x028A 
	unsigned char N0000337A; //0x028B 
	unsigned char N00003378; //0x028C 
	unsigned char N00003374; //0x028D 
	unsigned char N0000338B; //0x028E 
	unsigned char N00003375; //0x028F 
	unsigned char N0000330B; //0x0290 
	unsigned char N0000338F; //0x0291 
	unsigned char N00003393; //0x0292 
	unsigned char N000033A5; //0x0293 
	unsigned char N00003394; //0x0294 
	unsigned char N00003390; //0x0295 
	unsigned char N0000339A; //0x0296 
	unsigned char N00003391; //0x0297 
	unsigned char N0000330C; //0x0298 
	unsigned char N0000339D; //0x0299 
	unsigned char N000033A8; //0x029A 
	unsigned char N000033AB; //0x029B 
	unsigned char N000033A9; //0x029C 
	unsigned char N0000339E; //0x029D 
	unsigned char N000033AF; //0x029E 
	unsigned char N0000339F; //0x029F 
	unsigned char N0000330D; //0x02A0 
	unsigned char N000033B3; //0x02A1 
	unsigned char N000033BA; //0x02A2 
	unsigned char N000033BE; //0x02A3 
	unsigned char N000033BB; //0x02A4 
	unsigned char N000033B4; //0x02A5 
	unsigned char N000033B7; //0x02A6 
	unsigned char N000033B5; //0x02A7 
	unsigned char N0000330E; //0x02A8 
	unsigned char N000033C4; //0x02A9 
	unsigned char N000033C8; //0x02AA 
	unsigned char N000033CB; //0x02AB 
	unsigned char N000033C9; //0x02AC 
	unsigned char N000033C5; //0x02AD 
	unsigned char N000033D0; //0x02AE 
	unsigned char N000033C6; //0x02AF 
	unsigned char N0000330F; //0x02B0 
	unsigned char m_LightCubeMapStencilEnable; //0x02B1 
	unsigned char m_DrawDebugIndirectCubeMapEnable; //0x02B2 
	char pad_0x02B3[0x15]; //0x02B3

m_SimpleRenderingEnable


}; //Size=0x02C8

class WorldRenderSettings
{
public:
	char pad_0x0000[0x27E]; //0x0000
	unsigned char m_LensFlaresEnable; //0x027E 
	char pad_0x027F[0x3]; //0x027F
	unsigned char m_CloudShadowEnable; //0x0282 
	char pad_0x0283[0x9]; //0x0283

}; //Size=0x028C

class TopSecretInfo
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class ClientConnection
{
public:
	char pad_0x0000[0x20]; //0x0000

}; //Size=0x0020

class ClientConnection
{
public:
	char pad_0x0000[0x10]; //0x0000

}; //Size=0x0010

class ConnectionStats
{
public:
	double m_LifeTime; //0x0000 
	__int32 m_BytesSent; //0x0008 
	__int32 m_BytesReceived; //0x000C 
	__int32 m_PacketsSent; //0x0010 
	__int32 m_PacketsReceived; //0x0014 
	__int32 m_PingsSent; //0x0018 
	__int32 m_PingsReceived; //0x001C 
	__int32 m_ForceNotifyPacketsReceived; //0x0020 
	__int32 m_ForceNotifyPacketsSent; //0x0024 
	__int32 m_PacketsAccepted; //0x0028 
	__int32 m_PacketsLost; //0x002C 
	__int32 m_PacketsNotifiedLost; //0x0030 
	char pad_0x0034[0x4]; //0x0034

}; //Size=0x0038

class ClientDamageStream
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OFFSET_DXRENDERER
{
public:
	DxRenderer* lpDxRenderer; //0x0000 

}; //Size=0x0008

class DxRenderer
{
public:
	char pad_0x0000[0x28]; //0x0000
	__int32 m_FrameCounter; //0x0028 
	unsigned char m_FrameInProgress; //0x002C 
	char pad_0x002D[0xB]; //0x002D
	Screen* m_pScreen; //0x0038 
	char pad_0x0040[0x40]; //0x0040
	DxDisplaySettings* m_pDisplaySettings; //0x0080 
	char pad_0x0088[0x78]; //0x0088
	__int64 m_pDevice; //0x0100 ID3D11Device*
	__int64 m_pContext; //0x0108 ID3D11DeviceContext*
	char pad_0x0110[0x260]; //0x0110
	wchar_t * m_pAdapterName; //0x0370 
	char pad_0x0378[0x458]; //0x0378
	unsigned char N00002DF2; //0x07D0 
	char pad_0x07D1[0x6]; //0x07D1
	N00002E04* N00002E02; //0x07D7 
	char pad_0x07DF[0x59]; //0x07DF

}; //Size=0x0838

class Screen
{
public:
	__int64 m_HWND; //0x0000 
	char pad_0x0008[0x40]; //0x0008
	__int32 m_FullscreenMode; //0x0048 
	unsigned char m_TopWindow; //0x004C 
	unsigned char m_Minimized; //0x004D 
	unsigned char m_Maximized; //0x004E 
	unsigned char m_Resizing; //0x004F 
	char pad_0x0050[0x8]; //0x0050
	RenderScreenInfo m_ScreenInfo; //0x0058 
	char pad_0x0070[0x78]; //0x0070
	__int64 m_pSwapChain; //0x00E8 
	__int64 m_pBackBufferTexture; //0x00F0 
	char pad_0x00F8[0x10]; //0x00F8
	__int64 m_pDefaultRenderTargetView; //0x0108 

}; //Size=0x0110

class RenderScreenInfo
{
public:
	__int32 m_Width; //0x0000 
	__int32 m_Height; //0x0004 
	char pad_0x0008[0x10]; //0x0008

}; //Size=0x0018

class OFFSET_GAMERENDERER
{
public:
	GameRenderer* lpGameRenderer; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class GameRenderer
{
public:
	char pad_0x0000[0x48]; //0x0000
	GameRenderSettings* m_pRenderSettings; //0x0048 
	char pad_0x0050[0x10]; //0x0050
	GameRenderViewParams* m_pViewParams; //0x0060 
	char pad_0x0068[0xC0]; //0x0068
	unsigned char m_firstPerson; //0x0128 
	char pad_0x0129[0x7]; //0x0129
	__int32 N00005729; //0x0130 
	unsigned char N00005797; //0x0134 
	char pad_0x0135[0xD3]; //0x0135

}; //Size=0x0208

class GameRenderViewParams : public RenderView
{
public:
	RenderView m_PrevView; //0x04E0 
	RenderView m_SecondaryStreamingView; //0x09C0 
	unsigned char m_SecondaryStreamingViewEnable; //0x0EA0 
	char pad_0x0EA1[0x7]; //0x0EA1

}; //Size=0x0EA8

class RenderView : public RenderViewDesc
{
public:
	Frustum m_Frustum; //0x00F0 
	float m_FovX; //0x0250 
	float m_DepthHeightRatio; //0x0254 
	float m_FovScale; //0x0258 
	float m_FovScaleSqr; //0x025C 
	matrix3x4_t m_ViewMatrix; //0x0260 
	matrix3x4_t m_ViewMatrixTranspose; //0x02A0 
	matrix3x4_t m_ViewMatrixInverse; //0x02E0 
	matrix3x4_t m_ProjectionMatrix; //0x0320 
	matrix3x4_t m_ViewMatrixAtOrigin; //0x0360 
	matrix3x4_t m_ProjectionTranspose; //0x03A0 
	matrix3x4_t m_ProjectionInverse; //0x03E0 
	matrix3x4_t m_ViewProjection; //0x0420 
	matrix3x4_t m_ViewProjectionTranspose; //0x0460 
	matrix3x4_t m_ViewProjectionInverse; //0x04A0 

}; //Size=0x04E0

class RenderViewDesc
{
public:
	matrix3x4_t m_TransformFirstPerson; //0x0000 
	matrix3x4_t m_Transform; //0x0040 
	Vector4 m_Trans; //0x0080 
	Vector2 m_ViewportOffset; //0x0090 
	Vector2 m_ViewportScale; //0x0098 
	Vector4 m_ObliqueClipPlane; //0x00A0 
	__int32 m_Type; //0x00B0 
	float m_FovY; //0x00B4 
	float m_DefaultFovY; //0x00B8 
	float m_NearPlane; //0x00BC 
	float m_FarPlane; //0x00C0 
	float m_Aspect; //0x00C4 
	float m_OrthoWidth; //0x00C8 
	float m_OrthoHeight; //0x00CC 
	float m_StereoSeparation; //0x00D0 
	float m_StereoConvergence; //0x00D4 
	unsigned char m_ObliqueClipEnable; //0x00D8 
	unsigned char m_RightHanded; //0x00D9 
	char pad_0x00DA[0x16]; //0x00DA

}; //Size=0x00F0

class Frustum
{
public:
	matrix3x4_t m_Transform; //0x0000 
	AxisAlignedBox m_BoundingBox; //0x0040 
	char pad_0x0060[0x80]; //0x0060
	Vector4 m_Center; //0x00E0 
	char pad_0x00F0[0x60]; //0x00F0
	float m_Radius; //0x0150 
	float m_RadiusSqr; //0x0154 
	unsigned char m_RightHanded; //0x0158 
	char pad_0x0159[0x7]; //0x0159

}; //Size=0x0160

class AxisAlignedBox
{
public:
	Vector4 m_Min; //0x0000 
	Vector4 m_Max; //0x0010 

}; //Size=0x0020

class GameRenderSettings
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int32 m_InactiveSkipFrameCount; //0x0010 
	float m_ResolutionScale; //0x0014 
	__int32 m_MantleEnable; //0x0018 
	char pad_0x001C[0x2C]; //0x001C
	float m_ForceFov; //0x0048 
	float m_FovMultiplier; //0x004C 
	char pad_0x0050[0x48]; //0x0050
	unsigned char m_Enable; //0x0098 
	unsigned char m_NullRendererEnable; //0x0099 
	unsigned char m_JobEnable; //0x009A 
	unsigned char m_BuildJobSyncEnable; //0x009B 
	unsigned char m_EarlyGpuSyncEnable; //0x009C 
	unsigned char m_DrawDebugInfo; //0x009D 
	unsigned char m_DrawScreenInfo; //0x009E 
	unsigned char m_FullScreen; //0x009F 
	unsigned char m_ForceVSyncEnable; //0x00A0 
	char pad_0x00A1[0x10]; //0x00A1
	unsigned char N273880E9; //0x00B1 
	unsigned char N00005735; //0x00B2 
	char pad_0x00B3[0x2]; //0x00B3
	unsigned char m_StaticModelEnable; //0x00B5 
	char pad_0x00B6[0xB]; //0x00B6
	unsigned char N273880EB; //0x00C1 
	unsigned char N0000573D; //0x00C2 
	char pad_0x00C3[0x46]; //0x00C3

}; //Size=0x0109

class DxDisplaySettings : public SystemSettings
{
public:
	__int64 m_DebugBreakIgnoredIDs; //0x0008 
	__int32 m_FullscreenHeight; //0x0010 
	__int32 m_FullscreenWidth; //0x0014 
	float m_FullscreenRefreshRate; //0x0018 
	__int32 m_FullscreenOutputIndex; //0x001C 
	__int32 m_PresentInterval; //0x0020 
	__int32 m_PresentImmediateThreshold; //0x0024 
	__int32 m_RenderAheadLimit; //0x0028 
	float m_StereoDepth; //0x002C 
	float m_StereoConvergenceScale; //0x0030 
	float m_StereoSeperationScale; //0x0034 
	float m_StereoSoldierZoomConvergenceScale; //0x0038 
	__int32 m_NvidiaMinDriverVersion; //0x003C 
	wchar_t * m_AmdMinDriverVersion; //0x0040 
	float m_LowResDisplayPlaneScale; //0x0048 
	unsigned char m_NullDriverEnable; //0x004C 
	unsigned char m_RefDriverEnable; //0x004D 
	unsigned char m_WarpDriverEnable; //0x004E 
	unsigned char m_Dx10Dot0Enable; //0x004F 
	unsigned char m_Dx10Dot1Enable; //0x0050 
	unsigned char m_Dx10PlusEnable; //0x0051 
	unsigned char m_Dx11Enable; //0x0052 
	unsigned char m_Dx11Dot1Enable; //0x0053 
	unsigned char m_Dx11Dot1RunetimeEnable; //0x0054 
	unsigned char m_CreateMinimalWindow; //0x0055 
	unsigned char M_DriverInternalThreadingEnable; //0x0056 
	unsigned char m_DxDiagDriverDetectionEnable; //0x0057 
	unsigned char m_DxDiagDriverDetectionEnable; //0x0058 
	char pad_0x0059[0x1F]; //0x0059

}; //Size=0x0078

class SkeletonAsset
{
public:
	char pad_0x0000[0x18]; //0x0000
	StringList* m_ppNames; //0x0018 
	char pad_0x0020[0x20]; //0x0020

}; //Size=0x0040

class StringList
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class GameAnimatable
{
public:
	char pad_0x0000[0x70]; //0x0000

}; //Size=0x0070

class ClientGameView
{
public:
	char N28C27396[8]; //0x0000 
	__int32 m_ActiveCamera; //0x0008 
	char N00005801[12]; //0x000C 
	__int32 N0000D636; //0x0018 
	char pad_0x001C[0x94]; //0x001C
	Vector4 m_CameraTargetDistance; //0x00B0 
	__int64 m_pFreeCameraScene; //0x00C0 
	FreeCamera* m_pFreeCamera; //0x00C8 fb::FreeCamera*
	__int32 m_FreeCameraMode; //0x00D0 
	__int32 m_FreeCameraPriority; //0x00D4 
	unsigned char m_CameraPosInitialized1; //0x00D8 
	unsigned char m_CameraPosInitialized2; //0x00D9 
	unsigned char m_CameraPosInitialized3; //0x00DA 
	unsigned char m_FreeCameraActivated; //0x00DB 
	char pad_0x00DC[0x4]; //0x00DC
	N0000D63D* m_pEntry; //0x00E0 
	N0000D648* N28C3D60B; //0x00E8 
	char pad_0x00F0[0x78]; //0x00F0

}; //Size=0x0168

class FreeCamera
{
public:
	char pad_0x0000[0x10]; //0x0000
	matrix3x4_t m_Transform; //0x0010 
	matrix3x4_t m_Transform2; //0x0050 
	char pad_0x0090[0x18]; //0x0090
	float m_Fov; //0x00A8 
	float m_DotFocusDistance; //0x00AC 
	char pad_0x00B0[0x60]; //0x00B0
	N0000D6BF* N0000D6BD; //0x0110 

}; //Size=0x0118

class ClientVehicleEntity
{
public:
	N00002D2F* N28C9D2ED; //0x0000 
	char pad_0x0008[0x28]; //0x0008
	VehicleEntityData* m_pVehicleData; //0x0030 
	char pad_0x0038[0x108]; //0x0038
	ClientVehicleHealthComponent* ClientVehicleHealthComponent; //0x0140 
	ClientVehicleBouncePhysicsComponent* m_pVehicleBouncePhysics; //0x0148 
	char pad_0x0150[0xE8]; //0x0150
	DynamicPhysicsEntity* m_pPhysicsEntity; //0x0238 
	char pad_0x0240[0x10]; //0x0240
	N000055E5* m_childrenAABB; //0x0250 
	char pad_0x0258[0x28]; //0x0258
	Vector3 m_Velocity; //0x0280 
	char pad_0x028C[0x4]; //0x028C
	Vector3 m_prevVelocity; //0x0290 
	char pad_0x029C[0x144]; //0x029C
	ClientChassisComponent* m_pChassisComponent; //0x03E0 
	char N000055DB[91]; //0x03E8 
	unsigned char N0000D9D0; //0x0443 
	char pad_0x0444[0x8F]; //0x0444
	unsigned char m_RenderFlag; //0x04D3 
	char pad_0x04D4[0x94]; //0x04D4

}; //Size=0x0568

class ClientVehicleBouncePhysicsComponent
{
public:
	VehicleBouncePhysicsComponentData* m_pData; //0x0000 
	char pad_0x0008[0x8]; //0x0008
	__int64 m_pDynamicPhysicsEntity; //0x0010 
	char pad_0x0018[0x60]; //0x0018

}; //Size=0x0078

class VehicleBouncePhysicsComponentData
{
public:
	char pad_0x0000[0x80]; //0x0000
	float m_MaxReflectionVecUp; //0x0080 
	float m_MaxFacingAngle; //0x0084 
	float m_MaxVehicleFacingAngle; //0x0088 
	float m_CounterImpulseStrength; //0x008C 
	char pad_0x0090[0x4]; //0x0090
	float m_CollisionDamageModifer; //0x0094 
	float m_CollisionDamageDealtModifier; //0x0098 
	char pad_0x009C[0x4]; //0x009C

}; //Size=0x00A0

class HealthComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_pHealthComponentData; //0x0010 
	char pad_0x0018[0x20]; //0x0018
	float m_VehicleHealth; //0x0038 
	char pad_0x003C[0x4]; //0x003C

}; //Size=0x0040

class ClientChassisComponent : public ClientPartComponent
{
public:
	char pad_0x00B8[0x28]; //0x00B8
	Vector4 m_InitialPosition; //0x00E0 
	__int64 m_pPhysicsEntity; //0x00F0 
	char pad_0x00F8[0x148]; //0x00F8

}; //Size=0x0240

class ClientPartComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	VehicleComponentData* m_pComponentData; //0x0010 
	char pad_0x0018[0x8]; //0x0018
	__int64 m_pEntry; //0x0020 
	char pad_0x0028[0x10]; //0x0028
	__int64 m_pPhysicsEntity; //0x0038 
	char pad_0x0040[0x78]; //0x0040

}; //Size=0x00B8

class VehicleComponentData
{
public:
	char pad_0x0000[0x90]; //0x0000
	VehicleConfigData* m_pVehicleConfigData; //0x0090 
	char pad_0x0098[0xE8]; //0x0098

}; //Size=0x0180

class VehicleConfigData
{
public:
	char pad_0x0000[0x10]; //0x0000
	AeroDynamicPhysics m_AeroDynamicPhysics; //0x0010 
	MotorbikeData m_MotorbikePhysics; //0x0018 
	Vector4 m_CenterOfMass; //0x0020 
	Vector4 m_CenterOfMassHandlingOffset; //0x0030 
	Vector4 m_InertiaOverride; //0x0040 
	Vector4 m_InertiaModifier; //0x0050 
	char pad_0x0060[0x10]; //0x0060
	__int64 m_pMotionDampData; //0x0070 
	char pad_0x0078[0x74]; //0x0078
	float m_BodyMass; //0x00EC 
	float m_GravityModifier; //0x00F0 
	float m_YawMin; //0x00F4 
	char pad_0x00F8[0x68]; //0x00F8
	float N28DAC681; //0x0160 
	char pad_0x0164[0x5C]; //0x0164

}; //Size=0x01C0

class AeroDynamicPhysics
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class MotorbikeData
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OnlineManager
{
public:
	char pad_0x0000[0x30]; //0x0000
	ClientPeer* m_pClientPeer; //0x0030 
	ClientConnection* m_pClientConnection; //0x0038 
	char pad_0x0040[0x50]; //0x0040

}; //Size=0x0090

class N015CBF0A
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N015CCF11
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N016FEB31
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class idToPlayerMapOffset
{
public:
	ClientPlayer* Player01; //0x0000 
	ClientPlayer* N0170AF57; //0x0008 
	ClientPlayer* N0170AF58; //0x0010 
	ClientPlayer* N0170AF59; //0x0018 
	ClientPlayer* N0170AF5A; //0x0020 
	ClientPlayer* N0170AF5B; //0x0028 
	ClientPlayer* N0170AF5C; //0x0030 
	N0000D885* N0170AF5D; //0x0038 
	N0000D888* N0000671B; //0x0040 
	N0000D88B* N0000671C; //0x0048 
	N0000D88E* N0000671D; //0x0050 
	N0000D891* N0000671E; //0x0058 
	N0000D894* N0000671F; //0x0060 
	N0000D897* N00006720; //0x0068 
	N0000D89A* N00006721; //0x0070 
	N0000D89D* N00006722; //0x0078 
	N0000D8A0* N00006723; //0x0080 
	N0000D8A3* N00006724; //0x0088 
	N0000D8A6* N00006725; //0x0090 
	N0000D8A9* N00006726; //0x0098 
	ClientPlayer* N00006727; //0x00A0 
	ClientPlayer* N00006728; //0x00A8 
	N0000D8B2* N00006729; //0x00B0 
	N0000D8B5* N0000672A; //0x00B8 
	N0000D8B8* N0000672B; //0x00C0 
	N0000D8BB* N0000672C; //0x00C8 
	N0000D8BE* N0000672D; //0x00D0 
	N0000D8C1* N0000672E; //0x00D8 
	N0000D8C4* N0000672F; //0x00E0 
	N0000D8C7* N00006730; //0x00E8 
	N0000D8CA* N00006731; //0x00F0 
	N0000D8CD* N00006732; //0x00F8 
	N0000D8D0* N00006746; //0x0100 
	N0000D8D3* N00006747; //0x0108 
	N0000D8D6* N00006748; //0x0110 
	N0000D8D9* N00006749; //0x0118 
	N0000D8DC* N0000674A; //0x0120 
	N0000D8DF* N0000674B; //0x0128 
	N0000D8E2* N0000674C; //0x0130 
	N0000D8E5* N0000674D; //0x0138 
	N0000D8E8* N000067B0; //0x0140 
	N0000D8EB* N000067B1; //0x0148 
	N0000D8EE* N000067B2; //0x0150 
	N0000D8F1* N000067B3; //0x0158 
	N0000D8F4* N000067B4; //0x0160 
	N0000D8F7* N000067B5; //0x0168 
	N000067E4* N000067B6; //0x0170 
	N000067D1* N000067B7; //0x0178 
	char pad_0x0180[0xC0]; //0x0180

}; //Size=0x0240

class N01D3AA5B
{
public:
	char pad_0x0000[0x28]; //0x0000
	N01DB97B1* N01D3AA61; //0x0028 
	char pad_0x0030[0x10]; //0x0030

}; //Size=0x0040

class N01DB97B1
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class CHlarge
{
public:
	char pad_0x0000[0x28]; //0x0000
	N01EE3B37* N01DF8EF4; //0x0028 
	char pad_0x0030[0x600]; //0x0030

}; //Size=0x0630

class N01EE3B37
{
public:
	N01EEB61F* N01EE3B38; //0x0000 
	char pad_0x0008[0x438]; //0x0008

}; //Size=0x0440

class N01EEB61F
{
public:
	char pad_0x0000[0x130]; //0x0000
	N01F0E5EA* N01F0A1F9; //0x0130 
	char pad_0x0138[0x58]; //0x0138
	N05A0278C* N059FADA8; //0x0190 
	char pad_0x0198[0x78]; //0x0198

}; //Size=0x0210

class N01F0E5EA
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class Railgun
{
public:
	char pad_0x0000[0x1040]; //0x0000

}; //Size=0x1040

class N059DFFE8
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N05A0278C
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class items
{
public:
	char pad_0x0000[0x28]; //0x0000
	N05A54F15* N05A419AD; //0x0028 
	char pad_0x0030[0x410]; //0x0030

}; //Size=0x0440

class N05A54F15
{
public:
	N05A697C5* N05A54F16; //0x0000 
	char pad_0x0008[0x38]; //0x0008
	N000033A7* N05A575D0; //0x0040 
	char pad_0x0048[0x1B8]; //0x0048

}; //Size=0x0200

class N05A697C5
{
public:
	char pad_0x0000[0x130]; //0x0000
	N05A71EDA* N05A6C6DB; //0x0130 
	char pad_0x0138[0xD08]; //0x0138

}; //Size=0x0E40

class N05A71EDA
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N00BDAEEE
{
public:
	char pad_0x0000[0x50]; //0x0000
	float N00BDDCA3; //0x0050 
	char pad_0x0054[0x7DC]; //0x0054

}; //Size=0x0830

class N00C17146
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N00C1A30E
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N00C20BE5
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N0120B50A
{
public:
	char pad_0x0000[0x68]; //0x0000

}; //Size=0x0068

class N01220BBB
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class OFFSET_ANGLES
{
public:
	char pad_0x0000[0x30]; //0x0000
	fb::WeaponEntityData* WeaponEntityData; //0x0030 
	char null[18360]; //0x0038 
	N0000F521* m_pWeaponZoomLevelData; //0x47F0 
	N0000F537* m_pWeaponZoomLevelData; //0x47F8 
	char pad_0x4800[0x110]; //0x4800
	N0000F545* m_pWeaponZoomLevelModifier; //0x4910 
	N0000F550* m_pWeaponZoomLevelModifier; //0x4918 
	char pad_0x4920[0x38]; //0x4920
	N00006FF0* m_pZoomLevelData; //0x4958 
	ZoomLevelData* m_pZoomLevelData; //0x4960 
	char pad_0x4968[0x20]; //0x4968
	ClientSoldierAimingSimulation* pAUTHORATIVEAIMING ; //0x4988 
	char pad_0x4990[0x18]; //0x4990
	ClientWeapon* m_pWeapon; //0x49A8 
	char pad_0x49B0[0x10]; //0x49B0
	WeaponFiring* m_pPrimary; //0x49C0 
	char pad_0x49C8[0x138]; //0x49C8

}; //Size=0x4B00

class WeaponFiring
{
public:
	char pad_0x0000[0x78]; //0x0000
	WeaponSwayData* WeaponSway; //0x0078 
	char pad_0x0080[0x80]; //0x0080
	__int32 N00001E4E; //0x0100 
	char pad_0x0104[0x24]; //0x0104
	PrimaryFire* PrimaryFire; //0x0128 
	char pad_0x0130[0x18]; //0x0130
	DWORD m_weaponState; //0x0148 
	DWORD N000058D8; //0x014C 
	DWORD N00002EB9; //0x0150 
	char * N000058DB; //0x0154 
	float m_timeToWait; //0x015C 
	char pad_0x0160[0x28]; //0x0160
	__int32 N000058BB; //0x0188 
	char pad_0x018C[0x14]; //0x018C
	__int32 m_projectilesLoaded; //0x01A0 
	__int32 m_projectilesInMagazines; //0x01A4 
	DWORD m_numberOfProjectilesToFire; //0x01A8 
	unsigned char m_hasStoppedFiring; //0x01AC 
	unsigned char m_primaryFireTriggeredLastFrame; //0x01AD 
	unsigned char m_isOverheated; //0x01AE 
	char pad_0x01AF[0x11]; //0x01AF

}; //Size=0x01C0

class PrimaryFire
{
public:
	char pad_0x0000[0x10]; //0x0000
	FiringFunctionData* FiringFunctionData; //0x0010 
	char pad_0x0018[0x40]; //0x0018

}; //Size=0x0058

class N000027B7
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00002C1B
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00002C37
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00002C51
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class PhysicsEntityBase
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class ClientReplication
{
public:
	char pad_0x0000[0x30]; //0x0000
	float PositionX; //0x0030 
	float PositionY; //0x0034 
	float PositionZ; //0x0038 
	char pad_0x003C[0x54]; //0x003C

}; //Size=0x0090

class N00002C66
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class SpottingComponent
{
public:
	char pad_0x0000[0x50]; //0x0000
	unsigned char spottype; //0x0050 
	char pad_0x0051[0x97]; //0x0051

}; //Size=0x00E8

class SoldierSuppressionComponent
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00002CA3
{
public:
	char pad_0x0000[0xA8]; //0x0000

}; //Size=0x00A8

class N00002CD5
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00002CEB
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00002D09
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00002D2F
{
public:
	char pad_0x0000[0x10]; //0x0000
	char * N00002D32; //0x0010 
	char pad_0x0018[0x20]; //0x0018
	char N00002D37[12]; //0x0038 
	char pad_0x0044[0x4]; //0x0044

}; //Size=0x0048

class N00002E04
{
public:
	char pad_0x0000[0x10]; //0x0000
	N00002E10* N00002E08; //0x0010 
	char pad_0x0018[0x30]; //0x0018

}; //Size=0x0048

class N00002E10
{
public:
	char pad_0x0000[0x18]; //0x0000
	N00002E66* N00002E14; //0x0018 
	float N00002E15; //0x0020 
	char pad_0x0024[0x13C]; //0x0024
	float N00002E3D; //0x0160 
	char pad_0x0164[0x9C]; //0x0164
	float N00002E51; //0x0200 
	char pad_0x0204[0x24]; //0x0204
	float N00002E56; //0x0228 
	char pad_0x022C[0x24]; //0x022C
	float N00002E5B; //0x0250 
	float N00002E63; //0x0254 
	char pad_0x0258[0x70]; //0x0258
	N00002EA6* N00002E90; //0x02C8 
	char pad_0x02D0[0x40]; //0x02D0
	float N00002E91; //0x0310 
	char pad_0x0314[0x1C]; //0x0314
	float N00002E95; //0x0330 
	char pad_0x0334[0x24]; //0x0334
	float N00002EBD; //0x0358 
	char pad_0x035C[0x6C]; //0x035C

}; //Size=0x03C8

class N00002E66
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00002E9B
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00002EA6
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00002EDE
{
public:
	char pad_0x0000[0x10]; //0x0000
	N00002EE9* N00002EE1; //0x0010 
	char pad_0x0018[0x30]; //0x0018

}; //Size=0x0048

class N00002EE9
{
public:
	char pad_0x0000[0x70]; //0x0000
	float N00002EF8; //0x0070 
	float N00002EFC; //0x0074 
	char pad_0x0078[0x10]; //0x0078

}; //Size=0x0088

class N00002E65
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00002E7B
{
public:
	char pad_0x0000[0x1C0]; //0x0000

}; //Size=0x01C0

class N00002EC8
{
public:
	char pad_0x0000[0x8]; //0x0000
	N00002ED3* N00002ECA; //0x0008 
	char pad_0x0010[0x38]; //0x0010

}; //Size=0x0048

class N00002ED3
{
public:
	char pad_0x0000[0x440]; //0x0000
	float N00002F78; //0x0440 
	float N00002F9A; //0x0444 
	char pad_0x0448[0x100]; //0x0448

}; //Size=0x0548

class ClientVaultComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	VaultComponentData* VaultComponentData; //0x0010 
	char pad_0x0018[0x8]; //0x0018
	ClientPlayerEntryComponent* ClientPlayerEntryComponent; //0x0020 
	char pad_0x0028[0xC8]; //0x0028
	unsigned char m_VaultState; //0x00F0 0 = Idle, 1 = adjust ragdoll movement, 2 = vault
	char pad_0x00F1[0x3]; //0x00F1
	unsigned char N000068D1; //0x00F4 
	char pad_0x00F5[0x1B]; //0x00F5
	Physics* m_Physics; //0x0110 
	char pad_0x0118[0x30]; //0x0118
	float N0000315A; //0x0148  AimingContraints
	float N00006900; //0x014C 
	float N0000315B; //0x0150 
	float N00006903; //0x0154 
	char pad_0x0158[0x28]; //0x0158
	Vector4 OldPosition; //0x0180 
	float height_vaulted; //0x0190 
	char pad_0x0194[0xC]; //0x0194
	Vector4 NewPosition; //0x01A0 
	char pad_0x01B0[0xA0]; //0x01B0
	Vector4 m_TeleportVector; //0x0250 
	char pad_0x0260[0x10]; //0x0260

}; //Size=0x0270

class CameraRecoilData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_SpringConstant; //0x0010 
	float m_SpringDamping; //0x0014 
	float m_SpringMinThresholdAngle; //0x0018 
	char pad_0x001C[0x2C]; //0x001C

}; //Size=0x0048

class N00002FF7
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00003002
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class ClientSoldierAimingSimulation
{
public:
	SoldierAimingSimulationData* m_data; //0x0000 
	SoldierAimingEnvironment* m_environment; //0x0008 
	fpsAimer* m_fpsAimer; //0x0010 
	float m_yaw; //0x0018 
	float m_pitch; //0x001C 
	float m_aimYawTimer; //0x0020 
	float m_aimPitchTimer; //0x0024 
	Vector2 m_sway; //0x0028 
	float N0000D448; //0x0030 
	char --------------------[8]; //0x0034 
	Vector2 N0000D44B; //0x003C 
	char pad_0x0044[0x24]; //0x0044
	float m_zoomLevel; //0x0068 
	char pad_0x006C[0x4]; //0x006C
	matrix3x4_t m_Transform; //0x0070 
	Vector4 m_Position; //0x00B0 
	Vector4 m_View; //0x00C0 
	Vector4 m_Velocity; //0x00D0 
	char ------------------[88]; //0x00E0 
	char pad_0x0138[0x28]; //0x0138
	Vector4 m_RayEnd; //0x0160 
	__int32 m_RayMaximumLength; //0x0170 
	char pad_0x0174[0x54]; //0x0174

}; //Size=0x01C8

class fpsAimer
{
public:
	char pad_0x0000[0x14]; //0x0000
	float Yaw; //0x0014 
	float Pitch; //0x0018 
	char pad_0x001C[0x6C]; //0x001C

}; //Size=0x0088

class N00002FEB
{
public:
	char pad_0x0000[0x30]; //0x0000
	DWORD N00002FF2; //0x0030 
	DWORD N00002FFD; //0x0034 
	DWORD N00002FF3; //0x0038 
	DWORD N00003000; //0x003C 
	DWORD N00002FF4; //0x0040 
	DWORD N00003003; //0x0044 
	DWORD N00002FF5; //0x0048 
	DWORD N00003006; //0x004C 
	char pad_0x0050[0x30]; //0x0050

}; //Size=0x0080

class N00003015
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class ClientWeapon
{
public:
	char pad_0x0000[0x20]; //0x0000
	WeaponModifier* m_pModifier; //0x0020 
	char pad_0x0028[0x8]; //0x0028
	Vector3 m_moveSpeed; //0x0030 
	float  m_moveSpeedPad; //0x003C 
	Vector4 m_shootSpace; //0x0040 
	char pad_0x0050[0x20]; //0x0050
	Vector3 N000068AE; //0x0070 
	char pad_0x007C[0x4]; //0x007C
	matrix3x4_t m_shootSpaceIdentity; //0x0080 
	char pad_0x00C0[0x1E0]; //0x00C0
	float m_cameraFov; //0x02A0 
	float m_weaponFov; //0x02A4 
	float m_fovScaleFactor; //0x02A8 
	char pad_0x02AC[0x6A4]; //0x02AC
	ControllableFinder ControllableFinder; //0x0950 
	char pad_0x0A44[0x88]; //0x0A44

}; //Size=0x0ACC

class N0000304B
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00003030
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00003033
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00003036
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00003041
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00003044
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00003067
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class DynamicPhysicsEntity
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class VehicleEntityData
{
public:
	char pad_0x0000[0xB0]; //0x0000
	Vector3 m_CriticallyDamagedEffectPosition; //0x00B0 
	char pad_0x00BC[0x4]; //0x00BC
	Vector3 m_PreExplosionEffectPosition; //0x00C0 
	char pad_0x00CC[0x4]; //0x00CC
	N00005C0F VehicleHudData m_HudData; //0x00D0 
	char pad_0x0106[0xA]; //0x0106
	Vector3 m_FLIRKeyColor; //0x0110 
	char pad_0x011C[0x4]; //0x011C
	Vector3 m_InteractionOffset; //0x0120 
	char pad_0x012C[0x4]; //0x012C
	char * m_ControllableType; //0x0130 
	float m_DisabledDamageThreshold; //0x0138 
	float m_ClearDisabledDamageThreshold; //0x013C 
	float m_PreDestructionDamageThreshold; //0x0140 
	char pad_0x0144[0x4]; //0x0144
	VehicleHealthZoneData m_FrontHealthZone; //0x0148 
	char pad_0x0165[0x3]; //0x0165
	VehicleHealthZoneData m_RearHealthZone; //0x0168 
	char pad_0x0185[0x3]; //0x0185
	N000056DD m_LeftHealthZone; //0x0188 
	char pad_0x0190[0x18]; //0x0190
	N000056E0 m_RightHealthZone; //0x01A8 
	char pad_0x01B0[0x18]; //0x01B0
	N000056E3 m_TopHealthZone; //0x01C8 
	char pad_0x01D0[0x78]; //0x01D0
	char * m_NameSid; //0x0248 
	__int32 m_MaxPlayersInVehicle; //0x0250 
	float m_MinSpeedForMineActivation; //0x0254 
	float m_UpsideDownDamage; //0x0258 
	float N00006915; //0x025C 
	float N0000563A; //0x0260 
	float N00006917; //0x0264 
	float N0000563B; //0x0268 
	float N00006919; //0x026C 
	float N0000563C; //0x0270 
	float N0000691B; //0x0274 
	float N0000563D; //0x0278 
	float N0000691D; //0x027C 
	float N0000563E; //0x0280 
	float N0000691F; //0x0284 
	float m_ExitDirectionSpeedThreshold; //0x0288 
	float m_FLIRValue; //0x028C 
	char pad_0x0290[0x38]; //0x0290
	__int64 N00005647; //0x02C8 
	__int64 N00005648; //0x02D0 
	float m_NametagHeightScale; //0x02D8 
	float m_SpottingFovScale; //0x02DC 
	unsigned char m_AllowVehicleOutsideCombatAreas; //0x02E0 
	unsigned char N00005C49; //0x02E1 
	unsigned char N0000692C; //0x02E2 
	unsigned char N00006941; //0x02E3 
	unsigned char m_ShowPlayerHealth; //0x02E4 
	unsigned char N00005C4A; //0x02E5 
	unsigned char N0000692F; //0x02E6 
	unsigned char N00005C4B; //0x02E7 
	unsigned char N0000564B; //0x02E8 
	unsigned char N00005C30; //0x02E9 
	unsigned char N00005C34; //0x02EA 
	unsigned char N00005C37; //0x02EB 
	unsigned char N00005C35; //0x02EC 
	unsigned char N00005C31; //0x02ED 
	unsigned char N00005C3A; //0x02EE 
	unsigned char N00005C32; //0x02EF 
	unsigned char N0000564C; //0x02F0 
	unsigned char N00005C3D; //0x02F1 
	unsigned char N00005C43; //0x02F2 
	unsigned char N0000693C; //0x02F3 
	unsigned char N00005C44; //0x02F4 
	unsigned char N00005C3E; //0x02F5 
	unsigned char N00005C41; //0x02F6 
	unsigned char m_VehicleLightingEnable; //0x02F7 
	char pad_0x02F8[0x234]; //0x02F8

}; //Size=0x052C

class DynamicPhysicsEntity
{
public:
	char pad_0x0000[0xA0]; //0x0000
	PhysicsEntityTransform* m_EntityTransform; //0x00A0 
	char pad_0x00A8[0x20]; //0x00A8

}; //Size=0x00C8

class N000030E9
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00003106
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000311A
{
public:
	char pad_0x0000[0x70]; //0x0000
	float N00003129; //0x0070 
	float N0000312D; //0x0074 
	char pad_0x0078[0x10]; //0x0078

}; //Size=0x0088

class VaultComponentData
{
public:
	char pad_0x0000[0x48]; //0x0000
	float N0000313A; //0x0048 
	char pad_0x004C[0x24]; //0x004C
	float m_StartHeightMax; //0x0070 
	float m_StartHeightMin; //0x0074 
	__int64 N00003143; //0x0078 
	char pad_0x0080[0xC]; //0x0080
	float N00003133; //0x008C 
	float N00003151; //0x0090 
	char pad_0x0094[0x30]; //0x0094
	__int32 N0000313A; //0x00C4 
	char pad_0x00C8[0x7C]; //0x00C8

}; //Size=0x0144

class ClientPlayerEntryComponent
{
public:
	char pad_0x0000[0x10]; //0x0000
	PlayerEntryComponentData* PlayerEntryComponentData; //0x0010 
	char pad_0x0018[0x30]; //0x0018

}; //Size=0x0048

class ClientVehicleHealthComponent
{
public:
	char pad_0x0000[0x38]; //0x0000
	float m_vehicleHealth; //0x0038 
	char pad_0x003C[0xC]; //0x003C

}; //Size=0x0048

class N000031F5
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000031FA
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class m_PlayerView
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000321F
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000323A
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000328A
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000328D
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00003290
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000032A7
{
public:
	DWORD N000032A8; //0x0000 
	char pad_0x0004[0x4C]; //0x0004

}; //Size=0x0050

class fb::WeaponEntityData
{
public:
	char pad_0x0000[0x80]; //0x0000
	__int32 m_WeaponClass; //0x0080 
	char pad_0x0084[0x4]; //0x0084
	__int64 m_WeaponStates; //0x0088 
	WeaponFiringData* m_WeaponFiring; //0x0090 
	char pad_0x0098[0x8]; //0x0098
	GameAIWeaponData* m_AIData; //0x00A0 
	char pad_0x00A8[0x1E0]; //0x00A8

}; //Size=0x0288

class N000032D0
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N000032DC
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class RumbleFiringData
{
public:
	float m_LowRumble; //0x0000 
	float m_HighRumble; //0x0004 
	float m_RumbleDuration; //0x0008 
	char pad_0x000C[0x3C]; //0x000C

}; //Size=0x0048

class PlayerEntryComponentData
{
public:
	char pad_0x0000[0xF0]; //0x0000
	Vector3 N000032A2; //0x00F0 
	char pad_0x00FC[0x4]; //0x00FC
	__int64 N000032A4; //0x0100 

}; //Size=0x0108

class N000033A7
{
public:
	N0000485E* N0000481E; //0x0000 
	N000033BA* N000033A9; //0x0008 
	N00004820* N000033AA; //0x0010 
	char pad_0x0018[0xF0]; //0x0018

}; //Size=0x0108

class N000033BA
{
public:
	char pad_0x0000[0x18]; //0x0000
	TeamData* TeamData; //0x0018 
	char pad_0x0020[0x258]; //0x0020

}; //Size=0x0278

class TeamData
{
public:
	char pad_0x0000[0x18]; //0x0000
	Soldier* MpSoldier; //0x0018 
	char pad_0x0020[0x30]; //0x0020
	USAssault* USAssault; //0x0050 
	USEngineer* USEngineer; //0x0058 
	USSupport* USSupport; //0x0060 
	USRecon* USRecon; //0x0068 
	char pad_0x0070[0x8]; //0x0070
	MBTCustomization* MBTcustom; //0x0078 
	IFVCustomization* N00003448; //0x0080 
	AAVCustomization* N00003449; //0x0088 
	FACCustomization* N0000344A; //0x0090 
	JETCustomization* N0000344B; //0x0098 
	ScoutCustom* N0000344C; //0x00A0 
	ATKheliCustom* N0000344D; //0x00A8 
	JETcustom* N0000344E; //0x00B0 
	JEEPCustomization* N0000344F; //0x00B8 
	char pad_0x00C0[0x1160]; //0x00C0
	N00003CC1* N0000367C; //0x1220 
	char pad_0x1228[0x6318]; //0x1228

}; //Size=0x7540

class USSupport
{
public:
	char pad_0x0000[0x1B8]; //0x0000
	N0000342B* N00003418; //0x01B8 
	char pad_0x01C0[0x88]; //0x01C0

}; //Size=0x0248

class N0000342B
{
public:
	N00003436* N0000342C; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N00003436
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000037C1
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N000037DC
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class USAssault
{
public:
	char pad_0x0000[0xF8]; //0x0000
	N0000D827* N00003820; //0x00F8 
	char pad_0x0100[0x30]; //0x0100
	N00003832* N00003826; //0x0130 
	char pad_0x0138[0x68]; //0x0138
	N00005152* N000038FB; //0x01A0 
	char pad_0x01A8[0x160]; //0x01A8
	N0000D38B* N00003927; //0x0308 
	char pad_0x0310[0xE18]; //0x0310
	N00003B00* N00003AEB; //0x1128 
	char pad_0x1130[0xC98]; //0x1130

}; //Size=0x1DC8

class N00003832
{
public:
	char pad_0x0000[0x18]; //0x0000

}; //Size=0x0018

class N00003835
{
public:
	char pad_0x0000[0xB30]; //0x0000

}; //Size=0x0B30

class N00003B00
{
public:
	N00003B13* N00003B01; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N00003B13
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00003CA6
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00003CC1
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N000047FC
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N00004820
{
public:
	char pad_0x0000[0x18]; //0x0000
	CH LARGE* N00004824; //0x0018 
	char pad_0x0020[0xE8]; //0x0020

}; //Size=0x0108

class CH LARGE
{
public:
	char pad_0x0000[0x50]; //0x0000
	N0000490C* N0000484E; //0x0050 
	N0000555C* N0000484F; //0x0058 
	char pad_0x0060[0x468]; //0x0060

}; //Size=0x04C8

class N0000485E
{
public:
	char pad_0x0000[0x18]; //0x0000
	N00004871* N00004862; //0x0018 
	char pad_0x0020[0x68]; //0x0020

}; //Size=0x0088

class N00004871
{
public:
	char pad_0x0000[0x14C8]; //0x0000

}; //Size=0x14C8

class N0000490C
{
public:
	char pad_0x0000[0x190]; //0x0000
	N0000503E* N00004940; //0x0190 
	char pad_0x0198[0xE8]; //0x0198
	N0000498F* N0000495E; //0x0280 
	char pad_0x0288[0x3578]; //0x0288

}; //Size=0x3800

class N0000498F
{
public:
	N00004992* N00004990; //0x0000 

}; //Size=0x0008

class N00004992
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000501D
{
public:
	N0000502B* N0000501E; //0x0000 
	char pad_0x0008[0x38]; //0x0008

}; //Size=0x0040

class N00005028
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000502B
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000503E
{
public:
	N00005051* N0000503F; //0x0000 
	N00005087* N00005040; //0x0008 
	N0000506C* N00005041; //0x0010 
	N000054FD* N00005042; //0x0018 
	N00005508* N00005043; //0x0020 
	char pad_0x0028[0x148]; //0x0028

}; //Size=0x0170

class N00005051
{
public:
	char pad_0x0000[0x188]; //0x0000

}; //Size=0x0188

class N0000506C
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00005087
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000509A
{
public:
	char pad_0x0000[0x80]; //0x0000

}; //Size=0x0080

class N000050AD
{
public:
	N000050C0* N000050AE; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N000050C0
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000050E1
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000050E6
{
public:
	N000050E9* N000050E7; //0x0000 
	char pad_0x0008[0x100]; //0x0008

}; //Size=0x0108

class N000050E9
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005124
{
public:
	N0000513F* N00005125; //0x0000 
	char pad_0x0008[0xC0]; //0x0008

}; //Size=0x00C8

class N0000513F
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005152
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005165
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000054FD
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005508
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000551B
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000552E
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005551
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000555C
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class GameAIWeaponData
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000556C
{
public:
	char pad_0x0000[0x148]; //0x0000

}; //Size=0x0148

class N000055E5
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class PhysicsEntityTransform
{
public:
	matrix3x4_t m_Transform; //0x0000 
	char pad_0x0040[0x8]; //0x0040

}; //Size=0x0048

class VehicleHealthZoneData
{
public:
	float m_MaxHealth; //0x0000 
	float m_MaxShieldHealth; //0x0004 
	float m_MinDamageAngle; //0x0008 
	float m_DamageAngleMultiplier; //0x000C 
	__int64 m_DamageAngleMultiplierCurve; //0x0010 
	float m_VerticalFactor; //0x0018 
	unsigned char m_UseDamageAngleCalculation; //0x001C 

}; //Size=0x001D

class N000056CD
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000056DA
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000056DD
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000056E0
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000056E3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OFFSET_CURRENT_WEAPONFIRING
{
public:
	char pad_0x0000[0xC0]; //0x0000

}; //Size=0x00C0

class VeniceSoldierCustimizationAsset
{
public:
	char pad_0x0000[0x3B8]; //0x0000

}; //Size=0x03B8

class N0000578C
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000579F
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000574F
{
public:
	char pad_0x0000[0x188]; //0x0000

}; //Size=0x0188

class N0000579C
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000057A1
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000057B6
{
public:
	N000057C1* N000057B7; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N000057C1
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000058E2
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N000058EF
{
public:
	N000058F2* N000058F0; //0x0000 

}; //Size=0x0008

class N000058F2
{
public:
	char pad_0x0000[0x70]; //0x0000
	Vector3 N00005901; //0x0070 
	char pad_0x007C[0xC]; //0x007C

}; //Size=0x0088

class N00005908
{
public:
	char pad_0x0000[0x408]; //0x0000

}; //Size=0x0408

class N0000598C
{
public:
	char pad_0x0000[0x408]; //0x0000

}; //Size=0x0408

class test56565
{
public:
	char pad_0x0000[0x128]; //0x0000
	N00005AA7* N00005A39; //0x0128 
	char pad_0x0130[0x70]; //0x0130
	__int32 N00005A48; //0x01A0 
	char pad_0x01A4[0x2DC]; //0x01A4

}; //Size=0x0480

class N00005AA7
{
public:
	char pad_0x0000[0x10]; //0x0000
	FiringFunctionData* N00005AAA; //0x0010 
	char pad_0x0018[0x70]; //0x0018

}; //Size=0x0088

class N00005ABA
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005A75
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00005A8F
{
public:
	char pad_0x0000[0x88]; //0x0000
	N00005AA9* N00005AA1; //0x0088 
	char pad_0x0090[0x30]; //0x0090

}; //Size=0x00C0

class N00005AA9
{
public:
	char pad_0x0000[0x68]; //0x0000
	N00005ACC* N00005AB7; //0x0068 
	char pad_0x0070[0x138]; //0x0070
	N00005AEF* N00005AEA; //0x01A8 
	char pad_0x01B0[0x18]; //0x01B0

}; //Size=0x01C8

class N00005ACC
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005AEF
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class MBTCustomization
{
public:
	char pad_0x0000[0x68]; //0x0000
	N0000D7FD* N00005B08; //0x0068 
	char pad_0x0070[0x58]; //0x0070
	N0000D7F8* N00005B14; //0x00C8 
	char pad_0x00D0[0x30]; //0x00D0
	N00005B5B* N00005B1B; //0x0100 
	char pad_0x0108[0x68]; //0x0108
	N00005B58* N00005B29; //0x0170 
	char pad_0x0178[0x30]; //0x0178
	N00005B4D* N00005B30; //0x01A8 
	char pad_0x01B0[0x30]; //0x01B0
	N0000D388* N00005B37; //0x01E0 
	char pad_0x01E8[0xA0]; //0x01E8

}; //Size=0x0288

class N00005B4D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005B58
{
public:
	__int64 N00005B59; //0x0000 

}; //Size=0x0008

class N00005B5B
{
public:
	__int64 N00005B5C; //0x0000 

}; //Size=0x0008

class JETcustom
{
public:
	char pad_0x0000[0x138]; //0x0000
	N00005BBF* N00005BAC; //0x0138 
	char pad_0x0140[0x88]; //0x0140

}; //Size=0x01C8

class ATKheliCustom
{
public:
	char pad_0x0000[0x68]; //0x0000
	N00005B84* N00005B77; //0x0068 
	char pad_0x0070[0x180]; //0x0070
	N00005FF9* N00005FF5; //0x01F0 
	char pad_0x01F8[0x10]; //0x01F8

}; //Size=0x0208

class N00005B84
{
public:
	__int64 N00005B85; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N00005BBF
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class ScoutCustom
{
public:
	char pad_0x0000[0x68]; //0x0000
	N00005BE5* N00005BD0; //0x0068 
	char pad_0x0070[0x30]; //0x0070
	N0000D808* N00005BD7; //0x00A0 
	char pad_0x00A8[0x58]; //0x00A8
	N0000D821* N00005BE3; //0x0100 
	char pad_0x0108[0x68]; //0x0108
	N0000D81D* N0000D819; //0x0170 
	char pad_0x0178[0x10]; //0x0178

}; //Size=0x0188

class N00005BE5
{
public:
	__int64 N00005BE6; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N00005BF0
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class VehicleHudData
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005C0F
{
public:
	Vector3 m_CustomizationOffset; //0x0000 
	VehicleCustomizationAsset* VehicleCustomizationAsset m_Customization; //0x000C 
	char pad_0x0014[0xC]; //0x0014
	char * N00005C16; //0x0020 
	char pad_0x0028[0x8]; //0x0028
	__int32 m_VehicleItemHash; //0x0030 
	unsigned char m_RotateInMap; //0x0034 
	unsigned char m_ShowHealth; //0x0035 

}; //Size=0x0036

class VehicleCustomizationAsset
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class SoldierSprintSettingsData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_Fov; //0x0010 
	float m_FovInDelay; //0x0014 
	float m_FovInTime; //0x0018 
	float m_FovOutDelay; //0x001C 
	float m_FovOutTime; //0x0020 
	float m_RecoverTime; //0x0024 
	float m_SprintToProneRecoverTime; //0x0028 
	char pad_0x002C[0x1C]; //0x002C

}; //Size=0x0048

class CharacterPhysicsData
{
public:
	char pad_0x0000[0x30]; //0x0000
	CharacterSprintData* m_Sprint; //0x0030 
	__int32 N00005C64; //0x0038 
	__int32 m_PushableObjectWeight; //0x003C 
	float m_Mass; //0x0040 
	float m_MaxAscendAngle; //0x0044 
	float m_PhysicalRadius; //0x0048 
	float m_EnterSwimStateDepth; //0x004C 
	float m_ExitSwimStateDepth; //0x0050 
	float m_InputAcceleration; //0x0054 
	float m_LadderAcceptAngle; //0x0058 
	float m_LadderAcceptAnglePitch; //0x005C 
	float m_JumpPenaltyTime; //0x0060 
	float m_JumpPenaltyFactor; //0x0064 
	float m_RadiusToPredictCollisionOnCharacters; //0x0068 
	unsigned char m_AllowPoseChangeDuringTransition; //0x006C 
	unsigned char m_AutoPushAwayFromWallsInProne; //0x006D 
	char pad_0x006E[0x1A]; //0x006E

}; //Size=0x0088

class N00005C78
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005C83
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005C8E
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class Soldier
{
public:
	char pad_0x0000[0x110]; //0x0000
	float N00005D54; //0x0110 
	unsigned char N00005D5C; //0x0114 
	unsigned char N00005D5E; //0x0115 
	char pad_0x0116[0xB2]; //0x0116

}; //Size=0x01C8

class N00005C7C
{
public:
	char pad_0x0000[0x508]; //0x0000

}; //Size=0x0508

class N00005D20
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N00005D73
{
public:
	N00005D86* N00005D74; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N00005D86
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class CharacterSprintData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_SprintPowerDecreasePerSecond; //0x0010 
	float m_SprintPowerIncreasePerSecond; //0x0014 
	float m_SprintMinimumPower; //0x0018 
	unsigned char m_AllowContinousSprinting; //0x001C 
	char pad_0x001D[0x2B]; //0x001D

}; //Size=0x0048

class CollisionData
{
public:
	char pad_0x0000[0x10]; //0x0000
	m_DamageAtVerticalVelocity* m_DamageAtVerticalVelocity; //0x0010 
	__int64 m_DamageAtHorizVelocity; //0x0018 
	char pad_0x0020[0x30]; //0x0020

}; //Size=0x0050

class m_DamageAtVerticalVelocity
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class SoldierHeadCollisionData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_HeadRadius; //0x0010 
	char pad_0x0014[0x4]; //0x0014
	__int32 N00005DE8; //0x0018 
	char pad_0x001C[0x2C]; //0x001C

}; //Size=0x0048

class N00005DF7
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005E02
{
public:
	char pad_0x0000[0x90]; //0x0000
	Vector3 N00005E15; //0x0090 
	char pad_0x009C[0x4]; //0x009C
	Vector3 N00005E17; //0x00A0 
	char pad_0x00AC[0x1C]; //0x00AC

}; //Size=0x00C8

class N00005E22
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00005E2D
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00005E5A
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00005E76
{
public:
	char pad_0x0000[0x90]; //0x0000
	Vector4 N00005E89; //0x0090 
	char pad_0x00A0[0x28]; //0x00A0

}; //Size=0x00C8

class N00005E93
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005EA8
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00005EC4
{
public:
	N00005ED7* N00005EC5; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N00005ED7
{
public:
	char pad_0x0000[0x70]; //0x0000
	N00005EF2* N00005EE6; //0x0070 
	char pad_0x0078[0x50]; //0x0078

}; //Size=0x00C8

class N00005EF2
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00005F05
{
public:
	char pad_0x0000[0x90]; //0x0000
	Vector4 N00005F18; //0x0090 
	Vector4 N00005F1A; //0x00A0 
	char pad_0x00B0[0x18]; //0x00B0

}; //Size=0x00C8

class N00005F59
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class OFFSET_EMITTERSYSTEMSETTINGS
{
public:
	char pad_0x0000[0x18]; //0x0000
	float N00005F76; //0x0018 
	float N00005F90; //0x001C 
	__int32 N00005F77; //0x0020 
	char pad_0x0024[0x4]; //0x0024
	__int32 N00005F78; //0x0028 
	char pad_0x002C[0x1C]; //0x002C
	float N00005F7C; //0x0048 
	DWORD N00005F92; //0x004C 
	char pad_0x0050[0x28]; //0x0050
	DWORD N00005F82; //0x0078 
	unsigned char m_Enable; //0x007C 
	unsigned char m_UpdateJobEnable; //0x007D 
	unsigned char N00005F9A; //0x007E 
	unsigned char N00005F98; //0x007F 
	unsigned char N00005F83; //0x0080 
	unsigned char N00005FA0; //0x0081 
	char pad_0x0082[0x3]; //0x0082
	unsigned char N00005FA1; //0x0085 
	char pad_0x0086[0x1A]; //0x0086
	unsigned char N00005F87; //0x00A0 
	unsigned char N00005FA7; //0x00A1 
	char pad_0x00A2[0x3E]; //0x00A2

}; //Size=0x00E0

class OFFSET_INPUTCONFIGASSET
{
public:
	char pad_0x0000[0x18]; //0x0000
	__int64 m_DefaultInputConceptDefinition; //0x0018 
	__int64 N00005FB7; //0x0020 
	__int64 N00005FB8; //0x0028 
	__int64 N00005FB9; //0x0030 
	__int32 N00005FBA; //0x0038 
	__int32 N00005FF2; //0x003C 
	char pad_0x0040[0x8]; //0x0040
	__int32 N00005FBC; //0x0048 
	float N00005FF7; //0x004C 
	float N00005FBD; //0x0050 
	float N00005FFA; //0x0054 
	float N00005FBE; //0x0058 
	char pad_0x005C[0x4]; //0x005C
	__int64 N00005FBF; //0x0060 
	unsigned char m_ProneToStandOnJump; //0x0068 
	unsigned char m_StandAutomaticallyIfSprinting; //0x0069 
	unsigned char m_DisableCrouch; //0x006A 
	unsigned char m_DisableProne; //0x006B 
	unsigned char N00005FD1; //0x006C 
	unsigned char N00005FCD; //0x006D 
	unsigned char N00005FDE; //0x006E 
	unsigned char N00005FCE; //0x006F 
	unsigned char N00005FC1; //0x0070 
	unsigned char N00005FD5; //0x0071 
	unsigned char N00005FE2; //0x0072 
	unsigned char N00005FE7; //0x0073 
	unsigned char N00005FE3; //0x0074 
	unsigned char N00005FD6; //0x0075 
	unsigned char m_InputCurvesEnabled; //0x0076 
	char pad_0x0077[0x49]; //0x0077

}; //Size=0x00C0

class N00006020
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006025
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006028
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000602B
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class Client
{
public:
	char pad_0x0000[0x28]; //0x0000
	ClientGameContext* m_pGameContext; //0x0028 
	char pad_0x0030[0x10]; //0x0030
	ClientPlayerManager* m_playerManager; //0x0040 
	ClientDestructionManager* m_destructionManager; //0x0048 
	ClientGameView* m_gameView; //0x0050 
	char pad_0x0058[0x8]; //0x0058
	GameTime* m_gameTime; //0x0060 
	BorderInputNode* m_inputNode; //0x0068 
	char pad_0x0070[0x18]; //0x0070

}; //Size=0x0088

class N000060DF
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000060E2
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OFFSET_WEAPONDATA
{
public:
	char pad_0x0000[0x20]; //0x0000
	N0000607E* N00005FBC; //0x0020 
	char pad_0x0028[0x558]; //0x0028

}; //Size=0x0580

class N00005FF9
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00005FFC
{
public:
	char pad_0x0000[0x28]; //0x0000
	N00006017* N00006002; //0x0028 
	char pad_0x0030[0x158]; //0x0030

}; //Size=0x0188

class N00006017
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00006032
{
public:
	char pad_0x0000[0x148]; //0x0000

}; //Size=0x0148

class N0000607E
{
public:
	char pad_0x0000[0x10]; //0x0000
	N000060A9* N00006081; //0x0010 
	char pad_0x0018[0x130]; //0x0018

}; //Size=0x0148

class N000060A9
{
public:
	N00006164* N000060AA; //0x0000 
	char pad_0x0008[0x140]; //0x0008

}; //Size=0x0148

class N00006164
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class OFFSET_PPCURENTWEAPONFIRING
{
public:
	char N00006187[250]; //0x0000 
	char pad_0x00FA[0x3E]; //0x00FA
	WeaponComponentData* pWeaponComponentData; //0x0138 
	N00006253* N000061E6; //0x0140 
	char pad_0x0148[0x38]; //0x0148

}; //Size=0x0180

class N000061A8
{
public:
	N000061C3* N000061A9; //0x0000 
	char pad_0x0008[0xC0]; //0x0008

}; //Size=0x00C8

class N000061C3
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class WeaponComponentData
{
public:
	char N000061F0[100]; //0x0000 
	char pad_0x0064[0xC]; //0x0064
	Vector3 N000061FE; //0x0070 
	char pad_0x007C[0x4]; //0x007C
	Vector3 N00006200; //0x0080 
	char pad_0x008C[0x4]; //0x008C
	WeaponFiringData* Soldier pWeaponFiringData; //0x0090 
	WeaponFiringData* Vehicle pWeaponFiringData; //0x0098 
	char * m_DamageGiverName; //0x00A0 
	__int64 m_AIData; //0x00A8 
	__int64 m_CustomWeaponType; //0x00B0 
	float m_ImpulseStrength; //0x00B8 
	DWORD m_Classification; //0x00BC 
	float m_ReloadTimeMultiplier; //0x00C0 
	float m_DamageMultiplier; //0x00C4 
	float m_ExplosionDamageMultiplier; //0x00C8 
	float m_OverheatDropPerSecondMultiplier; //0x00CC 
	float m_LockTimeMultiplier; //0x00D0 
	float m_LockingAcceptanceAngleMultiplier; //0x00D4 
	DWORD m_WeaponItemHash; //0x00D8 
	unsigned char m_SequentialFiring; //0x00DC 
	char pad_0x00DD[0x3]; //0x00DD
	char N0000620C[350]; //0x00E0 
	char pad_0x023E[0x32]; //0x023E
	N000062A5* N000062A1; //0x0270 
	char pad_0x0278[0x10]; //0x0278

}; //Size=0x0288

class N0000622A
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006253
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006266
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N00006281
{
public:
	char pad_0x0000[0x408]; //0x0000

}; //Size=0x0408

class N00006305
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006311
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006325
{
public:
	WeaponFiringData* N00006326; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N00006338
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N000062A5
{
public:
	char pad_0x0000[0x350]; //0x0000
	N00006340* Xd1; //0x0350 
	char pad_0x0358[0x658]; //0x0358
	N0000646B* RAWR; //0x09B0 
	char pad_0x09B8[0x10]; //0x09B8

}; //Size=0x09C8

class N00006340
{
public:
	char pad_0x0000[0x218]; //0x0000
	WeaponFiringData* N00006384; //0x0218 
	char pad_0x0220[0x1E8]; //0x0220

}; //Size=0x0408

class N000063C3
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000646B
{
public:
	char pad_0x0000[0xB20]; //0x0000
	VehicleConfigData VehicleConfigData; //0x0B20 
	char pad_0x0CE0[0x158]; //0x0CE0
	float N000065FC; //0x0E38 
	char pad_0x0E3C[0x32C]; //0x0E3C
	WeaponFiringData* N00006699; //0x1168 
	char pad_0x1170[0x58]; //0x1170

}; //Size=0x11C8

class N0000669E
{
public:
	char pad_0x0000[0x10]; //0x0000
	N000066A3* N000066A1; //0x0010 

}; //Size=0x0018

class N000066A3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000066A3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000066A6
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class PlayerData
{
public:
	char pad_0x0000[0x18]; //0x0000
	PlayerViewData* m_PlayerView; //0x0018 
	EntryInputActionMapsData* m_InputConceptDefinition; //0x0020 
	InputActionMappingsData* m_InputMapping; //0x0028 
	char pad_0x0030[0x28]; //0x0030

}; //Size=0x0058

class N000066B5
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class InputActionMappingsData
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_Mappings; //0x0010 
	char pad_0x0018[0x70]; //0x0018

}; //Size=0x0088

class PlayerViewData
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 m_SubViews; //0x0010 
	char pad_0x0018[0x70]; //0x0018

}; //Size=0x0088

class EntryInputActionMapsData
{
public:
	char pad_0x0000[0x18]; //0x0000
	__int32 m_ActionMapSettingsScheme; //0x0018 
	__int32 m_DefaultInputActionMap; //0x001C 
	__int64 m_InputActionMaps; //0x0020 
	char pad_0x0028[0x20]; //0x0028

}; //Size=0x0048

class N00006705
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class Level
{
public:
	char pad_0x0000[0x38]; //0x0000
	LevelData* LevelData; //0x0038 
	char pad_0x0040[0xB8]; //0x0040
	N00006A67* N00006A5C; //0x00F8 
	char pad_0x0100[0x20]; //0x0100
	HavokPhysicsManager* m_pHavokPhysics; //0x0120 
	char pad_0x0128[0x8]; //0x0128
	N00006AAE* N00006A63; //0x0130 
	char pad_0x0138[0x10]; //0x0138

}; //Size=0x0148

class m_Owner
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class SpottingTargetComponent
{
public:
	char pad_0x0000[0x58]; //0x0000

}; //Size=0x0058

class ParachuteComponent
{
public:
	char pad_0x0000[0x8]; //0x0000
	N000068A7* N0000677A; //0x0008 
	SoldierParachuteComponentData* ParachuteComponentData; //0x0010 
	char pad_0x0018[0x88]; //0x0018
	float disableTimer; //0x00A0 ParachuteState
	float steerLeftRight; //0x00A4 
	float accelerateBrake; //0x00A8 
	float pitch; //0x00AC 
	float roll; //0x00B0 
	unsigned char enabled; //0x00B4 
	unsigned char skyDive; //0x00B5 
	char pad_0x00B6[0x22]; //0x00B6
	N0000687C* N0000D491; //0x00D8 
	AimingContraints* m_pAimingContraints; //0x00E0 
	char pad_0x00E8[0x18]; //0x00E8
	N0000682F* N000067BE; //0x0100 
	char pad_0x0108[0x20]; //0x0108
	N00006842* N000067C3; //0x0128 
	__int32 m_State; //0x0130 
	Vector2 m_View; //0x0134 
	Vector2 m_DeltaView; //0x013C 
	Vector2 m_AuthoratativeView; //0x0144 
	unsigned char m_SoldierInParachute; //0x014C 
	char pad_0x014D[0x6B]; //0x014D

}; //Size=0x01B8

class N000066F4
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class N000066FE
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006734
{
public:
	char pad_0x0000[0x80]; //0x0000

}; //Size=0x0080

class N0000674F
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006762
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000676D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006770
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006773
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N000067A6
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N000067D1
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000067E4
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class SoldierParachuteComponentData
{
public:
	char pad_0x0000[0x70]; //0x0000
	__int64 m_Binding //+0x70; //0x0070 
	char pad_0x0078[0x5C]; //0x0078
	__int64 m_AimingConstraints; //0x00D4 
	char pad_0x00DC[0x8]; //0x00DC
	float m_UndeployTime; //0x00E4 
	float m_AutoDeployInitialDelay //+0xE8; //0x00E8 
	float m_AutoDeployGroundDistance //+0xEC; //0x00EC 
	float m_AutoDeployMinGroundDistance //+0xF0; //0x00F0 
	unsigned char m_AutoDeployEnabled //+0xF4; //0x00F4 
	unsigned char m_AutoDeployOnceOnSpawnOnly //+0xF5; //0x00F5 
	char pad_0x00F6[0xA]; //0x00F6

}; //Size=0x0100

class N00006848
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N0000686C
{
public:
	char pad_0x0000[0xD4]; //0x0000
	float N000068AE; //0x00D4 
	float N0000688A; //0x00D8 
	float N000068B2; //0x00DC 
	float N0000688B; //0x00E0 
	float N000068B5; //0x00E4 
	float N0000688C; //0x00E8 
	float N00006891; //0x00EC 
	float N0000688D; //0x00F0 
	unsigned char N00006894; //0x00F4 
	unsigned char N00006896; //0x00F5 
	char pad_0x00F6[0x12]; //0x00F6

}; //Size=0x0108

class N0000689C
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N000068A8
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class sdafas
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068D0
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068D3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068D6
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068D9
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068DC
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068DF
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068E2
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068E5
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068E9
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class SoldierParachuteComponentData
{
public:
	char pad_0x0000[0x70]; //0x0000
	N000067B3 SoldierParachuteBinding[1]; //0x0070 
	char pad_0x0078[0x5C]; //0x0078
	AimingConstraintsData AimingConstraintsData; //0x00D4 
	float m_UndeployTime; //0x00E4 
	float m_AutoDeployInitialDelay; //0x00E8 
	float m_AutoDeployGroundDistance; //0x00EC 
	float m_AutoDeployMinGroundDistance; //0x00F0 
	unsigned char m_AutoDeployEnabled; //0x00F4 
	unsigned char m_AutoDeployOnceOnSpawnOnly; //0x00F5 
	char pad_0x00F6[0x92]; //0x00F6

}; //Size=0x0188

class N0000D22A
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D241
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N0000D26D
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D281
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class JEEPCustomization
{
public:
	char pad_0x0000[0x148]; //0x0000

}; //Size=0x0148

class IFVCustomization
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class AAVCustomization
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class FACCustomization
{
public:
	char pad_0x0000[0xA0]; //0x0000
	N0000D871* N0000D843; //0x00A0 
	char pad_0x00A8[0x90]; //0x00A8
	N0000D87E* N0000D856; //0x0138 
	char pad_0x0140[0x30]; //0x0140
	N0000D863* N0000D85D; //0x0170 
	char pad_0x0178[0x20]; //0x0178

}; //Size=0x0198

class JETCustomization
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class USRecon
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class USEngineer
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D326
{
public:
	char pad_0x0000[0x148]; //0x0000
	DWORD N0000D350; //0x0148 
	DWORD N0000D36B; //0x014C 
	DWORD N0000D351; //0x0150 
	char pad_0x0154[0x4C]; //0x0154
	DWORD N0000D35B; //0x01A0 
	DWORD N0000D368; //0x01A4 
	char pad_0x01A8[0x58]; //0x01A8

}; //Size=0x0200

class N0000D388
{
public:
	__int64 N0000D389; //0x0000 
	__int64 N0000D801; //0x0008 

}; //Size=0x0010

class N0000D38B
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006958
{
public:
	char pad_0x0000[0x40]; //0x0000

}; //Size=0x0040

class ClientActiveWeaponHandler
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D2F3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D2FD
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class FirstPersonCameraData
{
public:
	char pad_0x0000[0x20]; //0x0000
	Vector3 m_Offset; //0x0020 
	char pad_0x002C[0x4]; //0x002C
	Vector3 m_WeaponBaseOffset; //0x0030 
	char pad_0x003C[0x4]; //0x003C
	Vector3 m_WeaponLagRotationOffset; //0x0040 
	char pad_0x004C[0x4]; //0x004C
	Vector3 m_Rotation; //0x0050 
	char pad_0x005C[0x4]; //0x005C
	float m_MoveStrafeModifier; //0x0060 
	float N0000D31B; //0x0064 
	float N0000D30E; //0x0068 
	float N0000D326; //0x006C 
	float N0000D30F; //0x0070 
	float N0000D328; //0x0074 
	float N0000D310; //0x0078 
	float N0000D32A; //0x007C 
	float N0000D311; //0x0080 
	float N0000D32C; //0x0084 
	float N0000D31C; //0x0088 
	float N0000D32E; //0x008C 
	float N0000D31D; //0x0090 
	float N0000D330; //0x0094 
	float N0000D31E; //0x0098 
	float N0000D332; //0x009C 
	float N0000D31F; //0x00A0 
	float N0000D334; //0x00A4 
	float N0000D320; //0x00A8 
	float m_RotationAdditionToOffset; //0x00AC 
	char pad_0x00B0[0x18]; //0x00B0

}; //Size=0x00C8

class N0000D369
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D37D
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000D399
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000D3B5
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N0000D3D9
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000D3F5
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class N0000D42D
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 N0000D430; //0x0010 
	__int64 N0000D431; //0x0018 
	char pad_0x0020[0x48]; //0x0020
	float m_ZoomTransitionTime; //0x0068 
	char pad_0x006C[0x4]; //0x006C
	__int64 N0000D43C; //0x0070 
	float m_FovDelayTime; //0x0078 
	float m_FovTransitionTime; //0x007C 
	float m_AimingRange; //0x0080 
	float m_LockAimToTargetSpeed; //0x0084 
	__int64 N0000D43F; //0x0088 
	unsigned char m_ReturnToZoomAfterReload; //0x0090 
	char pad_0x0091[0x7]; //0x0091

}; //Size=0x0098

class N0000D452
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class WeaponModifier
{
public:
	char pad_0x0000[0x38]; //0x0000
	WeaponUnlockAsset* m_pWeaponUnlockAsset; //0x0038 
	unsigned char m_breathControl; //0x0040 
	unsigned char m_supportedShooting; //0x0041 
	unsigned char m_unZoomOnBoltAction; //0x0042 Fixes unzoom when sniping 
	unsigned char m_holdBoltActionUntilZoomRelease; //0x0043 
	char pad_0x0044[0x4]; //0x0044

}; //Size=0x0048

class ControllableFinder : public ControllableResult
{
public:
	char N0000D5A9[88]; //0x007C 
	char pad_0x00D4[0x20]; //0x00D4

}; //Size=0x00F4

class ControllableResult
{
public:
	char pad_0x0000[0x70]; //0x0000
	Vector3 N0000D5A2; //0x0070 

}; //Size=0x007C

class N0000D5D1
{
public:
	char pad_0x0000[0x8]; //0x0000
	N0000D5E4* N0000D5D3; //0x0008 
	char pad_0x0010[0x78]; //0x0010

}; //Size=0x0088

class N0000D5E4
{
public:
	N0000D5F7* N0000D5E5; //0x0000 
	char pad_0x0008[0x80]; //0x0008

}; //Size=0x0088

class N0000D5F7
{
public:
	char pad_0x0000[0x1C8]; //0x0000

}; //Size=0x01C8

class N0000D633
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D63D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D648
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000D666
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D672
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D686
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D6A2
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D6BF
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class ClientDestructionManager
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class GameTime
{
public:
	__int32 m_ticks; //0x0000 
	__int32 m_tickFrequency; //0x0004 
	__int32 m_tickIndexInFrame; //0x0008 
	__int32 m_lastTickIndexInFrame; //0x000C 
	__int32 m_tickCountInFrame; //0x0010 
	float m_deltaTime; //0x0014 
	float m_passedDeltaTimeInFrame; //0x0018 
	char pad_0x001C[0x4]; //0x001C
	double m_time; //0x0020 
	unsigned char m_useVariableDeltaTime; //0x0028 
	char pad_0x0029[0x27]; //0x0029

}; //Size=0x0050

class GunSwayStandData
{
public:
	char pad_0x0000[0x178]; //0x0000

}; //Size=0x0178

class GunSwayCrouchProneData
{
public:
	char pad_0x0000[0xB8]; //0x0000

}; //Size=0x00B8

class GunSwayCrouchProneData
{
public:
	char pad_0x0000[0xB8]; //0x0000

}; //Size=0x00B8

class N0000D7F8
{
public:
	__int64 N0000D7F9; //0x0000 

}; //Size=0x0008

class N0000D7FD
{
public:
	DWORD N0000D7FE; //0x0000 
	char pad_0x0004[0x4]; //0x0004

}; //Size=0x0008

class N0000D808
{
public:
	__int64 N0000D809; //0x0000 
	__int64 N0000D824; //0x0008 
	__int64 N0000D82E; //0x0010 

}; //Size=0x0018

class N0000D81D
{
public:
	__int64 N0000D81E; //0x0000 

}; //Size=0x0008

class N0000D821
{
public:
	__int64 N0000D822; //0x0000 

}; //Size=0x0008

class N0000D827
{
public:
	__int64 N0000D828; //0x0000 

}; //Size=0x0008

class N0000D863
{
public:
	__int64 N0000D864; //0x0000 
	__int64 N0000D865; //0x0008 
	__int64 N0000D866; //0x0010 
	char pad_0x0018[0x30]; //0x0018

}; //Size=0x0048

class N0000D871
{
public:
	__int64 N0000D872; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N0000D87E
{
public:
	__int64 N0000D87F; //0x0000 

}; //Size=0x0008

class N0000D882
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D885
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D888
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D88B
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D88E
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D891
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D894
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D897
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D89A
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D89D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D8A0
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D8A3
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D8A6
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D8A9
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N0000D8AC
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D8AF
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N0000D8B2
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8B5
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8B8
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8BB
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8BE
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8C1
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8C4
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8C7
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8CA
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8CD
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8D0
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8D3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8D6
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8D9
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8DC
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8DF
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8E2
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8E5
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8E8
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8EB
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8EE
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8F1
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8F4
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D8F7
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D9B2
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006C28
{
public:
	char pad_0x0000[0x188]; //0x0000

}; //Size=0x0188

class N00006C62
{
public:
	N00006E9C* N00006C63; //0x0000 
	char pad_0x0008[0x11B8]; //0x0008

}; //Size=0x11C0

class N00006E9C
{
public:
	virtual void Function0(); //
	virtual void Function1(); //
	virtual void Function2(); //
	virtual void Function3(); //
	virtual void Function4(); //
	virtual void Function5(); //
	virtual void Function6(); //
	virtual void Function7(); //
	virtual void Function8(); //
	virtual void Function9(); //

	char pad_0x0000[0x40]; //0x0000
	char pad_0x0048[0x40]; //0x0048
	unsigned char PING; //0x0088 
	char pad_0x0089[0xFF]; //0x0089

}; //Size=0x0188

class N00006EBF
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006ED2
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class WeaponZoomLevelData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float N00006F78; //0x0010 
	char pad_0x0014[0xC]; //0x0014
	__int64 N00006F7A; //0x0020 
	float m_ZoomDisabledTransitionTimer; //0x0028 
	char pad_0x002C[0x4]; //0x002C
	WeaponAnimationSettingsData m_AnimationSettings; //0x0030 
	char pad_0x0078[0x50]; //0x0078

}; //Size=0x00C8

class N00006F8D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class ZoomLevelData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float m_FieldOfView; //0x0010 
	float m_FieldOfViewSP; //0x0014 
	__int64 m_FieldOfViewTransition; //0x0018 
	float m_LookSpeedMultiplier; //0x0020 
	float m_SprintLookSpeedMultiplier; //0x0024 
	float m_MoveSpeedMultiplier; //0x0028 
	float N00006FC8; //0x002C 
	float N00006FA4; //0x0030 
	float N00006FCA; //0x0034 
	float N00006FA5; //0x0038 
	float N00006FCC; //0x003C 
	float N00006FA6; //0x0040 
	float N00006FCE; //0x0044 
	float N00006FA7; //0x0048 
	float N00006FD0; //0x004C 
	float m_DispersionMultiplier; //0x0050 
	float m_DispersionRotation; //0x0054 
	float m_RecoilMultiplier; //0x0058 
	float m_RecoilFovMultiplier; //0x005C 
	float m_CameraImpulseMultiplier; //0x0060 
	float N00006FD6; //0x0064 
	float N00006FAB; //0x0068 
	float N00006FD8; //0x006C 
	float N00006FAC; //0x0070 
	float N00006FDA; //0x0074 
	__int64 m_OnActivateEventType; //0x0078 
	float N00006FAE; //0x0080 
	unsigned char m_AllowFieldOfViewScaling; //0x0084 
	unsigned char m_FadeToBlackInZoomTransition; //0x0085 
	unsigned char m_UseFovSpecialisation; //0x0086 
	unsigned char m_UseWeaponMeshZoom1p; //0x0087 
	char pad_0x0088[0x40]; //0x0088

}; //Size=0x00C8

class N00006FF0
{
public:
	char pad_0x0000[0x58]; //0x0000
	float N00006FFC; //0x0058 
	float N00007003; //0x005C 
	char pad_0x0060[0x28]; //0x0060

}; //Size=0x0088

class WeaponAnimationSettingsData
{
public:
	float N00007007; //0x0000 
	float N00007011; //0x0004 
	float N00007008; //0x0008 
	float N00007013; //0x000C 
	float N00007009; //0x0010 
	float N00007017; //0x0014 
	float N0000700A; //0x0018 
	char pad_0x001C[0x2C]; //0x001C

}; //Size=0x0048

class N0000701C
{
public:
	char pad_0x0000[0x30]; //0x0000
	float N00007023; //0x0030 
	float N00007037; //0x0034 
	char pad_0x0038[0x90]; //0x0038

}; //Size=0x00C8

class N0000F521
{
public:
	char pad_0x0000[0x30]; //0x0000
	float N0000F528; //0x0030 
	float N0000F534; //0x0034 
	char pad_0x0038[0x50]; //0x0038

}; //Size=0x0088

class N0000F537
{
public:
	char pad_0x0000[0x30]; //0x0000
	float N0000F53E; //0x0030 
	float N0000F542; //0x0034 
	char pad_0x0038[0x10]; //0x0038

}; //Size=0x0048

class N0000F545
{
public:
	char pad_0x0000[0x18]; //0x0000
	__int32 N0000F549; //0x0018 
	char pad_0x001C[0x2C]; //0x001C

}; //Size=0x0048

class N0000F550
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000F555
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006688
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OriginSettings
{
public:
	char pad_0x0000[0x20]; //0x0000
	char * m_ContentId; //0x0020 
	char * m_Title; //0x0028 
	char * m_MultiplayerId; //0x0030 
	char * m_Language; //0x0038 
	__int32 OriginTokenType; //0x0040 
	char null[4]; //0x0044 
	char * m_AuthCodeClientId; //0x0048 
	unsigned char m_Enabled; //0x0050 
	unsigned char m_Log; //0x0051 
	unsigned char m_AllowProductionEnvironment; //0x0052 
	char pad_0x0053[0x69]; //0x0053

}; //Size=0x00BC

class N000066A8
{
public:
	char pad_0x0000[0x148]; //0x0000

}; //Size=0x0148

class VeniceOnlineSettings
{
public:
	char pad_0x0000[0xD0]; //0x0000
	char * N00006713; //0x00D0 
	char pad_0x00D8[0x10]; //0x00D8
	char * N00006716; //0x00E8 
	__int32 N00006717; //0x00F0 
	char pad_0x00F4[0x4]; //0x00F4
	__int32 m_PingPeriod; //0x00F8 
	char pad_0x00FC[0x1C]; //0x00FC
	__int32 N0000671F; //0x0118 
	char pad_0x011C[0x4]; //0x011C
	char * m_LogTransmitterUrl; //0x0120 
	__int32 N00006721; //0x0128 
	unsigned char m_EnableSnowroller; //0x012C 
	unsigned char m_PunkBusterActivateClient; //0x012D 
	unsigned char m_PunkBusterActivateServer; //0x012E 
	unsigned char m_PunkBusterKillSwitchActivated; //0x012F 
	unsigned char m_FairFightEnabled; //0x0130 
	unsigned char m_BattlelogMidGameReportActive; //0x0131 
	unsigned char m_IsCommander; //0x0132 
	unsigned char m_EnableProgressionUpload; //0x0133 
	unsigned char m_BlazeDisableDownloadFriendsStats; //0x0134 
	unsigned char m_BlazeDisableAssociationLists; //0x0135 
	unsigned char m_BlazeDisableAllStatsDownloading; //0x0136 
	unsigned char m_DisableMiniGameBrowserAutoUpdate; //0x0137 
	unsigned char m_DisableDurangoVoip; //0x0138 
	unsigned char m_DisableInGameParty; //0x0139 
	unsigned char m_LogTransmitterEnabled; //0x013A 
	unsigned char m_isNoobOnly; //0x013B 
	char pad_0x013C[0x44]; //0x013C

}; //Size=0x0180

class N00006767
{
public:
	char N00006768[8600]; //0x0000 
	char pad_0x2198[0x208]; //0x2198
	N00006C81* N00006BDC; //0x23A0 

}; //Size=0x23A8

class N00006C81
{
public:
	char pad_0x0000[0x10]; //0x0000
	DamageData* m_pDamageData; //0x0010 
	__int32 N00006C85; //0x0018 
	__int32 N00006CB0; //0x001C 
	__int32 N00006C86; //0x0020 
	char pad_0x0024[0x24]; //0x0024

}; //Size=0x0048

class DamageData
{
public:
	char pad_0x0000[0x18]; //0x0000
	char ----------------------[112]; //0x0018 
	__int32 m_VictimPlayerId; //0x0088 
	__int32 m_VictimInstanceId; //0x008C 
	__int32 m_InflictorPlayerId; //0x0090 
	__int32 HitReactionType; //0x0094 
	__int64 m_pWeaponUnlockAsset; //0x0098 
	Vector4 m_Direction; //0x00A0 
	float m_Damage; //0x00B0 
	unsigned char m_ClientAIKilled; //0x00B4 
	char -------------------------[3]; //0x00B5 
	__int32 m_ID; //0x00B8 
	__int32 m_CompressionConstants; //0x00BC 
	__int64 vtable4; //0x00C0 
	char pad_0x00C8[0x8]; //0x00C8
	__int64 vtable5; //0x00D0 

}; //Size=0x00D8

class WeaponUnlockAsset
{
public:
	char pad_0x0000[0x18]; //0x0000
	N0000D409* N0000D3C6; //0x0018 
	char pad_0x0020[0x128]; //0x0020

}; //Size=0x0148

class ClientPeer
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class ClientConnection
{
public:
	char null[9120]; //0x0000 
	ClientDamageStream* m_pClientDamageStream; //0x23A0 
	char pad_0x23A8[0x38]; //0x23A8

}; //Size=0x23E0

class ClientDamageStream
{
public:
	char pad_0x0000[0x10]; //0x0000
	DamageData* m_pDamageData; //0x0010 
	__int32 N00006CDB; //0x0018 
	__int32 m_OnDamageRead; //0x001C 
	__int32 m_OnDamageWrite; //0x0020 
	char pad_0x0024[0x24]; //0x0024

}; //Size=0x0048

class N00006CE2
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000D3ED
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N0000D409
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class Physics
{
public:
	char pad_0x0000[0x30]; //0x0000
	Vector4 m_VaultVector; //0x0030 
	char pad_0x0040[0x48]; //0x0040

}; //Size=0x0088

class AimingConstraintsData
{
public:
	float m_MinYaw; //0x0000 
	float m_MaxYaw; //0x0004 
	float m_MinPitch; //0x0008 
	float m_MaxPitch; //0x000C 

}; //Size=0x0010

class N000067B3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N0000682F
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006842
{
public:
	char pad_0x0000[0x108]; //0x0000

}; //Size=0x0108

class AimingContraints
{
public:
	float N00006866; //0x0000 
	float N00006870; //0x0004 
	float N00006867; //0x0008 
	float N00006873; //0x000C 
	float N00006868; //0x0010 
	float N00006876; //0x0014 
	float N00006869; //0x0018 
	float N00006879; //0x001C 
	char pad_0x0020[0x40]; //0x0020

}; //Size=0x0060

class N0000687C
{
public:
	char pad_0x0000[0xC8]; //0x0000

}; //Size=0x00C8

class N000068A7
{
public:
	N000068B2* N000068A8; //0x0000 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048

class N000068B2
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N000068D4
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N000068E3
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class SoldierAimingConstraintsData
{
public:
	char pad_0x0000[0x10]; //0x0000
	float N000068EA; //0x0010 m_SwimmingConstraints 
	float N000068FD; //0x0014 
	float N000068EB; //0x0018 
	float N00006914; //0x001C 
	char pad_0x0020[0xE0]; //0x0020

}; //Size=0x0100

class N00006911
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OFFSET_AudioSettings
{
public:
	char pad_0x0000[0xC0]; //0x0000

}; //Size=0x00C0

class SoldierAimAssistData
{
public:
	char pad_0x0000[0x20]; //0x0000
	Vector3 m_StickyBoxScale; //0x0020 
	char pad_0x002C[0x4]; //0x002C
	Vector3 N0000689E; //0x0030 
	char pad_0x003C[0x4]; //0x003C
	Vector3 N000068A0; //0x0040 
	char pad_0x004C[0x4]; //0x004C
	Vector3 N000068A2; //0x0050 
	char pad_0x005C[0x4]; //0x005C
	Vector3 N000068A4; //0x0060 
	char pad_0x006C[0x4]; //0x006C
	float N000068A6; //0x0070 
	float N000068D3; //0x0074 
	float N000068A7; //0x0078 
	float N000068D5; //0x007C 
	float N000068A8; //0x0080 
	Vector2 m_MaxAcceleration; //0x0084 
	float N000068DD; //0x008C 
	float N000068B3; //0x0090 
	Vector2 N000068E0; //0x0094 
	float N000068E2; //0x009C 
	float N000068B5; //0x00A0 
	float N000068E5; //0x00A4 
	float N000068B6; //0x00A8 
	float N000068E7; //0x00AC 
	float N000068B7; //0x00B0 
	float N000068E9; //0x00B4 
	float N000068B8; //0x00B8 
	float N000068EB; //0x00BC 
	float N000068B9; //0x00C0 
	float N000068ED; //0x00C4 
	float N000068BA; //0x00C8 
	float N000068EF; //0x00CC 
	float N000068BB; //0x00D0 
	float N000068F1; //0x00D4 
	float N000068BC; //0x00D8 
	float N000068F3; //0x00DC 
	__int32 m_SnapZoomReticlePointPriority; //0x00E0 
	float N00006906; //0x00E4 
	float N000068BE; //0x00E8 
	float N00006909; //0x00EC 
	float N000068BF; //0x00F0 
	float N0000690B; //0x00F4 
	char pad_0x00F8[0x8]; //0x00F8
	float N000068C1; //0x0100 
	float N00006910; //0x0104 
	float N000068C2; //0x0108 
	float N00006914; //0x010C 
	float N000068C3; //0x0110 
	unsigned char m_UseYawAcceleration; //0x0114 
	unsigned char m_UsePitchAcceleration; //0x0115 
	unsigned char m_SnapZoomUserShorterWeaponTime; //0x0116 
	unsigned char m_SnapZoomPostTimeDynamicPoint; //0x0117 
	unsigned char m_ForceSoldierBackupSkeletonCollisionUse; //0x0118 
	char pad_0x0119[0x2F]; //0x0119

}; //Size=0x0148

class OFFSET_PhysicsSettings
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int32 N00006925; //0x0010 
	__int32 N0000693C; //0x0014 
	__int32 N00006926; //0x0018 
	__int32 N0000693E; //0x001C 
	__int32 N00006927; //0x0020 
	__int32 N00006940; //0x0024 
	__int32 N00006928; //0x0028 
	float N00006942; //0x002C 
	__int32 N00006929; //0x0030 
	__int32 N0000694A; //0x0034 
	__int32 N0000692A; //0x0038 
	unsigned char m_Enable; //0x003C 
	unsigned char N0000694F; //0x003D 
	unsigned char N0000695D; //0x003E 
	unsigned char N00006950; //0x003F 
	unsigned char N0000692B; //0x0040 
	unsigned char N00006952; //0x0041 
	unsigned char N00006961; //0x0042 
	unsigned char N00006970; //0x0043 
	unsigned char N00006962; //0x0044 
	unsigned char N00006953; //0x0045 
	unsigned char N00006964; //0x0046 
	unsigned char N00006954; //0x0047 
	unsigned char N0000692C; //0x0048 
	unsigned char N00006956; //0x0049 
	unsigned char N0000695A; //0x004A 
	unsigned char N00006969; //0x004B 
	unsigned char m_EnablePlayerVSAICollisions; //0x004C 
	char pad_0x004D[0x73]; //0x004D

}; //Size=0x00C0

class OFFSET_GameSettings
{
public:
	char pad_0x0000[0x20]; //0x0000
	__int32 m_MaxPlayerCount; //0x0020 
	__int32 m_MaxSpectatorCount; //0x0024 
	__int32 m_MinPlayerCountElimination; //0x0028 
	__int32 m_LogFileCollisionMode; //0x002C 
	__int32 m_LogFileRotationHistoryLength; //0x0030 
	char pad_0x0034[0x4]; //0x0034
	char * m_Level; //0x0038 
	char * m_StartPoint; //0x0040 
	char pad_0x0048[0x8]; //0x0048
	__int32 m_DefaultTeamId; //0x0050 
	__int32 m_PS3ContentRatingAge; //0x0054 
	__int32 m_LogHistory; //0x0058 
	char pad_0x005C[0x4]; //0x005C
	__int64 m_Version; //0x0060 
	char pad_0x0068[0x8]; //0x0068
	char * N0000696D; //0x0070 
	float N0000696E; //0x0078 
	float N00006989; //0x007C 
	float N0000696F; //0x0080 
	char pad_0x0084[0x4]; //0x0084
	PlayerData* m_Player; //0x0088 
	__int64 m_DifficultySettings; //0x0090 
	__int32 m_DifficultyIndex; //0x0098 
	char pad_0x009C[0xC]; //0x009C
	unsigned char m_LogFileEnable; //0x00A8 
	unsigned char m_ResourceRefreshAlwaysAllowed; //0x00A9 
	unsigned char m_UseSpeedBasedDetailedCollision; //0x00AA 
	unsigned char m_UseSingleWeaponSelector; //0x00AB 
	unsigned char m_AutoAimEnabled; //0x00AC 
	unsigned char m_HasUnlimitedAmmo; //0x00AD 
	unsigned char m_HasUnlimitedMags; //0x00AE 
	unsigned char m_RotateLogs; //0x00AF 
	unsigned char m_AdjustVehicleCenterOfMass; //0x00B0 
	unsigned char m_AimAssistEnabled; //0x00B1 
	unsigned char m_AimAssistUsePolynomials; //0x00B2 
	unsigned char m_ForceFreeStreaming; //0x00B3 
	unsigned char m_ForceDisableFreeStreaming; //0x00B4 
	unsigned char m_IsGodMode; //0x00B5 
	unsigned char m_IsJesusMode; //0x00B6 
	unsigned char m_IsJesusModeAi; //0x00B7 
	unsigned char m_CoreParallelDispatchJobsEnabled; //0x00B8 
	unsigned char m_GameAdministrationEnabled; //0x00B9 
	unsigned char m_AllowDestructionOutsideCombatArea; //0x00BA 
	char pad_0x00BB[0x85]; //0x00BB

}; //Size=0x0140

class N000069DB
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class OFFSET_SHOTSTATS
{
public:
	char pad_0x0000[0x40]; //0x0000
	__int32 N000069E7; //0x0040 
	char pad_0x0044[0x8]; //0x0044
	__int32 m_shotsFired; //0x004C 
	char pad_0x0050[0x4]; //0x0050
	__int32 m_shotsHit; //0x0054 
	char pad_0x0058[0x28]; //0x0058

}; //Size=0x0080

class ExplosionEntityData
{
public:
	char pad_0x0000[0x8C]; //0x0000
	float m_EmpTime; //0x008C 
	float m_MaxOcclusionRaycastRadius; //0x0090 
	float m_InnerBlastRadius; //0x0094 
	float m_BlastDamage; //0x0098 
	float m_BlastRadius; //0x009C 
	float m_BlastImpulse; //0x00A0 
	float m_ShockwaveDamage; //0x00A4 
	float m_ShockwaveRadius; //0x00A8 
	float m_ShockwaveImpulse; //0x00AC 
	float m_ShockwaveTime; //0x00B0 
	float m_CameraShockwaveRadius; //0x00B4 
	float m_SpawnDelay; //0x00B8 
	unsigned char m_NoFriendliesEffectOnEnabledFriendlyFire; //0x00BC 
	unsigned char m_UseEntityTransformForDetonationEffect; //0x00BD 
	unsigned char m_SecondaryMaterialsActive; //0x00BE 
	unsigned char m_HasStunEffect; //0x00BF 
	unsigned char m_DisableOcclusion; //0x00C0 
	unsigned char m_DisableStaticEntityOcclusion; //0x00C1 
	unsigned char m_TriggerImpairedHearing; //0x00C2 
	unsigned char m_Enabled; //0x00C3 
	char pad_0x00C4[0x4]; //0x00C4

}; //Size=0x00C8

class N000069FD
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006A67
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006A84
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006A87
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006A90
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006A9B
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

class N00006AAE
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006AB1
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006ABC
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class RagdollComponentData
{
public:
	char pad_0x0000[0x80]; //0x0000
	SkeletonCollisionData* SkeletonCollisionData; //0x0080 
	__int64 N00006ADA; //0x0088 
	char pad_0x0090[0x70]; //0x0090
	char * N00006AED; //0x0100 
	char * N00006AEE; //0x0108 
	N00006B68 N00006AEF[1]; //0x0110 
	N00006B52* N00006AF0; //0x0118 
	char pad_0x0120[0x28]; //0x0120

}; //Size=0x0148

class SkeletonCollisionData
{
public:
	char pad_0x0000[0x10]; //0x0000
	__int64 N00006B01; //0x0010 
	BoneCollisionData* m_BoneCollisionData; //0x0018 
	char pad_0x0020[0x28]; //0x0020

}; //Size=0x0048

class BoneCollisionData
{
public:
	Vector4 m_DebugDrawColor; //0x0000 
	Vector3 m_CapsuleOffset; //0x0010 
	char pad_0x001C[0x44]; //0x001C
	char * m_BoneName; //0x0060 
	__int32 N00006B18; //0x0068 
	DWORD N00006B21; //0x006C 
	__int32 N00006B26; //0x0070 
	float N00006B24; //0x0074 
	float N00006B1A; //0x0078 
	char pad_0x007C[0xC]; //0x007C
	unsigned char N00006B2D; //0x0088 
	unsigned char N00006B30; //0x0089 
	unsigned char N00006B34; //0x008A 
	unsigned char N00006B37; //0x008B 
	char pad_0x008C[0xC]; //0x008C

}; //Size=0x0098

class N00006B3A
{
public:
	DWORD N00006B3B; //0x0000 
	DWORD N00006B46; //0x0004 
	DWORD N00006B3C; //0x0008 
	char pad_0x000C[0x3C]; //0x000C

}; //Size=0x0048

class N00006B4C
{
public:
	DWORD N00006B4D; //0x0000 
	char pad_0x0004[0x4]; //0x0004

}; //Size=0x0008

class N00006B52
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006B5D
{
public:
	char pad_0x0000[0x48]; //0x0000

}; //Size=0x0048

class N00006B68
{
public:
	char pad_0x0000[0x8]; //0x0000

}; //Size=0x0008

class N00006A81
{
public:
	char pad_0x0000[0x88]; //0x0000

}; //Size=0x0088

